[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2w2s8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Authors, songwriters, poets, screenwriters…  it seems like everyone is trying to do a favor to humanity these days by reminding us that life is precious.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Do you realize that everyone you know someday will die… and instead of saying all of your goodbyes, let them know you realize that life moves fast, it&amp;#39;s hard to make the good things last…&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;In developed nations, depression is an epidemic. Although I haven&amp;#39;t been diagnosed and haven&amp;#39;t been to see anyone, I&amp;#39;m willing to hazard a guess that I should count myself among them.&lt;/p&gt;\n\n&lt;p&gt;It seems to me that the sense of helplessness and powerlessness that comes from a deep reflection on the passage of time, how it accelerates with age, and how it is inevitably followed by an everlasting nothingness (sorry religious folk, I just realized you&amp;#39;re not my target audience; keep on believing you happy, wonderful souls!), plays a major part in this.&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;re all trying to escape death. Those of us who immediately reply &amp;quot;nuh-uh! Not me! I think living forever sounds scary!&amp;quot; are the only ones who have really succeeded at duping themselves— that&amp;#39;s a great defense mechanism if you can buy into it. Religion is the other great one, again, only if you can make yourself swallow it. &lt;/p&gt;\n\n&lt;p&gt;For the rest of us who are a bit more skeptical and self-reflective, we need distractions. We want to fight it, of course, but we can&amp;#39;t. Every attempt to fight it is doomed to fail. I think even the ostensibly positive lyrics quoted above, which pretend to offer a solution, are again just another vain attempt to beat it back. Telling everyone you love them and life moves fast won&amp;#39;t make it move any slower. Being told to enjoy life in your 20s because life speeds up and tomorrow you&amp;#39;ll be 50 is again, a nice thought, but doesn&amp;#39;t help. If anything, these things make it WORSE. If you&amp;#39;re constantly trying to enjoy life, worried that if you don&amp;#39;t enjoy it enough you&amp;#39;ll miss out, you enjoy it less. &lt;/p&gt;\n\n&lt;p&gt;We can&amp;#39;t hang onto it. We can&amp;#39;t &amp;quot;get more out of it.&amp;quot; Being reminded of our mortality doesn&amp;#39;t motivate us, it just scares us. As an example, it&amp;#39;s great advice to make sure everyone around you knows you love them. This is important and makes us happy. But why put this song lyric in the context of the inevitability of death? Why not just sing &amp;quot;hey, Christmas is around the corner, tell everyone you love them!&amp;quot; It was put in a song about death because it&amp;#39;s an attempt to beat it back. I think that the reason these messages are so prominent in modern media is because the produces of those media believe they can fight back their own mortality through this work. They can&amp;#39;t quite solve the problem on their own, but they think they can find a noble purpose in life by solving it for other people… without realizing that the message fails regardless of whose ears it hits. I think producers of media and narratives should just give it a rest and go back to entertaining us.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;Hello, users of CMV! This is a footnote from your moderators. We&amp;#39;d just like to remind you of a couple of things. Firstly, please remember to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! If you are thinking about submitting a CMV yourself, please have a look through our&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/populartopics\"&gt;popular topics wiki&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;first. Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Authors, songwriters, poets, screenwriters…  it seems like everyone is trying to do a favor to humanity these days by reminding us that life is precious.\n\n\"Do you realize that everyone you know someday will die… and instead of saying all of your goodbyes, let them know you realize that life moves fast, it's hard to make the good things last…\"\n\nIn developed nations, depression is an epidemic. Although I haven't been diagnosed and haven't been to see anyone, I'm willing to hazard a guess that I should count myself among them.\n\nIt seems to me that the sense of helplessness and powerlessness that comes from a deep reflection on the passage of time, how it accelerates with age, and how it is inevitably followed by an everlasting nothingness (sorry religious folk, I just realized you're not my target audience; keep on believing you happy, wonderful souls!), plays a major part in this.\n\nWe're all trying to escape death. Those of us who immediately reply \"nuh-uh! Not me! I think living forever sounds scary!\" are the only ones who have really succeeded at duping themselves— that's a great defense mechanism if you can buy into it. Religion is the other great one, again, only if you can make yourself swallow it. \n\nFor the rest of us who are a bit more skeptical and self-reflective, we need distractions. We want to fight it, of course, but we can't. Every attempt to fight it is doomed to fail. I think even the ostensibly positive lyrics quoted above, which pretend to offer a solution, are again just another vain attempt to beat it back. Telling everyone you love them and life moves fast won't make it move any slower. Being told to enjoy life in your 20s because life speeds up and tomorrow you'll be 50 is again, a nice thought, but doesn't help. If anything, these things make it WORSE. If you're constantly trying to enjoy life, worried that if you don't enjoy it enough you'll miss out, you enjoy it less. \n\nWe can't hang onto it. We can't \"get more out of it.\" Being reminded of our mortality doesn't motivate us, it just scares us. As an example, it's great advice to make sure everyone around you knows you love them. This is important and makes us happy. But why put this song lyric in the context of the inevitability of death? Why not just sing \"hey, Christmas is around the corner, tell everyone you love them!\" It was put in a song about death because it's an attempt to beat it back. I think that the reason these messages are so prominent in modern media is because the produces of those media believe they can fight back their own mortality through this work. They can't quite solve the problem on their own, but they think they can find a noble purpose in life by solving it for other people… without realizing that the message fails regardless of whose ears it hits. I think producers of media and narratives should just give it a rest and go back to entertaining us.\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "3z1ruc", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "iwillnotgetaddicted", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 11, "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "num_comments": 24, "thumbnail": "", "hide_score": false, "edited": 1451677891.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 539231, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_3z1ruc", "spoiler": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1451706456.0, "url": "https://www.reddit.com/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/", "author_flair_text": null, "quarantine": false, "title": "CMV: Ubiquitous reminders of our mortality and the passing of time are, despite being done with good intentions, harmful to mental wellbeing.", "created_utc": 1451677656.0, "subreddit_name_prefixed": "r/changemyview", "distinguished": null, "media": null, "upvote_ratio": 0.76, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 11}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 7, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyjh0gt", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Holypoopsticks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyj59j5", "score": 1, "approved_by": null, "downs": 0, "body": "From reading your post and your responses, you're obviously intelligent. I don't believe a degree necessarily makes you any more or less prone to understanding the world accurately, and you're clearly someone who wants to think about and understand things.\n\nI'm not a religious person. I've practiced meditation for a lot of years, but I'm an atheist through and through. I don't have any belief in the supernatural. I'm not sure from your post if you're atheist or not. I do think religion can help insulate a person from the fear of death, but again I'm not convinced that this insulation is a good thing. I think those (religious or not) that learn to turn and look at the nature of their own existence and the nature of their life tend to be more authentically happy, because when they are happy, it is in spite of really understanding and knowing the limitations of being human.\n\nI'm going to guess from your post and your thoughtful response that even if you want to, you won't really be able to keep yourself from considering the temporary nature of your own life. You're too smart not to. Trying to insulate yourself is probably not going to work for you because you can't keep the thoughts out. Your mind is too inquisitive. You wouldn't have posted this in the first place if it weren't the case. \n\nMy argument would be, rather than trying to avoid something (that your mind won't allow you to avoid even if you want to), learn to turn towards it. Slow and progressive exposure therapy is the most successful form of treatment for a phobia. Your phobia is death. Without getting morbid about it, learn to embrace it a bit. \n\nI've found over the years that my fear of death has lessened quite a bit. I'm still nervous about the idea of experiencing death as it happens, but I'm not at all worried about what comes afterward.\n\nI've also found that my problems seem generally smaller, my life is less dramatic, and I try and live my life well, because I know it doesn't last.\n\nUltimately you have to find the path forward that works for you, but I'm not at all convinced that your hope to avoid death exposure is either going to work from you or really protect you from anything. At best, any happiness you experience while trying to avoid death will just be a thin veneer covering up an ever increasing existential dread.", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;From reading your post and your responses, you&amp;#39;re obviously intelligent. I don&amp;#39;t believe a degree necessarily makes you any more or less prone to understanding the world accurately, and you&amp;#39;re clearly someone who wants to think about and understand things.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not a religious person. I&amp;#39;ve practiced meditation for a lot of years, but I&amp;#39;m an atheist through and through. I don&amp;#39;t have any belief in the supernatural. I&amp;#39;m not sure from your post if you&amp;#39;re atheist or not. I do think religion can help insulate a person from the fear of death, but again I&amp;#39;m not convinced that this insulation is a good thing. I think those (religious or not) that learn to turn and look at the nature of their own existence and the nature of their life tend to be more authentically happy, because when they are happy, it is in spite of really understanding and knowing the limitations of being human.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m going to guess from your post and your thoughtful response that even if you want to, you won&amp;#39;t really be able to keep yourself from considering the temporary nature of your own life. You&amp;#39;re too smart not to. Trying to insulate yourself is probably not going to work for you because you can&amp;#39;t keep the thoughts out. Your mind is too inquisitive. You wouldn&amp;#39;t have posted this in the first place if it weren&amp;#39;t the case. &lt;/p&gt;\n\n&lt;p&gt;My argument would be, rather than trying to avoid something (that your mind won&amp;#39;t allow you to avoid even if you want to), learn to turn towards it. Slow and progressive exposure therapy is the most successful form of treatment for a phobia. Your phobia is death. Without getting morbid about it, learn to embrace it a bit. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve found over the years that my fear of death has lessened quite a bit. I&amp;#39;m still nervous about the idea of experiencing death as it happens, but I&amp;#39;m not at all worried about what comes afterward.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve also found that my problems seem generally smaller, my life is less dramatic, and I try and live my life well, because I know it doesn&amp;#39;t last.&lt;/p&gt;\n\n&lt;p&gt;Ultimately you have to find the path forward that works for you, but I&amp;#39;m not at all convinced that your hope to avoid death exposure is either going to work from you or really protect you from anything. At best, any happiness you experience while trying to avoid death will just be a thin veneer covering up an ever increasing existential dread.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyjh0gt", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyjh0gt/", "num_reports": null, "stickied": false, "created": 1451787053.0, "author_flair_text": "16∆", "created_utc": 1451758253.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyj59j5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyio3dl", "score": 2, "approved_by": null, "downs": 0, "body": "Thanks for a truly thoughtful and meaningful response. It's hard to argue with a psychologist who has traveled in developing nations! I have a great friend, literally the smartest person I know— she speaks fluent Swahili, English, Spanish, and has about a gazillion degrees, albeit from a crazy conservative religious school. She's a faith-based marriage/family therapist. We've talked a lot about how experiencing death on a regular basis affects how people perceive it. She is particularly fascinated by people in old times who had large families, knowing that many of their children would die. I think there is even a book on it that she read? Possibly related, I don't know, but I know studies on happiness have shown that as people age, they tend to become more accepting of death, and happier in general. (I think I read that in The How of Happiness by Sonja Lyrobomirski— ps don't quote me on the spelling of that last name). Taken together, it almost seems obstinate for me to maintain my position that exposure to death makes it worse. But I guess I'm not convinced that seeing the death of another is the same mental process as reflecting on your own. I mean, I think it takes a particular kind of self-perception to really realize that you're going to die. Of course religion also helps— I think in developing nations, there is often a strong belief in life after death. Maybe this is self-centered/Nationalistic/whatever of me but I think materialism is the obviously correct worldview, but it's not easy to realize this if you don't have a lot of education in biology, history, etc. I mean I get how this thing called life can seem like a separate entity from our physical brain, and I see how hard it is for some to get rid of this view. I think it's natural to think that way. And if you think that way, seeing someone else die can be jarring, and make you reflect on the fragility and preciousness of life… but I don't think that's the same as reflecting on your own eternal non-existence, especially if you think your \"life\" can just float out of your body and go on somewhere else, either in heaven, or another being, etc.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for a truly thoughtful and meaningful response. It&amp;#39;s hard to argue with a psychologist who has traveled in developing nations! I have a great friend, literally the smartest person I know— she speaks fluent Swahili, English, Spanish, and has about a gazillion degrees, albeit from a crazy conservative religious school. She&amp;#39;s a faith-based marriage/family therapist. We&amp;#39;ve talked a lot about how experiencing death on a regular basis affects how people perceive it. She is particularly fascinated by people in old times who had large families, knowing that many of their children would die. I think there is even a book on it that she read? Possibly related, I don&amp;#39;t know, but I know studies on happiness have shown that as people age, they tend to become more accepting of death, and happier in general. (I think I read that in The How of Happiness by Sonja Lyrobomirski— ps don&amp;#39;t quote me on the spelling of that last name). Taken together, it almost seems obstinate for me to maintain my position that exposure to death makes it worse. But I guess I&amp;#39;m not convinced that seeing the death of another is the same mental process as reflecting on your own. I mean, I think it takes a particular kind of self-perception to really realize that you&amp;#39;re going to die. Of course religion also helps— I think in developing nations, there is often a strong belief in life after death. Maybe this is self-centered/Nationalistic/whatever of me but I think materialism is the obviously correct worldview, but it&amp;#39;s not easy to realize this if you don&amp;#39;t have a lot of education in biology, history, etc. I mean I get how this thing called life can seem like a separate entity from our physical brain, and I see how hard it is for some to get rid of this view. I think it&amp;#39;s natural to think that way. And if you think that way, seeing someone else die can be jarring, and make you reflect on the fragility and preciousness of life… but I don&amp;#39;t think that&amp;#39;s the same as reflecting on your own eternal non-existence, especially if you think your &amp;quot;life&amp;quot; can just float out of your body and go on somewhere else, either in heaven, or another being, etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj59j5", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj59j5/", "num_reports": null, "stickied": false, "created": 1451752809.0, "author_flair_text": null, "created_utc": 1451724009.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "more", "data": {"count": 1, "name": "t1_cyje9jy", "id": "cyje9jy", "parent_id": "t1_cyio3dl", "depth": 1, "children": ["cyje9jy"]}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyio3dl", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Holypoopsticks", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 7, "approved_by": null, "downs": 0, "body": "Interestingly, I hold almost the polar opposite perspective. I'm not suggesting that that pop-culture reminders of how temporary life is are good, don't get me wrong, I'm just not sure that we're overly exposed to the temporary nature of life in developed nations. \n\nI certainly agree that in more developed nations depression is arguably an epidemic, but if exposure to death is the cause of such an experience, why don't we always see those same trends in less developed countries where individuals are almost certainly exposed to more death than we are?\n\nBeing a psychologist and someone who has traveled a bit and stayed in less developed countries, I've often been amazed and overwhelmed by the friendliness of strangers or the happiness of those living in relatively extreme poverty. It's not universal of course, but often times in less developed countries people simply have a different relationship with death. In the US, when someone dies, it's almost rare to see them before the body is rushed off to a secluded place and made to look as \"alive\" as possible before it is again removed from view.\n\nIn many other much less developed countries you may find families preparing the bodies of loved ones for burial. Children are exposed to death from a young age, so it isn't quite as foreign to them. They adjust while young and it isn't so shocking when they reach adulthood. We, on the other hand, are often more insulated from death than most historical societies. We are often only reminded of death in the occasional abstract way, and when we do finally confront its reality, it can be a harsh and eye opening experience. Our unchallenged sense of our own permanence is called into question and this is often uncomfortable for most of us.\n\nI'm also not sure that further insulation from death is a good answer to \"feeling\" better about it. In more developed countries we're not necessarily depressed because we're too exposed (although of course, in war torn regions great exposure to death can obviously be devastating, but even some of the stories of childhood soldiers having been rehabilitated is quite amazing). It is possible to make some degree of peace with the nature of our own temporary experience. People do it all the time. \n\nAnd what does insulating ourselves form death really protect us from? Eventually, if we're \"lucky\" enough to live a long life, being exposed isn't even an avoidable experience anyway. Sooner or later it will show up and if we weren't fortunate enough to learn good coping skills to deal with it in the past, it will likely be more difficult than ever to confront.\n\nI think hiding from death is worse, in some ways, than acknowledging and accepting the nature of our own existence. Death informs a well lived life. If we ignore the passage of time, our ever changing circumstances, and don't do our best to live fully because we recognize that we really don't have forever, then when those moments do arrive where we're finally confronted with the unavoidable nature of our own death, we're left with regrets. Because we didn't do the things that would have been important to a person who knew they didn't have forever to do it all.\n\nI'd rather see the coming loss and live well in advance of it, than to pretend it wasn't coming and be full of regrets when it finally arrives.", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Interestingly, I hold almost the polar opposite perspective. I&amp;#39;m not suggesting that that pop-culture reminders of how temporary life is are good, don&amp;#39;t get me wrong, I&amp;#39;m just not sure that we&amp;#39;re overly exposed to the temporary nature of life in developed nations. &lt;/p&gt;\n\n&lt;p&gt;I certainly agree that in more developed nations depression is arguably an epidemic, but if exposure to death is the cause of such an experience, why don&amp;#39;t we always see those same trends in less developed countries where individuals are almost certainly exposed to more death than we are?&lt;/p&gt;\n\n&lt;p&gt;Being a psychologist and someone who has traveled a bit and stayed in less developed countries, I&amp;#39;ve often been amazed and overwhelmed by the friendliness of strangers or the happiness of those living in relatively extreme poverty. It&amp;#39;s not universal of course, but often times in less developed countries people simply have a different relationship with death. In the US, when someone dies, it&amp;#39;s almost rare to see them before the body is rushed off to a secluded place and made to look as &amp;quot;alive&amp;quot; as possible before it is again removed from view.&lt;/p&gt;\n\n&lt;p&gt;In many other much less developed countries you may find families preparing the bodies of loved ones for burial. Children are exposed to death from a young age, so it isn&amp;#39;t quite as foreign to them. They adjust while young and it isn&amp;#39;t so shocking when they reach adulthood. We, on the other hand, are often more insulated from death than most historical societies. We are often only reminded of death in the occasional abstract way, and when we do finally confront its reality, it can be a harsh and eye opening experience. Our unchallenged sense of our own permanence is called into question and this is often uncomfortable for most of us.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m also not sure that further insulation from death is a good answer to &amp;quot;feeling&amp;quot; better about it. In more developed countries we&amp;#39;re not necessarily depressed because we&amp;#39;re too exposed (although of course, in war torn regions great exposure to death can obviously be devastating, but even some of the stories of childhood soldiers having been rehabilitated is quite amazing). It is possible to make some degree of peace with the nature of our own temporary experience. People do it all the time. &lt;/p&gt;\n\n&lt;p&gt;And what does insulating ourselves form death really protect us from? Eventually, if we&amp;#39;re &amp;quot;lucky&amp;quot; enough to live a long life, being exposed isn&amp;#39;t even an avoidable experience anyway. Sooner or later it will show up and if we weren&amp;#39;t fortunate enough to learn good coping skills to deal with it in the past, it will likely be more difficult than ever to confront.&lt;/p&gt;\n\n&lt;p&gt;I think hiding from death is worse, in some ways, than acknowledging and accepting the nature of our own existence. Death informs a well lived life. If we ignore the passage of time, our ever changing circumstances, and don&amp;#39;t do our best to live fully because we recognize that we really don&amp;#39;t have forever, then when those moments do arrive where we&amp;#39;re finally confronted with the unavoidable nature of our own death, we&amp;#39;re left with regrets. Because we didn&amp;#39;t do the things that would have been important to a person who knew they didn&amp;#39;t have forever to do it all.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d rather see the coming loss and live well in advance of it, than to pretend it wasn&amp;#39;t coming and be full of regrets when it finally arrives.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyio3dl", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyio3dl/", "num_reports": null, "stickied": false, "created": 1451715611.0, "author_flair_text": "16∆", "created_utc": 1451686811.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyjisgy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ExploreMeDora", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyji7p6", "score": 2, "approved_by": null, "downs": 0, "body": "You're looking at it very narrowly. Isolated incidents such as the choice to eat paper. Look at it on a grander scale. Living creatures are constantly trying to preserve life. That is the fundamental purpose of life, even for the most basic of species. Food, water, shelter, reproduction, etc. All living creatures seek to attain these things. Human beings follow the same patterns. For many other organisms, such as fleas or grass, preserving life is an automatic instinct. However, humans have greater knowledge than many other living organisms. We are aware of our own existence and we are aware that we are going to die. \n\nYou are arguing that we would still value the same things if we were immortal. However, most of ours values have developed because we are mortal. We eat cake because we want food to survive. We have babies because we want to raise children who will carry on our heritage. If we never had the threat of mortality why would we develop those values? Eating would not be of value. Reproduction would not be of value. Working would not be of value.", "edited": 1451761446.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re looking at it very narrowly. Isolated incidents such as the choice to eat paper. Look at it on a grander scale. Living creatures are constantly trying to preserve life. That is the fundamental purpose of life, even for the most basic of species. Food, water, shelter, reproduction, etc. All living creatures seek to attain these things. Human beings follow the same patterns. For many other organisms, such as fleas or grass, preserving life is an automatic instinct. However, humans have greater knowledge than many other living organisms. We are aware of our own existence and we are aware that we are going to die. &lt;/p&gt;\n\n&lt;p&gt;You are arguing that we would still value the same things if we were immortal. However, most of ours values have developed because we are mortal. We eat cake because we want food to survive. We have babies because we want to raise children who will carry on our heritage. If we never had the threat of mortality why would we develop those values? Eating would not be of value. Reproduction would not be of value. Working would not be of value.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyjisgy", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyjisgy/", "num_reports": null, "stickied": false, "created": 1451790029.0, "author_flair_text": "8∆", "created_utc": 1451761229.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyji7p6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyjacns", "score": 1, "approved_by": null, "downs": 0, "body": "You're just not getting it. What you're saying fundamentally makes no sense at all.\n\nTime or the lack of it does not change the intrinsic value of things we can do. If something is pointless and worthless, adding death to the equation doesn't make them have a point or have value. You're basically saying \"everything we do in life is so pointless and dull that we wouldn't even bother doing it if we could live forever.\" But that just reinforces the argument that life is pointless anyway.\n\nLook, suppose you put me in a room full of pieces of paper. I have no desire to eat that paper. Your argument basically goes \"well if I tell you you're only in that room for an hour, then you can never go in again, it will motivate you to eat paper.\" No, it won't, because there is no value to eating paper. I won't do it with unlimited time, and I won't do it if there is a deadline.\n\nNow if you fill the room with cake, I will eat the cake whether I have a deadline or not, because cake is delicious. As I already acknowledged, I might move my schedule up if there's a deadline. I might eat so much cake I get sick, because I will have no more cake come tomorrow. But it's not going to change whether I eat cake or not. And I don't see what's good about being forced to rush around and eat a bunch of cake, doing it so fast it negatively impacts my enjoyment of it, just becuase there's a looming deadline.\n\nFucking feels good, hence relationships, hence children. Many people already don't have children these days; are they just people who dont' realize they're going to die? No, they decided they don't want children. Period. If we were immortal, people would still fuck, because it still would feel good. People would still hang out and play XBox becuase it's fun. People would still go on walks.\n\nWould we rush around like chickens with our heads cut off striving to accomplish anything we can before we die? No, we would probably be more relaxed and take our time about it. But we would still be humans with brains capable of releasing pleasure hormones and minds capable of appreciating beauty. I don't know why you think we'd all become unfeeling robots who don't seek out pleasure or try to avoid pain just because we won't die.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re just not getting it. What you&amp;#39;re saying fundamentally makes no sense at all.&lt;/p&gt;\n\n&lt;p&gt;Time or the lack of it does not change the intrinsic value of things we can do. If something is pointless and worthless, adding death to the equation doesn&amp;#39;t make them have a point or have value. You&amp;#39;re basically saying &amp;quot;everything we do in life is so pointless and dull that we wouldn&amp;#39;t even bother doing it if we could live forever.&amp;quot; But that just reinforces the argument that life is pointless anyway.&lt;/p&gt;\n\n&lt;p&gt;Look, suppose you put me in a room full of pieces of paper. I have no desire to eat that paper. Your argument basically goes &amp;quot;well if I tell you you&amp;#39;re only in that room for an hour, then you can never go in again, it will motivate you to eat paper.&amp;quot; No, it won&amp;#39;t, because there is no value to eating paper. I won&amp;#39;t do it with unlimited time, and I won&amp;#39;t do it if there is a deadline.&lt;/p&gt;\n\n&lt;p&gt;Now if you fill the room with cake, I will eat the cake whether I have a deadline or not, because cake is delicious. As I already acknowledged, I might move my schedule up if there&amp;#39;s a deadline. I might eat so much cake I get sick, because I will have no more cake come tomorrow. But it&amp;#39;s not going to change whether I eat cake or not. And I don&amp;#39;t see what&amp;#39;s good about being forced to rush around and eat a bunch of cake, doing it so fast it negatively impacts my enjoyment of it, just becuase there&amp;#39;s a looming deadline.&lt;/p&gt;\n\n&lt;p&gt;Fucking feels good, hence relationships, hence children. Many people already don&amp;#39;t have children these days; are they just people who dont&amp;#39; realize they&amp;#39;re going to die? No, they decided they don&amp;#39;t want children. Period. If we were immortal, people would still fuck, because it still would feel good. People would still hang out and play XBox becuase it&amp;#39;s fun. People would still go on walks.&lt;/p&gt;\n\n&lt;p&gt;Would we rush around like chickens with our heads cut off striving to accomplish anything we can before we die? No, we would probably be more relaxed and take our time about it. But we would still be humans with brains capable of releasing pleasure hormones and minds capable of appreciating beauty. I don&amp;#39;t know why you think we&amp;#39;d all become unfeeling robots who don&amp;#39;t seek out pleasure or try to avoid pain just because we won&amp;#39;t die.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyji7p6", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyji7p6/", "num_reports": null, "stickied": false, "created": 1451789062.0, "author_flair_text": null, "created_utc": 1451760262.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyjacns", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ExploreMeDora", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyj5b6w", "score": 1, "approved_by": null, "downs": 0, "body": "If we are immortal we have all the time in the world. In fact, everyone would have all the time in the world. Since we know we are going to expire we are pressured to accomplish things. We almost have a system. School and education. Learn a trade. Get a job. Meet a spouse. Get married. Have children and raise them. Retire. \n\n&gt; Are you seriously saying if you had the ability to live forever, you would forgo things like relationships, creative endeavors, sensual experiences, and so on? \n\nProbably! Imagine if we were all immortal? So many things we do are motivated by our will to live and to accomplish things within our lifetime. Eliminate both of those and we have an entirely different body of external stressors or stimulation.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If we are immortal we have all the time in the world. In fact, everyone would have all the time in the world. Since we know we are going to expire we are pressured to accomplish things. We almost have a system. School and education. Learn a trade. Get a job. Meet a spouse. Get married. Have children and raise them. Retire. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Are you seriously saying if you had the ability to live forever, you would forgo things like relationships, creative endeavors, sensual experiences, and so on? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Probably! Imagine if we were all immortal? So many things we do are motivated by our will to live and to accomplish things within our lifetime. Eliminate both of those and we have an entirely different body of external stressors or stimulation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyjacns", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyjacns/", "num_reports": null, "stickied": false, "created": 1451773216.0, "author_flair_text": "8∆", "created_utc": 1451744416.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyj5b6w", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyiywst", "score": 1, "approved_by": null, "downs": 0, "body": "This doesn't make sense. If accomplishing things has no intrinsic value, then why does it matter if we do them before death? If they have intrinsic value to us, then we would do them regardless of the threat of death, although perhaps on a different timeline. Are you seriously saying if you had the ability to live forever, you would forgo things like relationships, creative endeavors, sensual experiences, and so on? \"Why enjoy life, it's not like I'm ever gonna die!\"", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This doesn&amp;#39;t make sense. If accomplishing things has no intrinsic value, then why does it matter if we do them before death? If they have intrinsic value to us, then we would do them regardless of the threat of death, although perhaps on a different timeline. Are you seriously saying if you had the ability to live forever, you would forgo things like relationships, creative endeavors, sensual experiences, and so on? &amp;quot;Why enjoy life, it&amp;#39;s not like I&amp;#39;m ever gonna die!&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj5b6w", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj5b6w/", "num_reports": null, "stickied": false, "created": 1451752979.0, "author_flair_text": null, "created_utc": 1451724179.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyiywst", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ExploreMeDora", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 2, "approved_by": null, "downs": 0, "body": "Many find purpose in life and death. Without the threat of death most of us would not be motivated to accomplish anything.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Many find purpose in life and death. Without the threat of death most of us would not be motivated to accomplish anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyiywst", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyiywst/", "num_reports": null, "stickied": false, "created": 1451736571.0, "author_flair_text": "8∆", "created_utc": 1451707771.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyj5a3h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyims3y", "score": 1, "approved_by": null, "downs": 0, "body": "Thanks for the Vonnegut. I haven't read Timequake, but I've read 4 or 5 of his other books, and he always has something unique to tell me about the human condition. Sometimes I can't tell if we have the same ideas, or if I somehow heard about his ideas and forgot. I just picked up Bluebeard (I got 80% through it about 5 years ago, loaned it to a sick friend who needed reading material during a trip, and never got it back) and finished it, and there's a part where he talks about how when we lived in smaller groups with less interconnectivity, everyone could have a special talent— the best hunter, the best singer, the best textile manufacturer, the best cook, etc, but with TV we are always in contact with the best in the world, and our own talents are meagre in comparison. I've thought about this so much, and didn't realize it was from Vonnegut. Maybe I had already thought about this and when I read Bluebeard the first time, I was like \"YEAH! My thoughts exactly!\" or maybe he put it in my head 5 years ago, and I just forgot.\n\nMaybe I'll check out that book. I also want to read some late Terry Pratchett. Can you believe I've only ever read one of his books? He faced death with the courage I suppose you have to, though he said he obviously wasn't happy about it. \n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the Vonnegut. I haven&amp;#39;t read Timequake, but I&amp;#39;ve read 4 or 5 of his other books, and he always has something unique to tell me about the human condition. Sometimes I can&amp;#39;t tell if we have the same ideas, or if I somehow heard about his ideas and forgot. I just picked up Bluebeard (I got 80% through it about 5 years ago, loaned it to a sick friend who needed reading material during a trip, and never got it back) and finished it, and there&amp;#39;s a part where he talks about how when we lived in smaller groups with less interconnectivity, everyone could have a special talent— the best hunter, the best singer, the best textile manufacturer, the best cook, etc, but with TV we are always in contact with the best in the world, and our own talents are meagre in comparison. I&amp;#39;ve thought about this so much, and didn&amp;#39;t realize it was from Vonnegut. Maybe I had already thought about this and when I read Bluebeard the first time, I was like &amp;quot;YEAH! My thoughts exactly!&amp;quot; or maybe he put it in my head 5 years ago, and I just forgot.&lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;ll check out that book. I also want to read some late Terry Pratchett. Can you believe I&amp;#39;ve only ever read one of his books? He faced death with the courage I suppose you have to, though he said he obviously wasn&amp;#39;t happy about it. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj5a3h", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj5a3h/", "num_reports": null, "stickied": false, "created": 1451752868.0, "author_flair_text": null, "created_utc": 1451724068.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyims3y", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Demiansmark", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 1, "approved_by": null, "downs": 0, "body": "Very meta post since it is itself a reminder. Based on your post I'd hazard a guess that we have similar world views. I can't find the exact quote but I believe Kurt Vonnegut put forth the ability to laugh at the absurd as a way around existential despair. \n\nPersonally its been a long path of teenage angst and depression but now in my 30s with children I am at a good place of knowing I will die and feel 'so what' about it. \n\n\"Many people need desperately to receive this message: 'I feel and think much as you do, care about many of the things you care about, although most people do not care about them. You are not alone.\" -Vonnegut, Timequake ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Very meta post since it is itself a reminder. Based on your post I&amp;#39;d hazard a guess that we have similar world views. I can&amp;#39;t find the exact quote but I believe Kurt Vonnegut put forth the ability to laugh at the absurd as a way around existential despair. &lt;/p&gt;\n\n&lt;p&gt;Personally its been a long path of teenage angst and depression but now in my 30s with children I am at a good place of knowing I will die and feel &amp;#39;so what&amp;#39; about it. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Many people need desperately to receive this message: &amp;#39;I feel and think much as you do, care about many of the things you care about, although most people do not care about them. You are not alone.&amp;quot; -Vonnegut, Timequake &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyims3y", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyims3y/", "num_reports": null, "stickied": false, "created": 1451713160.0, "author_flair_text": null, "created_utc": 1451684360.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyj5ai2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyiom04", "score": 1, "approved_by": null, "downs": 0, "body": "The idea of \"getting used to death\" is one that I don't think fits our biology. We evolve to fear death and escape it by any means possible. Our mind allows us to find \"escapes\" in non-literal ways that might satisfy some of that desire, but I don't think that we as a species can actually become accustomed to and comfortable with the idea of never again existing. I think the only people who can really get used to this are those people who have weak imaginations and think of death as a black void \"until…\", or turning from a body into a spirit, as opposed to more deeply contemplating not existing at all forever.\n\nI'm interested in the idea that ignoring death makes the fear increase. I've sometimes fantasized about risking my life— joining the army (I'm too old I think at 30) and seeking a combat position, or taking up extreme sports, or simply finding heroin or similar and taking way too much of it. I figure this way, if death comes, it'll come suddenly and I will be distracted by whatever else is going on, and if I live, maybe I'll fear it less. I don't know.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The idea of &amp;quot;getting used to death&amp;quot; is one that I don&amp;#39;t think fits our biology. We evolve to fear death and escape it by any means possible. Our mind allows us to find &amp;quot;escapes&amp;quot; in non-literal ways that might satisfy some of that desire, but I don&amp;#39;t think that we as a species can actually become accustomed to and comfortable with the idea of never again existing. I think the only people who can really get used to this are those people who have weak imaginations and think of death as a black void &amp;quot;until…&amp;quot;, or turning from a body into a spirit, as opposed to more deeply contemplating not existing at all forever.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m interested in the idea that ignoring death makes the fear increase. I&amp;#39;ve sometimes fantasized about risking my life— joining the army (I&amp;#39;m too old I think at 30) and seeking a combat position, or taking up extreme sports, or simply finding heroin or similar and taking way too much of it. I figure this way, if death comes, it&amp;#39;ll come suddenly and I will be distracted by whatever else is going on, and if I live, maybe I&amp;#39;ll fear it less. I don&amp;#39;t know.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj5ai2", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj5ai2/", "num_reports": null, "stickied": false, "created": 1451752909.0, "author_flair_text": null, "created_utc": 1451724109.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyiom04", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "casson_", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 1, "approved_by": null, "downs": 0, "body": "Since death is so universal, it seems like a strange thing to ignore. Ignoring death may end up increasing fear of death itself. It seems strange to me that more media doesn't focus on death, I feel like that way we could be more used to the idea and accept it. I agree that death should not motivate actions, but we also should not try to forget about, because otherwise we forget how unique life is. ", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Since death is so universal, it seems like a strange thing to ignore. Ignoring death may end up increasing fear of death itself. It seems strange to me that more media doesn&amp;#39;t focus on death, I feel like that way we could be more used to the idea and accept it. I agree that death should not motivate actions, but we also should not try to forget about, because otherwise we forget how unique life is. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyiom04", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyiom04/", "num_reports": null, "stickied": false, "created": 1451716574.0, "author_flair_text": "1∆", "created_utc": 1451687774.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyj5b2t", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyiyg6n", "score": 1, "approved_by": null, "downs": 0, "body": "Thanks for the advice. I'm always annoyed and underwhelmed by the \"get motivated\" stuff. I read the whole \"say thanks to your past self and do a favor for your future self\" and basically everything else on that page. Bleh. But I'm sure it works for some people. I see it as yet more obfuscation of the truth.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for the advice. I&amp;#39;m always annoyed and underwhelmed by the &amp;quot;get motivated&amp;quot; stuff. I read the whole &amp;quot;say thanks to your past self and do a favor for your future self&amp;quot; and basically everything else on that page. Bleh. But I&amp;#39;m sure it works for some people. I see it as yet more obfuscation of the truth.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj5b2t", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj5b2t/", "num_reports": null, "stickied": false, "created": 1451752967.0, "author_flair_text": null, "created_utc": 1451724167.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyiyg6n", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "PumpkinDevourer", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 1, "approved_by": null, "downs": 0, "body": "Go to the subreddit /r/getmotivated and look at the top post of the past year. Read it in full. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Go to the subreddit &lt;a href=\"/r/getmotivated\"&gt;/r/getmotivated&lt;/a&gt; and look at the top post of the past year. Read it in full. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyiyg6n", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyiyg6n/", "num_reports": null, "stickied": false, "created": 1451735610.0, "author_flair_text": null, "created_utc": 1451706810.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyjhy7h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyj5cgi", "score": 1, "approved_by": null, "downs": 0, "body": "Okay, obviously I sent the wrong message by writing \"ought to.\" I'm surprised it confused you so much that you're now repeating the premise of my own CMV back to me. Of course I don't mean that people should strive to worry more. Obviously people should spend as little time as possible contemplating death, which is entirely my point, and obviously we should have distractions from it, which is my entire point. \n\nWhen I said \"they ought to struggle with it more\" I what I mean is that I find it surprising that people don't struggle with it more, and I think that lack of a struggle often arises from aspects of their personality or mind that are problematic in a larger sense, but help in this area. Think along the lines of \"ignorance is bliss\"-- when people say that, they might word it as \"we ought to be more worried\" but of course they're not saying people should strive to worry more, only that they should acquire knowledge of the world around them, which will have the unfortunate side effect of making people less happy.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, obviously I sent the wrong message by writing &amp;quot;ought to.&amp;quot; I&amp;#39;m surprised it confused you so much that you&amp;#39;re now repeating the premise of my own CMV back to me. Of course I don&amp;#39;t mean that people should strive to worry more. Obviously people should spend as little time as possible contemplating death, which is entirely my point, and obviously we should have distractions from it, which is my entire point. &lt;/p&gt;\n\n&lt;p&gt;When I said &amp;quot;they ought to struggle with it more&amp;quot; I what I mean is that I find it surprising that people don&amp;#39;t struggle with it more, and I think that lack of a struggle often arises from aspects of their personality or mind that are problematic in a larger sense, but help in this area. Think along the lines of &amp;quot;ignorance is bliss&amp;quot;-- when people say that, they might word it as &amp;quot;we ought to be more worried&amp;quot; but of course they&amp;#39;re not saying people should strive to worry more, only that they should acquire knowledge of the world around them, which will have the unfortunate side effect of making people less happy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyjhy7h", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyjhy7h/", "num_reports": null, "stickied": false, "created": 1451788636.0, "author_flair_text": null, "created_utc": 1451759836.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyj5cgi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "SC803", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyj59y0", "score": 2, "approved_by": null, "downs": 0, "body": "&gt; most people don't struggle with death as much as they rightly ought to\n\nWhy should I struggle with death, it's going to happen, hopefully not tomorrow, but why should I spend time contemplating death when there's infinitely better ways to spend my time?\n\nSounds like you need a hobby...", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;most people don&amp;#39;t struggle with death as much as they rightly ought to&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why should I struggle with death, it&amp;#39;s going to happen, hopefully not tomorrow, but why should I spend time contemplating death when there&amp;#39;s infinitely better ways to spend my time?&lt;/p&gt;\n\n&lt;p&gt;Sounds like you need a hobby...&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj5cgi", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj5cgi/", "num_reports": null, "stickied": false, "created": 1451753107.0, "author_flair_text": "53∆", "created_utc": 1451724307.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyj59y0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyimb89", "score": 0, "approved_by": null, "downs": 0, "body": "Of course they do. I'm not saying it isn't, I'm saying I wish it would strive *only* to be entertaining instead of flinging our morality in our faces as well. I realize most people are empty-headed when it comes to messages around them; I think that's why most people don't struggle with death as much as they rightly ought to. I think it's also why people managed to justify human slavery for hundreds of years— just don't think about it too much, it's fine. I think it's how they managed to conquer and slaughter others people for thousands of yaers as just a routine part of life. I think it's how people can breed millions of cows and pigs, or billions or chickens, etc, and then put a bolt through their head, or hang them by their feet to pass through a death machine, and eat their corpses for no better reason than \"yummmm, chicken noodle soup is better than curry.\" I agree, most people don't pay attention to what happens around them until it affects their own life. But that doesn't really help me; like it or not, I can't tune it all out.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Of course they do. I&amp;#39;m not saying it isn&amp;#39;t, I&amp;#39;m saying I wish it would strive &lt;em&gt;only&lt;/em&gt; to be entertaining instead of flinging our morality in our faces as well. I realize most people are empty-headed when it comes to messages around them; I think that&amp;#39;s why most people don&amp;#39;t struggle with death as much as they rightly ought to. I think it&amp;#39;s also why people managed to justify human slavery for hundreds of years— just don&amp;#39;t think about it too much, it&amp;#39;s fine. I think it&amp;#39;s how they managed to conquer and slaughter others people for thousands of yaers as just a routine part of life. I think it&amp;#39;s how people can breed millions of cows and pigs, or billions or chickens, etc, and then put a bolt through their head, or hang them by their feet to pass through a death machine, and eat their corpses for no better reason than &amp;quot;yummmm, chicken noodle soup is better than curry.&amp;quot; I agree, most people don&amp;#39;t pay attention to what happens around them until it affects their own life. But that doesn&amp;#39;t really help me; like it or not, I can&amp;#39;t tune it all out.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj59y0", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj59y0/", "num_reports": null, "stickied": false, "created": 1451752852.0, "author_flair_text": null, "created_utc": 1451724052.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyimb89", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "SC803", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 2, "approved_by": null, "downs": 0, "body": "&gt; I think producers of media and narratives should just give it a rest and go back to entertaining us.\n\nPeople obviously find 'Do you realize?' entertaining, otherwise it wouldn't nearly as popular as it is. A lot of people don't read into lyrics that much.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I think producers of media and narratives should just give it a rest and go back to entertaining us.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;People obviously find &amp;#39;Do you realize?&amp;#39; entertaining, otherwise it wouldn&amp;#39;t nearly as popular as it is. A lot of people don&amp;#39;t read into lyrics that much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyimb89", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyimb89/", "num_reports": null, "stickied": false, "created": 1451712316.0, "author_flair_text": "53∆", "created_utc": 1451683516.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyki6ch", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyjclqe", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;Nothing of what I said even suggest what camp of belief I subscribe to. \n\nAny camp other than \"obviously we stop existing when we die\" is either accepting, or failing to deny, outlandish silly claims. Accepting that \"all is possible\" is accepting the possibility of silly bullshit.\n\nThe rest of what you say sort of loses its impact against this backdrop. Of course you can accept death when you think \"you\" have the possibility of magically floating away from \"your\" dead body and are excited to find out.\n\nYou raise a good point about funerals and the grieving process. It would be fun to schedule a funeral for myself at age 30 or something, and see who comes and what is said, and have everyone celebrate my life... maybe then I won't feel so attached to it. \n\nYour last paragraph only works if you can think about it when life sucks, but not when it's great. I do the same as you-- but I also do it when I had a good day with friends, write a script I'm proud of, etc. If life is generally so shitty that death is a relief, then... well then you might be Buddhist! But I'd like my life to be good enough that I'm not happy to think about the fact that it's over soon.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Nothing of what I said even suggest what camp of belief I subscribe to. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Any camp other than &amp;quot;obviously we stop existing when we die&amp;quot; is either accepting, or failing to deny, outlandish silly claims. Accepting that &amp;quot;all is possible&amp;quot; is accepting the possibility of silly bullshit.&lt;/p&gt;\n\n&lt;p&gt;The rest of what you say sort of loses its impact against this backdrop. Of course you can accept death when you think &amp;quot;you&amp;quot; have the possibility of magically floating away from &amp;quot;your&amp;quot; dead body and are excited to find out.&lt;/p&gt;\n\n&lt;p&gt;You raise a good point about funerals and the grieving process. It would be fun to schedule a funeral for myself at age 30 or something, and see who comes and what is said, and have everyone celebrate my life... maybe then I won&amp;#39;t feel so attached to it. &lt;/p&gt;\n\n&lt;p&gt;Your last paragraph only works if you can think about it when life sucks, but not when it&amp;#39;s great. I do the same as you-- but I also do it when I had a good day with friends, write a script I&amp;#39;m proud of, etc. If life is generally so shitty that death is a relief, then... well then you might be Buddhist! But I&amp;#39;d like my life to be good enough that I&amp;#39;m not happy to think about the fact that it&amp;#39;s over soon.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyki6ch", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyki6ch/", "num_reports": null, "stickied": false, "created": 1451871597.0, "author_flair_text": null, "created_utc": 1451842797.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyjclqe", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "lil_MKUltra", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyj5ay7", "score": 2, "approved_by": null, "downs": 0, "body": "&gt;Uh, you say this when a problem has a solution. Yeah, if the problem is impossible to solve, then the best thing to do is try not to let it bother you, ie, ignore it.\n\nNo this not true. Let's take death of a loved one. This problem has no solution, nothing you do can change the circumstances. But to ignore the sadness you have for this will cause far reaching problems in your life. That's why we have funerals. To grieve. To look at what is and accept it even if it makes us sad. Because to not won't save us from sadness but will in fact cause us more.\n\n&gt;You act like it's not sad to stop existing in the first place.\n\nSadness is about perception. If you perceive something to be sad you will be sad. Regardless of what you do. Ignoring the problem doesn't address the fact that you still perceive the situation as sad. One day on your death bed you will face this sadness and must confront it. I'm telling you that accepting your feelings now is better than. Ignoring them for a later date?\n\n&gt;You say we don't know what happens after death. Yeah, I'm not into stupid bullshit, sorry. We do know. There's no fucking mystery. The incredible organ that is our brain, which provides us with consciousness, stops functioning. That is all we are. Then we die. If you don't believe this, then you are one of the religious people who I already noted aren't my target audience. Oh, I'm sure you're \"not religious but spiritual\" or similar bullshit, but look, if you think there's a magic floating non-material essence that makes up your consciousness, then you believe in made up bullshit to make you feel better. If you're capable of swallowing that, I congratulate you. I wish I had your abilities.\n\nNothing of what I said even suggest what camp of belief I subscribe to. I merely accept all because all is possible. I am similar to you in that I believe it is more probable that nothing is after this. But I am not afraid of that and thus don't fiercely believe it. I can't say what happens when I die because I have never died. I'll hold out on what is impossible until I cross over and either experience something or not.\n\n&gt;Your solution, instead of ignoring something awful, celebrate something awful? Great, wut?\n\nCelebrate something great. Death is not awful. In my opinion it has only two great options. One there is nothing. This would be nice because it would eliminate all. No sadness. You can't be sad if you aren't. Talk about wiping the slate clean am I right? You will finally be at peace, which would be non existent. But for me, I take comfort in this. It makes my life seem less serious. Bad day at work? Fuck it I'll be dead soon. Mom's dead? That blows but fuck it I'll be dead soon too and then won't give a fuck anymore.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Uh, you say this when a problem has a solution. Yeah, if the problem is impossible to solve, then the best thing to do is try not to let it bother you, ie, ignore it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No this not true. Let&amp;#39;s take death of a loved one. This problem has no solution, nothing you do can change the circumstances. But to ignore the sadness you have for this will cause far reaching problems in your life. That&amp;#39;s why we have funerals. To grieve. To look at what is and accept it even if it makes us sad. Because to not won&amp;#39;t save us from sadness but will in fact cause us more.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You act like it&amp;#39;s not sad to stop existing in the first place.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sadness is about perception. If you perceive something to be sad you will be sad. Regardless of what you do. Ignoring the problem doesn&amp;#39;t address the fact that you still perceive the situation as sad. One day on your death bed you will face this sadness and must confront it. I&amp;#39;m telling you that accepting your feelings now is better than. Ignoring them for a later date?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You say we don&amp;#39;t know what happens after death. Yeah, I&amp;#39;m not into stupid bullshit, sorry. We do know. There&amp;#39;s no fucking mystery. The incredible organ that is our brain, which provides us with consciousness, stops functioning. That is all we are. Then we die. If you don&amp;#39;t believe this, then you are one of the religious people who I already noted aren&amp;#39;t my target audience. Oh, I&amp;#39;m sure you&amp;#39;re &amp;quot;not religious but spiritual&amp;quot; or similar bullshit, but look, if you think there&amp;#39;s a magic floating non-material essence that makes up your consciousness, then you believe in made up bullshit to make you feel better. If you&amp;#39;re capable of swallowing that, I congratulate you. I wish I had your abilities.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Nothing of what I said even suggest what camp of belief I subscribe to. I merely accept all because all is possible. I am similar to you in that I believe it is more probable that nothing is after this. But I am not afraid of that and thus don&amp;#39;t fiercely believe it. I can&amp;#39;t say what happens when I die because I have never died. I&amp;#39;ll hold out on what is impossible until I cross over and either experience something or not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Your solution, instead of ignoring something awful, celebrate something awful? Great, wut?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Celebrate something great. Death is not awful. In my opinion it has only two great options. One there is nothing. This would be nice because it would eliminate all. No sadness. You can&amp;#39;t be sad if you aren&amp;#39;t. Talk about wiping the slate clean am I right? You will finally be at peace, which would be non existent. But for me, I take comfort in this. It makes my life seem less serious. Bad day at work? Fuck it I&amp;#39;ll be dead soon. Mom&amp;#39;s dead? That blows but fuck it I&amp;#39;ll be dead soon too and then won&amp;#39;t give a fuck anymore.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyjclqe", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyjclqe/", "num_reports": null, "stickied": false, "created": 1451778886.0, "author_flair_text": null, "created_utc": 1451750086.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyj5ay7", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iwillnotgetaddicted", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cyip0ky", "score": 0, "approved_by": null, "downs": 0, "body": "&gt;So you suggest ignoring the problem then?\n\nUh, you say this when a problem has a solution. Yeah, if the problem is impossible to solve, then the best thing to do is try not to let it bother you, ie, ignore it.\n\nOf course the knowledge and fear of death drives people to religion. Not only is that obvious, but it's also explicitly written in my own comment.\n\nI don't see how depression involves repressing the knowledge of death. You act like it's not sad to stop existing in the first place.\n\nYou say we don't know what happens after death. Yeah, I'm not into stupid bullshit, sorry. We do know. There's no fucking mystery. The incredible organ that is our brain, which provides us with consciousness, stops functioning. That is all we are. Then we die. If you don't believe this, then you are one of the religious people who I already noted aren't my target audience. Oh, I'm sure you're \"not religious but spiritual\" or similar bullshit, but look, if you think there's a magic floating non-material essence that makes up your consciousness, then you believe in made up bullshit to make you feel better. If you're capable of swallowing that, I congratulate you. I wish I had your abilities.\n\nYour solution, instead of ignoring something awful, celebrate something awful? Great, wut?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;So you suggest ignoring the problem then?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Uh, you say this when a problem has a solution. Yeah, if the problem is impossible to solve, then the best thing to do is try not to let it bother you, ie, ignore it.&lt;/p&gt;\n\n&lt;p&gt;Of course the knowledge and fear of death drives people to religion. Not only is that obvious, but it&amp;#39;s also explicitly written in my own comment.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t see how depression involves repressing the knowledge of death. You act like it&amp;#39;s not sad to stop existing in the first place.&lt;/p&gt;\n\n&lt;p&gt;You say we don&amp;#39;t know what happens after death. Yeah, I&amp;#39;m not into stupid bullshit, sorry. We do know. There&amp;#39;s no fucking mystery. The incredible organ that is our brain, which provides us with consciousness, stops functioning. That is all we are. Then we die. If you don&amp;#39;t believe this, then you are one of the religious people who I already noted aren&amp;#39;t my target audience. Oh, I&amp;#39;m sure you&amp;#39;re &amp;quot;not religious but spiritual&amp;quot; or similar bullshit, but look, if you think there&amp;#39;s a magic floating non-material essence that makes up your consciousness, then you believe in made up bullshit to make you feel better. If you&amp;#39;re capable of swallowing that, I congratulate you. I wish I had your abilities.&lt;/p&gt;\n\n&lt;p&gt;Your solution, instead of ignoring something awful, celebrate something awful? Great, wut?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyj5ay7", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyj5ay7/", "num_reports": null, "stickied": false, "created": 1451752954.0, "author_flair_text": null, "created_utc": 1451724154.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cyip0ky", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "lil_MKUltra", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 1, "approved_by": null, "downs": 0, "body": "So you suggest ignoring the problem then? Yes we are going to die and yes the fear of this is what drives forces like depression, organized religion, and some other nasty stuff. \n\nyou suggested yourself that we all obviously know we are going to die. I Believe this knowledge and fear off it is what drives people to into religions, since they promise immortality. Depression is a form of repressing this knowledge, burying it down and ignoring it until it comes up as sadness.\n\nSo instead of ignoring it. See it. Celebrate it. Recognize the finite  life and all its beauty. Bravery my friend is all humans have. And to say you know what happens when you die is impossible. Don't try and answer that question. Look at that pit of black and enjoy the fact that some day you will be dead and will know once and for all what the hell happens. And if its nothing, then there is nothing to worry about because you won't be anymore. Take comfort in that and see that even the worst you do will amount to nothing.", "edited": 1451688814.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So you suggest ignoring the problem then? Yes we are going to die and yes the fear of this is what drives forces like depression, organized religion, and some other nasty stuff. &lt;/p&gt;\n\n&lt;p&gt;you suggested yourself that we all obviously know we are going to die. I Believe this knowledge and fear off it is what drives people to into religions, since they promise immortality. Depression is a form of repressing this knowledge, burying it down and ignoring it until it comes up as sadness.&lt;/p&gt;\n\n&lt;p&gt;So instead of ignoring it. See it. Celebrate it. Recognize the finite  life and all its beauty. Bravery my friend is all humans have. And to say you know what happens when you die is impossible. Don&amp;#39;t try and answer that question. Look at that pit of black and enjoy the fact that some day you will be dead and will know once and for all what the hell happens. And if its nothing, then there is nothing to worry about because you won&amp;#39;t be anymore. Take comfort in that and see that even the worst you do will amount to nothing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyip0ky", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyip0ky/", "num_reports": null, "stickied": false, "created": 1451717314.0, "author_flair_text": null, "created_utc": 1451688514.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3z1ruc", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cyk9uhl", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ABottledCoke", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3z1ruc", "score": 1, "approved_by": null, "downs": 0, "body": "I think where we disagree is that you think that the media is trying to tell you something in the sense that they are presenting an argument which you can then evaluate. I think that the media is trying to *do* something for us in the sense of providing us with a course of treatment. Or at least, I think that this therapeutic effect exists for listeners/readers regardless of whether it was fully intended.\n\nThe disease the media is trying to occur is our preoccupation with philosophy and consequently our own mortality. We incessantly worry about issues that we have no control over and questions that we can't possibly answer with an actual degree of certainty ( is there a God? what happens after death? What is the right thing to do? What is the mind and what is the body? and so on) that it drives us to lose our peace of mind. As a result we constantly worry over ourselves and our place in the world. We become miserable despite objectively having it materially better than the rest of the world.\n\n\nHowever, when songs so cheesily state these seemingly obvious truths about our mortality they demarcate for us the limits of things we can know for sure. Thus, if we actually take these songs seriously, we can learn to focus on these things we know for certain or at least feel we know( that we will all die, that there are people we love right now...) and stop focusing so much on the big existentially pressing questions we can't possibly answer. Short of getting us out of the perils of philosophical investigation, this demarcation invoked by reminders of mortality are the best we can do to let our minds settle and actually be at peace with ourselves.\n\nThus, it's not so much that people seek immortality or transcendence, it's quite the opposite. These songs are cherishing the temporal yet epistemically ( or at least phenomenological) certainty that we will and fact die and using it to cure us of some our anxieties about it.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think where we disagree is that you think that the media is trying to tell you something in the sense that they are presenting an argument which you can then evaluate. I think that the media is trying to &lt;em&gt;do&lt;/em&gt; something for us in the sense of providing us with a course of treatment. Or at least, I think that this therapeutic effect exists for listeners/readers regardless of whether it was fully intended.&lt;/p&gt;\n\n&lt;p&gt;The disease the media is trying to occur is our preoccupation with philosophy and consequently our own mortality. We incessantly worry about issues that we have no control over and questions that we can&amp;#39;t possibly answer with an actual degree of certainty ( is there a God? what happens after death? What is the right thing to do? What is the mind and what is the body? and so on) that it drives us to lose our peace of mind. As a result we constantly worry over ourselves and our place in the world. We become miserable despite objectively having it materially better than the rest of the world.&lt;/p&gt;\n\n&lt;p&gt;However, when songs so cheesily state these seemingly obvious truths about our mortality they demarcate for us the limits of things we can know for sure. Thus, if we actually take these songs seriously, we can learn to focus on these things we know for certain or at least feel we know( that we will all die, that there are people we love right now...) and stop focusing so much on the big existentially pressing questions we can&amp;#39;t possibly answer. Short of getting us out of the perils of philosophical investigation, this demarcation invoked by reminders of mortality are the best we can do to let our minds settle and actually be at peace with ourselves.&lt;/p&gt;\n\n&lt;p&gt;Thus, it&amp;#39;s not so much that people seek immortality or transcendence, it&amp;#39;s quite the opposite. These songs are cherishing the temporal yet epistemically ( or at least phenomenological) certainty that we will and fact die and using it to cure us of some our anxieties about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cyk9uhl", "score_hidden": false, "permalink": "/r/changemyview/comments/3z1ruc/cmv_ubiquitous_reminders_of_our_mortality_and_the/cyk9uhl/", "num_reports": null, "stickied": false, "created": 1451847834.0, "author_flair_text": null, "created_utc": 1451819034.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]