[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I think I hit my end point. Prolonged Exposure is fucking me up. Bringing up childhood shit that I didn&amp;#39;t even need or want to remember. Making me feel so worthless. Like my entire life has just been a waste, and my college rape was just the grand finale. I feel like I&amp;#39;m in too deep to &amp;quot;go back to normal&amp;quot; since I started trauma therapy. I feel like normal is just gone for good now. There&amp;#39;s just nowhere left to go. &lt;/p&gt;\n\n&lt;p&gt;A friend who was there the night of my rape is telling other people (but never me directly) that I BEGGED practically on my hands and knees to hook up with the guy who raped me and assaulted me repeatedly throughout the night. She tells people how desperate I was. And how I made her let me bring him back to her boyfriends house. How I begged him to come over. And how she was just trying to be a good person and discourage it. She&amp;#39;s telling people how much I wanted him to fuck me. How RELENTLESS I was. I feel like I&amp;#39;m ruined. I don&amp;#39;t remember anything happening like that. All I remember was being SO wasted that I could barely stand up, and I remember hands up my dress when I couldn&amp;#39;t even move my feet, and hands up my dress when I was barely conscious in the cab. I remember him &amp;quot;dancing&amp;quot; with me pushing his boner into me while I was hanging on trying to stay conscious and on my feet. I remember falling a lot. And just being picked back up for more. I remember being in a room alone with him at the house arguing, and explicitly saying no and trying to convince him not to have sex with me. I remember listing my medical issues to try to make him feel like he couldn&amp;#39;t force it. And then I remember passing out and being woken up to being knocked around and violent sex while being held upside down, without a condom on. I remember fucking WATCHING it and feeling his fucking skin stabbing my insides over and over again while I was stuck frozen, my neck jamming into the back of the bed. I remember being laughed at when I finally willed myself to kick him off of me. And his disgusting smug smile when cried and asked why he was doing this. I remember running up the stairs with bloody knees and no panties. Begging him to leave. Trying to act like I wasn&amp;#39;t terrified. And I remember feeling so deeply relieved when another guy dragged him out after he called me a dumb slut,a waste of life and a tease, and refused to leave. I remember him trying to force me back into a room to let him finish what he wanted to do. I remember not even being able to close my eyes for two days. And I remember getting nasty fucking genital ulcers and a pregnancy test a few days after. &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what I fucking remember. &lt;/p&gt;\n\n&lt;p&gt;But when I finally had the guts to share my story with another friend, I was informed that the goddamn disclaimer &amp;quot;word on the street&amp;quot; is that I begged for it and am just sadly regretting &amp;quot;bad sex.&amp;quot; And that I just don&amp;#39;t remember things properly.&lt;/p&gt;\n\n&lt;p&gt;But there are so many blanks in between it all in my memory from that night. I can&amp;#39;t stop thinking about what if she was right? I&amp;#39;ve never even kissed someone that wasn&amp;#39;t in a relationship with. It&amp;#39;s not necessarily in my normal character. But what if I did? Even if I didn&amp;#39;t, all of my friends and others think that I practically begged for sex. Everyone just thinks I&amp;#39;m a whore now anyway. Everyone just thinks I&amp;#39;m dramatic. And a freak. Or too emotional and out of my damn mind. My friends are discussing me with people. And not in a nice way. I&amp;#39;m tired of hearing about it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so confused. What if I just made up the memories I have? What if my PTSD is just a fabrication of my mind? What if I&amp;#39;m just so desperate not to be the slut that I actually am that I just fucking made this all up subconsciously? I don&amp;#39;t even know what&amp;#39;s real anymore. I don&amp;#39;t think I can be helped anymore. It&amp;#39;s all likely my own damn fault, and even if it isn&amp;#39;t I don&amp;#39;t even know what&amp;#39;s real, so how am I supposed to do exposures? What if I&amp;#39;m just crazy? I mean something is really fucking wrong with me. But if this is all false then I guess it&amp;#39;s not PTSD. I just don&amp;#39;t know what&amp;#39;s real anymore. I can&amp;#39;t live with everyone in my life thinking that I&amp;#39;m crazy AND a hysterical slut. I just can&amp;#39;t do this anymore. I&amp;#39;m so ashamed I can&amp;#39;t be in this skin anymore. I&amp;#39;m starting to get scared. I nearly drank myself into a coma the other night and said goodbye to my husband and was preparing to make a suicide plan. Luckily I was too intoxicated to get off the floor, and too hungover the next day to do anything. Now I just feel stuck. There&amp;#39;s nothing left. I don&amp;#39;t know if I could bear to hurt my husband by leaving like that, but I also don&amp;#39;t know if I could bear to continue living like this. I don&amp;#39;t even have sleep as an escape anymore there&amp;#39;s literally NO WAY OUT. Fuck. I don&amp;#39;t want to leave my husband alone. I don&amp;#39;t think my mom could live through a second suicide. I have nowhere else to go. I can&amp;#39;t stop thinking about loose ends I would need to tie up. I just can&amp;#39;t be here anymore. I don&amp;#39;t know what to fucking do. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I think I hit my end point. Prolonged Exposure is fucking me up. Bringing up childhood shit that I didn't even need or want to remember. Making me feel so worthless. Like my entire life has just been a waste, and my college rape was just the grand finale. I feel like I'm in too deep to \"go back to normal\" since I started trauma therapy. I feel like normal is just gone for good now. There's just nowhere left to go. \n\nA friend who was there the night of my rape is telling other people (but never me directly) that I BEGGED practically on my hands and knees to hook up with the guy who raped me and assaulted me repeatedly throughout the night. She tells people how desperate I was. And how I made her let me bring him back to her boyfriends house. How I begged him to come over. And how she was just trying to be a good person and discourage it. She's telling people how much I wanted him to fuck me. How RELENTLESS I was. I feel like I'm ruined. I don't remember anything happening like that. All I remember was being SO wasted that I could barely stand up, and I remember hands up my dress when I couldn't even move my feet, and hands up my dress when I was barely conscious in the cab. I remember him \"dancing\" with me pushing his boner into me while I was hanging on trying to stay conscious and on my feet. I remember falling a lot. And just being picked back up for more. I remember being in a room alone with him at the house arguing, and explicitly saying no and trying to convince him not to have sex with me. I remember listing my medical issues to try to make him feel like he couldn't force it. And then I remember passing out and being woken up to being knocked around and violent sex while being held upside down, without a condom on. I remember fucking WATCHING it and feeling his fucking skin stabbing my insides over and over again while I was stuck frozen, my neck jamming into the back of the bed. I remember being laughed at when I finally willed myself to kick him off of me. And his disgusting smug smile when cried and asked why he was doing this. I remember running up the stairs with bloody knees and no panties. Begging him to leave. Trying to act like I wasn't terrified. And I remember feeling so deeply relieved when another guy dragged him out after he called me a dumb slut,a waste of life and a tease, and refused to leave. I remember him trying to force me back into a room to let him finish what he wanted to do. I remember not even being able to close my eyes for two days. And I remember getting nasty fucking genital ulcers and a pregnancy test a few days after. \n\nThat's what I fucking remember. \n\nBut when I finally had the guts to share my story with another friend, I was informed that the goddamn disclaimer \"word on the street\" is that I begged for it and am just sadly regretting \"bad sex.\" And that I just don't remember things properly.\n\nBut there are so many blanks in between it all in my memory from that night. I can't stop thinking about what if she was right? I've never even kissed someone that wasn't in a relationship with. It's not necessarily in my normal character. But what if I did? Even if I didn't, all of my friends and others think that I practically begged for sex. Everyone just thinks I'm a whore now anyway. Everyone just thinks I'm dramatic. And a freak. Or too emotional and out of my damn mind. My friends are discussing me with people. And not in a nice way. I'm tired of hearing about it. \n\nI'm so confused. What if I just made up the memories I have? What if my PTSD is just a fabrication of my mind? What if I'm just so desperate not to be the slut that I actually am that I just fucking made this all up subconsciously? I don't even know what's real anymore. I don't think I can be helped anymore. It's all likely my own damn fault, and even if it isn't I don't even know what's real, so how am I supposed to do exposures? What if I'm just crazy? I mean something is really fucking wrong with me. But if this is all false then I guess it's not PTSD. I just don't know what's real anymore. I can't live with everyone in my life thinking that I'm crazy AND a hysterical slut. I just can't do this anymore. I'm so ashamed I can't be in this skin anymore. I'm starting to get scared. I nearly drank myself into a coma the other night and said goodbye to my husband and was preparing to make a suicide plan. Luckily I was too intoxicated to get off the floor, and too hungover the next day to do anything. Now I just feel stuck. There's nothing left. I don't know if I could bear to hurt my husband by leaving like that, but I also don't know if I could bear to continue living like this. I don't even have sleep as an escape anymore there's literally NO WAY OUT. Fuck. I don't want to leave my husband alone. I don't think my mom could live through a second suicide. I have nowhere else to go. I can't stop thinking about loose ends I would need to tie up. I just can't be here anymore. I don't know what to fucking do. ", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "68jazy", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "wonderwomanscott", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 6, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 13, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_68jazy", "spoiler": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1493632090.0, "url": "https://www.reddit.com/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/", "author_flair_text": null, "quarantine": false, "title": "I don't think I can be helped anymore", "created_utc": 1493603290.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.88, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 6}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgziw7h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wonderwomanscott", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgzf9th", "score": 1, "approved_by": null, "downs": 0, "body": "Thank you. I appreciate the understanding and validation. And I appreciate the advice on not trying to convince them. I felt unsure about that but reading your comment made that feel a bit more clear to me. I can only control and be responsible for myself, so my time and limited energy should go towards that. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I appreciate the understanding and validation. And I appreciate the advice on not trying to convince them. I felt unsure about that but reading your comment made that feel a bit more clear to me. I can only control and be responsible for myself, so my time and limited energy should go towards that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgziw7h", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgziw7h/", "num_reports": null, "stickied": false, "created": 1493678886.0, "author_flair_text": null, "created_utc": 1493650086.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgzf9th", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "oolallyndargoonanon", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68jazy", "score": 2, "approved_by": null, "downs": 0, "body": "You are not crazy. What happened to you is. I am so sorry you had to experience that.\n\nThe people around you saying these things, believing these things are immature idiots and they are not with your time.\n\nYou might feel like you want to convince them or tell them the truth but your energy is better spent on yourself. I know their opinions feel significant right now--they truly impact your life and your social circle, but believe me when I say that they will be only memories soon enough. It's hard because what they're doing is isolating you more. Trust me when I say things will change.\n\nI often hate it when people say it gets better. Somehow it's more comforting to me to say things will change.  I know things will change for a fact so there is definitely a chance things could be better!--maybe that will give you comfort too.\n\nMaybe find a new therapist. No knocks on your current one really. You probably learned a lot. Maybe it's just not the right vibe and he/she isn't reading you right.\n\nMy therapist makes sure I have a safe and comfortable route home after an intense session and talks to me about self care plans.  Not everything sticks but something sticks in\n\nShe also gave me a PTSD workbook that helped me understand myself and my needs better.\n\nPersonally, I went through a stage where I was very quiet and meditative all the time. I didn't have many friends but the ones I did have were good. I did get sad because of all the \"normal\" friends I \"lost\"/they turned into acquaintances. I mourned a lot for a life lost. Sometimes I still do.\n\nAt the very least know I understand how you feel", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are not crazy. What happened to you is. I am so sorry you had to experience that.&lt;/p&gt;\n\n&lt;p&gt;The people around you saying these things, believing these things are immature idiots and they are not with your time.&lt;/p&gt;\n\n&lt;p&gt;You might feel like you want to convince them or tell them the truth but your energy is better spent on yourself. I know their opinions feel significant right now--they truly impact your life and your social circle, but believe me when I say that they will be only memories soon enough. It&amp;#39;s hard because what they&amp;#39;re doing is isolating you more. Trust me when I say things will change.&lt;/p&gt;\n\n&lt;p&gt;I often hate it when people say it gets better. Somehow it&amp;#39;s more comforting to me to say things will change.  I know things will change for a fact so there is definitely a chance things could be better!--maybe that will give you comfort too.&lt;/p&gt;\n\n&lt;p&gt;Maybe find a new therapist. No knocks on your current one really. You probably learned a lot. Maybe it&amp;#39;s just not the right vibe and he/she isn&amp;#39;t reading you right.&lt;/p&gt;\n\n&lt;p&gt;My therapist makes sure I have a safe and comfortable route home after an intense session and talks to me about self care plans.  Not everything sticks but something sticks in&lt;/p&gt;\n\n&lt;p&gt;She also gave me a PTSD workbook that helped me understand myself and my needs better.&lt;/p&gt;\n\n&lt;p&gt;Personally, I went through a stage where I was very quiet and meditative all the time. I didn&amp;#39;t have many friends but the ones I did have were good. I did get sad because of all the &amp;quot;normal&amp;quot; friends I &amp;quot;lost&amp;quot;/they turned into acquaintances. I mourned a lot for a life lost. Sometimes I still do.&lt;/p&gt;\n\n&lt;p&gt;At the very least know I understand how you feel&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgzf9th", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgzf9th/", "num_reports": null, "stickied": false, "created": 1493673703.0, "author_flair_text": null, "created_utc": 1493644903.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 5, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzl4xi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HoodwinkingGnome", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgzi7j7", "score": 1, "approved_by": null, "downs": 0, "body": "I completely understand. I was in a domestic violence marriage and my ex husband raped me. A lot of people though prefer to think that I'm a vindictive ex wife and he is innocent. It hurts. It can't not. I have lost a lot of people I thought were friends. I'm not going to lie and say it is easy to be in your position. It's not. It really sucks and is unfair. You are surviving everyday. You know the truth. Those who really matter will believe you. You may not be able to cut people out of your life. I get that. But you can choose who to be your support and who to keep at a distance so they don't hurt your healing. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I completely understand. I was in a domestic violence marriage and my ex husband raped me. A lot of people though prefer to think that I&amp;#39;m a vindictive ex wife and he is innocent. It hurts. It can&amp;#39;t not. I have lost a lot of people I thought were friends. I&amp;#39;m not going to lie and say it is easy to be in your position. It&amp;#39;s not. It really sucks and is unfair. You are surviving everyday. You know the truth. Those who really matter will believe you. You may not be able to cut people out of your life. I get that. But you can choose who to be your support and who to keep at a distance so they don&amp;#39;t hurt your healing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgzl4xi", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgzl4xi/", "num_reports": null, "stickied": false, "created": 1493681723.0, "author_flair_text": null, "created_utc": 1493652923.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgzi7j7", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wonderwomanscott", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgza01c", "score": 1, "approved_by": null, "downs": 0, "body": "Thank you for the validation. I hate feeling so crazy. It's wrecking me to be plagued with the flashbacks and nightmares and question if they are even real memories. So most people have been telling me to cut these guys out but... I just don't feel like it's realistic to cut my friends and family out. Especially people who otherwise love me and have proven to be a good friend, etc. I'd also be afraid that other people would just think the same thing anyway. I mean it just feels like if you were raped and it wasn't some psychopathic criminal ambushing you in an alley then you're just a slut to most people. I just feel like my reputation is screwed either way.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the validation. I hate feeling so crazy. It&amp;#39;s wrecking me to be plagued with the flashbacks and nightmares and question if they are even real memories. So most people have been telling me to cut these guys out but... I just don&amp;#39;t feel like it&amp;#39;s realistic to cut my friends and family out. Especially people who otherwise love me and have proven to be a good friend, etc. I&amp;#39;d also be afraid that other people would just think the same thing anyway. I mean it just feels like if you were raped and it wasn&amp;#39;t some psychopathic criminal ambushing you in an alley then you&amp;#39;re just a slut to most people. I just feel like my reputation is screwed either way.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgzi7j7", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgzi7j7/", "num_reports": null, "stickied": false, "created": 1493677985.0, "author_flair_text": null, "created_utc": 1493649185.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgza01c", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HoodwinkingGnome", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68jazy", "score": 5, "approved_by": null, "downs": 0, "body": "As someone with repressed memories I understand the mind fuck of not trusting the memories I do have. I think you wouldn't have PTSD if nothing happened to you. I think you know what happened and it sucks. I know it is hard. I do. But please don't allow those people to make you doubt yourself. Please get those people out of your life! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;As someone with repressed memories I understand the mind fuck of not trusting the memories I do have. I think you wouldn&amp;#39;t have PTSD if nothing happened to you. I think you know what happened and it sucks. I know it is hard. I do. But please don&amp;#39;t allow those people to make you doubt yourself. Please get those people out of your life! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgza01c", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgza01c/", "num_reports": null, "stickied": false, "created": 1493661507.0, "author_flair_text": null, "created_utc": 1493632707.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzijbp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wonderwomanscott", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgz0xnr", "score": 1, "approved_by": null, "downs": 0, "body": "Thank you again. My psychiatrist actually believes I was slipped a drug based on how I recall the night with the memory blocks and the certain symptoms that were apparently a bit different from just being drunk. It was always striking to me that I could be so not quite conscious without actually passing out or something for so long? There is also a very specific turning point where I went from nearly sober to  giant memory block, and I know that it was when I drank my first drink that I didn't get from he bar myself. Something about the night just doesn't quite add up. I can't tell if looking into this stuff makes me more or less upset though. It makes me a little more confused. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you again. My psychiatrist actually believes I was slipped a drug based on how I recall the night with the memory blocks and the certain symptoms that were apparently a bit different from just being drunk. It was always striking to me that I could be so not quite conscious without actually passing out or something for so long? There is also a very specific turning point where I went from nearly sober to  giant memory block, and I know that it was when I drank my first drink that I didn&amp;#39;t get from he bar myself. Something about the night just doesn&amp;#39;t quite add up. I can&amp;#39;t tell if looking into this stuff makes me more or less upset though. It makes me a little more confused. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgzijbp", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgzijbp/", "num_reports": null, "stickied": false, "created": 1493678418.0, "author_flair_text": null, "created_utc": 1493649618.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgz0xnr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "raaaaaaaaarr", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyz8xo", "score": 2, "approved_by": null, "downs": 0, "body": "You didn't bring this on yourself. It doesn't matter if you drunken flirted with the guy or not - your account of what happened later that night is horrific (and absolutely does not sound consensual). If your \"friend\" was drinking too - her perception could be skewed and survival guilt can be a real thing (or the guy could have convinced/threatened her). The thing is it's absolutely not your fault - people who have sex with /take advantage of(ie sexually assault/rape) drunk people are the ones in the wrong. \n\nFinally, at my college parties/nearby bars the shitty guys liked to slip Xanax/ambien into the drinks bc it was easier and cheaper to get than typical roofies and generally has the effect of making your target more cooperative/compliant or at least semi unconscious. Being drugged/seeing and intervening for someone who's been drugged is an unreal experience because the behavior can be so bizarre. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You didn&amp;#39;t bring this on yourself. It doesn&amp;#39;t matter if you drunken flirted with the guy or not - your account of what happened later that night is horrific (and absolutely does not sound consensual). If your &amp;quot;friend&amp;quot; was drinking too - her perception could be skewed and survival guilt can be a real thing (or the guy could have convinced/threatened her). The thing is it&amp;#39;s absolutely not your fault - people who have sex with /take advantage of(ie sexually assault/rape) drunk people are the ones in the wrong. &lt;/p&gt;\n\n&lt;p&gt;Finally, at my college parties/nearby bars the shitty guys liked to slip Xanax/ambien into the drinks bc it was easier and cheaper to get than typical roofies and generally has the effect of making your target more cooperative/compliant or at least semi unconscious. Being drugged/seeing and intervening for someone who&amp;#39;s been drugged is an unreal experience because the behavior can be so bizarre. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgz0xnr", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgz0xnr/", "num_reports": null, "stickied": false, "created": 1493638337.0, "author_flair_text": null, "created_utc": 1493609537.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyz8xo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wonderwomanscott", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyynwo", "score": 2, "approved_by": null, "downs": 0, "body": "Thank you. I have a psychiatrist, but I quit yesterday because I was just so confused.\n\nMy friend who's been spreading the \"Im just a regretful whore\" idea was actually there that night. She has told people that I begged her to let me bring this random ass dude back. And claims that I was super into him. I was told by another friend that she tells people that I literally begged and pleaded against her advice. I'm just confused I don't remember any of that but maybe it happened during the memory gaps? And maybe I have those memory gaps because it would be too painful to realize that I brought this on myself... something just doesn't add up to me. I don't understand how I could be so barely able to even stand but also super into some random dude? And how I could be so overpoweringly persistent when I was barely conscious for the majority of the night. But why else would he have been bothering me all night? Like maybe I did do something stupid in between the intoxicated barely able to stand moments? I'm just so confused. I'm also confused because this friend at the beginning of the night suggested that maybe I needed a hook up to get over my ex (I had a recent break up of a long term relationship at the time), and I remember toying with the idea, but not actually being serious? But maybe all the booze just instigated it to actually happen like that? I'm just confused how could I have these memories that give me nightmares and make me feel so sick and scared and uncomfortable in my skin. Like I just don't even know if I could live with knowing that I brought what happened to me on myself. It's just so not a me thing to do. And this particular friend is a bit... well she's not s very head strong person... especially not when she's drunk. I just am having a hard time picturing her trying to \"prevent me from making a mistake\" in the way that she is telling people she did. Is it possible that I could have developed PTSD from deep regret? I'm SO fucking confused. I feel like I've lost my mind. This friend is the same one who I thought actually understood most, and has been very kind to my face. One of the friends she told informed me about what she's been telling people when I started to share my story with her and it contradicted what she heard. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. I have a psychiatrist, but I quit yesterday because I was just so confused.&lt;/p&gt;\n\n&lt;p&gt;My friend who&amp;#39;s been spreading the &amp;quot;Im just a regretful whore&amp;quot; idea was actually there that night. She has told people that I begged her to let me bring this random ass dude back. And claims that I was super into him. I was told by another friend that she tells people that I literally begged and pleaded against her advice. I&amp;#39;m just confused I don&amp;#39;t remember any of that but maybe it happened during the memory gaps? And maybe I have those memory gaps because it would be too painful to realize that I brought this on myself... something just doesn&amp;#39;t add up to me. I don&amp;#39;t understand how I could be so barely able to even stand but also super into some random dude? And how I could be so overpoweringly persistent when I was barely conscious for the majority of the night. But why else would he have been bothering me all night? Like maybe I did do something stupid in between the intoxicated barely able to stand moments? I&amp;#39;m just so confused. I&amp;#39;m also confused because this friend at the beginning of the night suggested that maybe I needed a hook up to get over my ex (I had a recent break up of a long term relationship at the time), and I remember toying with the idea, but not actually being serious? But maybe all the booze just instigated it to actually happen like that? I&amp;#39;m just confused how could I have these memories that give me nightmares and make me feel so sick and scared and uncomfortable in my skin. Like I just don&amp;#39;t even know if I could live with knowing that I brought what happened to me on myself. It&amp;#39;s just so not a me thing to do. And this particular friend is a bit... well she&amp;#39;s not s very head strong person... especially not when she&amp;#39;s drunk. I just am having a hard time picturing her trying to &amp;quot;prevent me from making a mistake&amp;quot; in the way that she is telling people she did. Is it possible that I could have developed PTSD from deep regret? I&amp;#39;m SO fucking confused. I feel like I&amp;#39;ve lost my mind. This friend is the same one who I thought actually understood most, and has been very kind to my face. One of the friends she told informed me about what she&amp;#39;s been telling people when I started to share my story with her and it contradicted what she heard. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgyz8xo", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgyz8xo/", "num_reports": null, "stickied": false, "created": 1493635750.0, "author_flair_text": null, "created_utc": 1493606950.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyynwo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "raaaaaaaaarr", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68jazy", "score": 3, "approved_by": null, "downs": 0, "body": "I am a random internet stranger so it might not mean a ton, but I believe you.  What that person is saying is fucked up - they weren't there *with you*  and they aren't acting like a friend. \nYou aren't worthless - I promise. There are ways out. Please reach out so that a mental health professional can help you ease this incredible pain (without it coming to the tragedy and permanence of suicide). \nYou can go to the emergency room and/or call\n800.273.8255 (National suicide prevention hotline) \n800.656.4673 (RAINN - it's a hotline/and they have resources specifically for sexual assault survivors) ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am a random internet stranger so it might not mean a ton, but I believe you.  What that person is saying is fucked up - they weren&amp;#39;t there &lt;em&gt;with you&lt;/em&gt;  and they aren&amp;#39;t acting like a friend. \nYou aren&amp;#39;t worthless - I promise. There are ways out. Please reach out so that a mental health professional can help you ease this incredible pain (without it coming to the tragedy and permanence of suicide). \nYou can go to the emergency room and/or call\n800.273.8255 (National suicide prevention hotline) \n800.656.4673 (RAINN - it&amp;#39;s a hotline/and they have resources specifically for sexual assault survivors) &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgyynwo", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgyynwo/", "num_reports": null, "stickied": false, "created": 1493634942.0, "author_flair_text": null, "created_utc": 1493606142.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68jazy", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzhzsv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wonderwomanscott", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgz0rjh", "score": 2, "approved_by": null, "downs": 0, "body": "Thank you for this. It helps a lot, and I'm so glad to know that I'm not the only person experiencing these insane memory doubting mindfucks.\n\nYour theory about my friend makes sense. One of my other friends thinks that she is just trying to cover her own ass because she feels guilty that she was the more sober one and that it happened at her boyfriend's house, and started at the place she.m begged me to go, but that's just silly. I would never blame her for that. Regardless, I just I really wish people would stop discussing me. But I don't even know if I can ask them not to, because maybe it stresses them out or worries them or something? Maybe it's how they are trying to sort it out? Either way, it's really sucking for me, and it's making me question what would even be left for me if I finished treatment and kept living my life. What's the point if everyone is going to think this way of me?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for this. It helps a lot, and I&amp;#39;m so glad to know that I&amp;#39;m not the only person experiencing these insane memory doubting mindfucks.&lt;/p&gt;\n\n&lt;p&gt;Your theory about my friend makes sense. One of my other friends thinks that she is just trying to cover her own ass because she feels guilty that she was the more sober one and that it happened at her boyfriend&amp;#39;s house, and started at the place she.m begged me to go, but that&amp;#39;s just silly. I would never blame her for that. Regardless, I just I really wish people would stop discussing me. But I don&amp;#39;t even know if I can ask them not to, because maybe it stresses them out or worries them or something? Maybe it&amp;#39;s how they are trying to sort it out? Either way, it&amp;#39;s really sucking for me, and it&amp;#39;s making me question what would even be left for me if I finished treatment and kept living my life. What&amp;#39;s the point if everyone is going to think this way of me?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgzhzsv", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgzhzsv/", "num_reports": null, "stickied": false, "created": 1493677696.0, "author_flair_text": null, "created_utc": 1493648896.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgz0rjh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "awdsawds", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyzlfo", "score": 1, "approved_by": null, "downs": 0, "body": "I've felt all those things. \"What if I'm making it up?\" \"What if I'm just remembering it wrong?\" And that's just not the case, I've gone back and forth for so long, still sometimes do, but now the truth wins a little bit more often, and eventually I'll be sure. \n\nAt times I've even thought \"I'm remembering it wrong.\" and \"I know what really happened\" at the same time. Which you'd think wouldn't work, but brain does brain things.\n\nIt gets better. \n\nWhy would your friend make it up? Well, 'outsiders' go through the same doubt we do. Because if a guy like that can do it to your friend, he can do it to you. It makes the world less safe for them too, so their brain does similar things. (Just a theory obviously, but would explain why a person you feel cares about you would do something like that.)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve felt all those things. &amp;quot;What if I&amp;#39;m making it up?&amp;quot; &amp;quot;What if I&amp;#39;m just remembering it wrong?&amp;quot; And that&amp;#39;s just not the case, I&amp;#39;ve gone back and forth for so long, still sometimes do, but now the truth wins a little bit more often, and eventually I&amp;#39;ll be sure. &lt;/p&gt;\n\n&lt;p&gt;At times I&amp;#39;ve even thought &amp;quot;I&amp;#39;m remembering it wrong.&amp;quot; and &amp;quot;I know what really happened&amp;quot; at the same time. Which you&amp;#39;d think wouldn&amp;#39;t work, but brain does brain things.&lt;/p&gt;\n\n&lt;p&gt;It gets better. &lt;/p&gt;\n\n&lt;p&gt;Why would your friend make it up? Well, &amp;#39;outsiders&amp;#39; go through the same doubt we do. Because if a guy like that can do it to your friend, he can do it to you. It makes the world less safe for them too, so their brain does similar things. (Just a theory obviously, but would explain why a person you feel cares about you would do something like that.)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgz0rjh", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgz0rjh/", "num_reports": null, "stickied": false, "created": 1493638066.0, "author_flair_text": null, "created_utc": 1493609266.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyzlfo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wonderwomanscott", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyyjx0", "score": 3, "approved_by": null, "downs": 0, "body": "Thanks.\n\nThat's what's so confusing. Like I don't feel like my brain would have just randomly brought this up and caused me the insane issues that I have now. But hearing about what people are saying and how it contradicts how I remember it is starting to make me wonder if I'm just crazy and my mind just doesn't work right or something. I mean my one friend (who's telling everyone) was there. Why would she just make that up? It feels like she genuinely cares about me. I just don't understand it. \n\nIt helps to be reminded that it will pass. I'm honestly just afraid that I can't withstand another blow. I feel like I'm getting more and more destructive and sinking lower each time. \n\nI appreciate so much that you believe me. But I do wish that my own family and friends would too. I'm so sick of it. My own father blamed me for what happened and called it slutty behavior. It's just starting to feel like maybe everyone is right. Maybe my therapist is wrong and just wants to make money off of me. Or maybe I'm just lying by accident and it's thrown her off and we are treating something imaginary. I just don't even fucking know anymore. I just wish I never went anywhere that night. Or I wish I would just randomly die so I wouldn't have to endure this any longer. I'm so embarrassed and ashamed and I feel so disgusting. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s what&amp;#39;s so confusing. Like I don&amp;#39;t feel like my brain would have just randomly brought this up and caused me the insane issues that I have now. But hearing about what people are saying and how it contradicts how I remember it is starting to make me wonder if I&amp;#39;m just crazy and my mind just doesn&amp;#39;t work right or something. I mean my one friend (who&amp;#39;s telling everyone) was there. Why would she just make that up? It feels like she genuinely cares about me. I just don&amp;#39;t understand it. &lt;/p&gt;\n\n&lt;p&gt;It helps to be reminded that it will pass. I&amp;#39;m honestly just afraid that I can&amp;#39;t withstand another blow. I feel like I&amp;#39;m getting more and more destructive and sinking lower each time. &lt;/p&gt;\n\n&lt;p&gt;I appreciate so much that you believe me. But I do wish that my own family and friends would too. I&amp;#39;m so sick of it. My own father blamed me for what happened and called it slutty behavior. It&amp;#39;s just starting to feel like maybe everyone is right. Maybe my therapist is wrong and just wants to make money off of me. Or maybe I&amp;#39;m just lying by accident and it&amp;#39;s thrown her off and we are treating something imaginary. I just don&amp;#39;t even fucking know anymore. I just wish I never went anywhere that night. Or I wish I would just randomly die so I wouldn&amp;#39;t have to endure this any longer. I&amp;#39;m so embarrassed and ashamed and I feel so disgusting. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgyzlfo", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgyzlfo/", "num_reports": null, "stickied": false, "created": 1493636257.0, "author_flair_text": null, "created_utc": 1493607457.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyyjx0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "awdsawds", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68jazy", "score": 3, "approved_by": null, "downs": 0, "body": "What you remember is real. That's what happened. And I'm sorry it did.\n\nIf it hadn't happened, you wouldn't be in the place you're in right now. \n\nIf you had begged and pleaded with him for hours and hours (which I don't think you did as it sounded out of character to you), but then said no, he's still wrong. What you remember still happened.\n\nThese so called friends, aren't your friends. They weren't there but have decided on their own what happened, that's not something a friend does.\n\nYou need to tell your therapist about all of this.\n\nAnd though I hate when people say this to me when I'm in a similar place as you are, it will pass. It **will** pass.\n\nFeelings aren't permanent, they come and go, it's just really fucking hard right now. It does get better, it just takes time.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What you remember is real. That&amp;#39;s what happened. And I&amp;#39;m sorry it did.&lt;/p&gt;\n\n&lt;p&gt;If it hadn&amp;#39;t happened, you wouldn&amp;#39;t be in the place you&amp;#39;re in right now. &lt;/p&gt;\n\n&lt;p&gt;If you had begged and pleaded with him for hours and hours (which I don&amp;#39;t think you did as it sounded out of character to you), but then said no, he&amp;#39;s still wrong. What you remember still happened.&lt;/p&gt;\n\n&lt;p&gt;These so called friends, aren&amp;#39;t your friends. They weren&amp;#39;t there but have decided on their own what happened, that&amp;#39;s not something a friend does.&lt;/p&gt;\n\n&lt;p&gt;You need to tell your therapist about all of this.&lt;/p&gt;\n\n&lt;p&gt;And though I hate when people say this to me when I&amp;#39;m in a similar place as you are, it will pass. It &lt;strong&gt;will&lt;/strong&gt; pass.&lt;/p&gt;\n\n&lt;p&gt;Feelings aren&amp;#39;t permanent, they come and go, it&amp;#39;s just really fucking hard right now. It does get better, it just takes time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dgyyjx0", "score_hidden": false, "permalink": "/r/ptsd/comments/68jazy/i_dont_think_i_can_be_helped_anymore/dgyyjx0/", "num_reports": null, "stickied": false, "created": 1493634781.0, "author_flair_text": null, "created_utc": 1493605981.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]