[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was diagnosed about a month ago. I&amp;#39;ve been taking my meds and am seeing my psychiatrist on Wednesday (thank goodness) but I can&amp;#39;t help but having questions that are burning a hole in my pocket (weird metaphor...sorry). &lt;/p&gt;\n\n&lt;p&gt;One of the things that keeps happening to me is that I&amp;#39;m crazy nostalgic. At a few points in the last six months I&amp;#39;ve actually felt physical pain over wanting so desperately to be a kid again. It&amp;#39;s a real feeling. It&amp;#39;s overpowering. It causes insane crying outbursts. It&amp;#39;s triggered by things that make sense but are impossible for me to avoid. Generally speaking seeing my parents or siblings can send me right over the edge...but the kick in the pants is that we work together. I hate that they trigger me because they have nothing to do with my PTSD...it&amp;#39;s just that I love and appreciate them so much that I start thinking about how wonderful they are and how I wish I could go back and rewrite history and get rid of my PTSD event. &lt;/p&gt;\n\n&lt;p&gt;Does anyone else struggle with nostalgia like this? I cry immediately. Every time. I usually feel better after crying, and I guess it&amp;#39;s not hurting anyone, but it&amp;#39;s hard for my family to see me like this, and it&amp;#39;s not exactly practical for me to be crying away my work day either. &lt;/p&gt;\n\n&lt;p&gt;Help? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was diagnosed about a month ago. I've been taking my meds and am seeing my psychiatrist on Wednesday (thank goodness) but I can't help but having questions that are burning a hole in my pocket (weird metaphor...sorry). \n\nOne of the things that keeps happening to me is that I'm crazy nostalgic. At a few points in the last six months I've actually felt physical pain over wanting so desperately to be a kid again. It's a real feeling. It's overpowering. It causes insane crying outbursts. It's triggered by things that make sense but are impossible for me to avoid. Generally speaking seeing my parents or siblings can send me right over the edge...but the kick in the pants is that we work together. I hate that they trigger me because they have nothing to do with my PTSD...it's just that I love and appreciate them so much that I start thinking about how wonderful they are and how I wish I could go back and rewrite history and get rid of my PTSD event. \n\nDoes anyone else struggle with nostalgia like this? I cry immediately. Every time. I usually feel better after crying, and I guess it's not hurting anyone, but it's hard for my family to see me like this, and it's not exactly practical for me to be crying away my work day either. \n\nHelp? ", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "68nrja", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "fraggle0312", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 3, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 1, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_68nrja", "spoiler": false, "permalink": "/r/ptsd/comments/68nrja/newly_diagnosed_and_trying_to_understand/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1493692282.0, "url": "https://www.reddit.com/r/ptsd/comments/68nrja/newly_diagnosed_and_trying_to_understand/", "author_flair_text": null, "quarantine": false, "title": "Newly diagnosed and trying to understand nostalgia and crying outbursts.", "created_utc": 1493663482.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.81, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 3}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68nrja", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dh075si", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "stariari", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68nrja", "score": 2, "approved_by": null, "downs": 0, "body": "Hi, newly diagnosed as well. Every single time I see an adult who has not yet confronted me about my trauma (but knows about it), I run into their arms and sob. I have no idea why I do this, and it makes going out in public really difficult. (Most people who know me know about my trauma, as there was a decent amount of media involvement). \n\nI think you hit the nail right on the head when you wrote about how seeing certain individuals make you remember a time before your trauma. I think there is a part of you that feels much safer with these certain individuals-- explaining why you feel better after crying; you're experiencing relief. \n\nI too have a lot of doubts and issues expressing emotion to my loved ones. I feel like I make them uncomfortable and that I'm being a burden. One piece of advice from my favorite teacher in high school: your closest friends and family want to do whatever they can to support you. Expressing emotion and relying on them for safety and relief is not being a burden. They are there for you, they are sorry, and they want to help you. \n\nTake some time to rely on them. And appreciate them for it. You don't have to go to great lengths, but just remind them that you are grateful. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi, newly diagnosed as well. Every single time I see an adult who has not yet confronted me about my trauma (but knows about it), I run into their arms and sob. I have no idea why I do this, and it makes going out in public really difficult. (Most people who know me know about my trauma, as there was a decent amount of media involvement). &lt;/p&gt;\n\n&lt;p&gt;I think you hit the nail right on the head when you wrote about how seeing certain individuals make you remember a time before your trauma. I think there is a part of you that feels much safer with these certain individuals-- explaining why you feel better after crying; you&amp;#39;re experiencing relief. &lt;/p&gt;\n\n&lt;p&gt;I too have a lot of doubts and issues expressing emotion to my loved ones. I feel like I make them uncomfortable and that I&amp;#39;m being a burden. One piece of advice from my favorite teacher in high school: your closest friends and family want to do whatever they can to support you. Expressing emotion and relying on them for safety and relief is not being a burden. They are there for you, they are sorry, and they want to help you. &lt;/p&gt;\n\n&lt;p&gt;Take some time to rely on them. And appreciate them for it. You don&amp;#39;t have to go to great lengths, but just remind them that you are grateful. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_dh075si", "score_hidden": false, "permalink": "/r/ptsd/comments/68nrja/newly_diagnosed_and_trying_to_understand/dh075si/", "num_reports": null, "stickied": false, "created": 1493707427.0, "author_flair_text": null, "created_utc": 1493678627.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]