[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Summary: &lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;From the best-by-far student in my generation during first 3.5 years of college, ended up failing the rest of my masters studies and lost the right to continue my studies on the same college.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;ve been in love with the same girl for 5+ years, the time spent was mostly me chasing her. She liked me back, but she constantly sabotaged the situation to buy more time as she didn&amp;#39;t want a relationship until her college came close to an end. The relationship finally started around a year ago, lasted for few months then her final college year starts and her course plan changes and instead the year ends up being the most time-consuming instead of the easiest one. She breaks things off soon after the realisation.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Before the whole relationship thing happened, I planned to spend my summer studying so that I can finish my college, instead, she contacts me, we spend lot of time together, I become unable to focus on anything else, I miserably fail my college.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Initially, I don&amp;#39;t feel anything. I&amp;#39;m totally aware of the situation but nothing actually gets to me, no real emotions. Four months later it hits me really hard. On both counts. Delayed, amplified, horrible pain.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Immediately after both things happened, being still able to think clearly then, I worked up a plan to make enough money to continue my college in other city the next year (this one). It started off in a way that exceeded my expectations by far and it went really well until the point where all the repressed emotions manage to escape. Instantly lose motivation in everything, start spending the days lying on the floor and staring at the ceiling.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Total isolation from everyone. Unable to talk to anyone without becoming extremely rude. The only thing that seems to calm me are long night walks, which, ironically is the thing I mostly used to do with her. &lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I could write 10x more length about this as there is a lot more that is important to understand the way things lead from one to another, but I really have no energy to do so. I would want to hear some advices and ideas on how to improve my mental state as I&amp;#39;m seriously contemplating taking the money I saved and travel off somewhere to die.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Summary: \n\n1. From the best-by-far student in my generation during first 3.5 years of college, ended up failing the rest of my masters studies and lost the right to continue my studies on the same college.\n\n2. I've been in love with the same girl for 5+ years, the time spent was mostly me chasing her. She liked me back, but she constantly sabotaged the situation to buy more time as she didn't want a relationship until her college came close to an end. The relationship finally started around a year ago, lasted for few months then her final college year starts and her course plan changes and instead the year ends up being the most time-consuming instead of the easiest one. She breaks things off soon after the realisation.\n\n3. Before the whole relationship thing happened, I planned to spend my summer studying so that I can finish my college, instead, she contacts me, we spend lot of time together, I become unable to focus on anything else, I miserably fail my college.\n\n4. Initially, I don't feel anything. I'm totally aware of the situation but nothing actually gets to me, no real emotions. Four months later it hits me really hard. On both counts. Delayed, amplified, horrible pain.\n\n5. Immediately after both things happened, being still able to think clearly then, I worked up a plan to make enough money to continue my college in other city the next year (this one). It started off in a way that exceeded my expectations by far and it went really well until the point where all the repressed emotions manage to escape. Instantly lose motivation in everything, start spending the days lying on the floor and staring at the ceiling.\n\n6. Total isolation from everyone. Unable to talk to anyone without becoming extremely rude. The only thing that seems to calm me are long night walks, which, ironically is the thing I mostly used to do with her. \n\nI could write 10x more length about this as there is a lot more that is important to understand the way things lead from one to another, but I really have no energy to do so. I would want to hear some advices and ideas on how to improve my mental state as I'm seriously contemplating taking the money I saved and travel off somewhere to die.\n", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "3bp3or", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "augustus318", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": false, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 3, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83419, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_3bp3or", "spoiler": false, "permalink": "/r/SuicideWatch/comments/3bp3or/im_unable_to_find_any_strength_to_move_on_i/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1435738889.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/3bp3or/im_unable_to_find_any_strength_to_move_on_i/", "author_flair_text": null, "quarantine": false, "title": "I'm unable to find any strength to move on, I really need some help on how to move on", "created_utc": 1435710089.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3bp3or", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3bp3or", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3bp3or", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "csonhhv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "The_Real_Platypus", "can_mod_post": false, "send_replies": true, "parent_id": "t1_csois4p", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; But as of now, I'm basically unable to view other people in any positive way. I see hints of their true personality and internally judge them on things that I actually shouldn't.\n\nThis was me years ago. I began to feel jaded and depressed by seeing others happiness and it made me think \"just fuck everything and fuck the world\". I hated thinking that way, it made me even more sad and depressed Since i knew people weren't that way.Worst part of it all was I was working at a theme park so I would see couples and married folks  having the time of their lives and I'd be forced to just soak in everything and I couldn't react or say what  I truly felt. I could go on and on but I don't want to waster your time.\n\n&gt; Do you think will you be able to put yourself together again?\n\nLife is shitty for me right now with her. I knew something like this could happen and  I knew I would react this way. i never thought it would be like a damn novel where she cant love me the way I love her. \n\nThe only thing I can do is adapt. This is what my life is right now, I don't know if it will be like this forever, you're stil young, and I'm still young so probably not. If there is anything I can say to you, hell even for me, its this: Find an Excuse to Win, and Keep Going. We are the biggest enemies to ourselves. How big this challenge is up to us and how these moments define us , if we choose to  let it define us, is on us. How can I come out on top in this shitty situation? Fight, Keep on fighting Brother. Don't ever think that there isn't a god damn person out there who cares or won't listen. Maybe it was just by chance that 2 complete strangers have been having shitty lives and just happen to meet in one place like right here, I don't know. if there's any glimmer of hope from all this, I'd say that there is  still a lot to experience and see in this life, and I'm not going to press or seek out a relationship anytime soon. I need time for myself, I need to look out for #1 and I know I'm the only person I can count on 100% to do so. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But as of now, I&amp;#39;m basically unable to view other people in any positive way. I see hints of their true personality and internally judge them on things that I actually shouldn&amp;#39;t.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This was me years ago. I began to feel jaded and depressed by seeing others happiness and it made me think &amp;quot;just fuck everything and fuck the world&amp;quot;. I hated thinking that way, it made me even more sad and depressed Since i knew people weren&amp;#39;t that way.Worst part of it all was I was working at a theme park so I would see couples and married folks  having the time of their lives and I&amp;#39;d be forced to just soak in everything and I couldn&amp;#39;t react or say what  I truly felt. I could go on and on but I don&amp;#39;t want to waster your time.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do you think will you be able to put yourself together again?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Life is shitty for me right now with her. I knew something like this could happen and  I knew I would react this way. i never thought it would be like a damn novel where she cant love me the way I love her. &lt;/p&gt;\n\n&lt;p&gt;The only thing I can do is adapt. This is what my life is right now, I don&amp;#39;t know if it will be like this forever, you&amp;#39;re stil young, and I&amp;#39;m still young so probably not. If there is anything I can say to you, hell even for me, its this: Find an Excuse to Win, and Keep Going. We are the biggest enemies to ourselves. How big this challenge is up to us and how these moments define us , if we choose to  let it define us, is on us. How can I come out on top in this shitty situation? Fight, Keep on fighting Brother. Don&amp;#39;t ever think that there isn&amp;#39;t a god damn person out there who cares or won&amp;#39;t listen. Maybe it was just by chance that 2 complete strangers have been having shitty lives and just happen to meet in one place like right here, I don&amp;#39;t know. if there&amp;#39;s any glimmer of hope from all this, I&amp;#39;d say that there is  still a lot to experience and see in this life, and I&amp;#39;m not going to press or seek out a relationship anytime soon. I need time for myself, I need to look out for #1 and I know I&amp;#39;m the only person I can count on 100% to do so. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_csonhhv", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/3bp3or/im_unable_to_find_any_strength_to_move_on_i/csonhhv/", "num_reports": null, "stickied": false, "created": 1435786535.0, "author_flair_text": null, "created_utc": 1435757735.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "csois4p", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "augustus318", "can_mod_post": false, "send_replies": true, "parent_id": "t1_csoie9w", "score": 1, "approved_by": null, "downs": 0, "body": "I'm sorry to hear that. Do you think will you be able to put yourself together again? Because, that is the question I'm asking myself. I have always been extremely good to people - friends, strangers and enemies. I would help almost anyone in any way I could, so basically, that \"do good stuff\" thing really resonated with me. If I saw that any of my actions would result in other person getting hurt in any way, I would not do the thing. This includes women also. But as of now, I'm basically unable to view other people in any positive way. I see hints of their true personality and internally judge them on things that I actually shouldn't. When I failed my college, no-one, absolutely fucking no-one from college people I knew picked up the phone and tried contacting me. And those are the people that I helped in a significant manner during the first 3 years of college, totally free. They're not my friends really, but they're not strangers either. And it wasn't that they did not know what happened, they did, the word spread out really fast. So, basically, I'm questioning whether this \"altruism\" thing really makes any sense at all... \n\nAnd as of keeping my mind busy, yes, I did that for quite some time. But there would be moments in which that would fail and if they lasted too long then the bad emotions take-over for quite some time....", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear that. Do you think will you be able to put yourself together again? Because, that is the question I&amp;#39;m asking myself. I have always been extremely good to people - friends, strangers and enemies. I would help almost anyone in any way I could, so basically, that &amp;quot;do good stuff&amp;quot; thing really resonated with me. If I saw that any of my actions would result in other person getting hurt in any way, I would not do the thing. This includes women also. But as of now, I&amp;#39;m basically unable to view other people in any positive way. I see hints of their true personality and internally judge them on things that I actually shouldn&amp;#39;t. When I failed my college, no-one, absolutely fucking no-one from college people I knew picked up the phone and tried contacting me. And those are the people that I helped in a significant manner during the first 3 years of college, totally free. They&amp;#39;re not my friends really, but they&amp;#39;re not strangers either. And it wasn&amp;#39;t that they did not know what happened, they did, the word spread out really fast. So, basically, I&amp;#39;m questioning whether this &amp;quot;altruism&amp;quot; thing really makes any sense at all... &lt;/p&gt;\n\n&lt;p&gt;And as of keeping my mind busy, yes, I did that for quite some time. But there would be moments in which that would fail and if they lasted too long then the bad emotions take-over for quite some time....&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_csois4p", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/3bp3or/im_unable_to_find_any_strength_to_move_on_i/csois4p/", "num_reports": null, "stickied": false, "created": 1435771084.0, "author_flair_text": null, "created_utc": 1435742284.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "csoie9w", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "The_Real_Platypus", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3bp3or", "score": 2, "approved_by": null, "downs": 0, "body": "Friend, I'm in slightly similar situation. The women I'd plan on marrying chhanged courses and my life is upside down. I'mm sorry about your studies and her, if she wasn't willing to make time for you then its her loss. As for the mental state, I'd disocvered finding something to keep your mind busy. Anything from her or any painful thoughts. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Friend, I&amp;#39;m in slightly similar situation. The women I&amp;#39;d plan on marrying chhanged courses and my life is upside down. I&amp;#39;mm sorry about your studies and her, if she wasn&amp;#39;t willing to make time for you then its her loss. As for the mental state, I&amp;#39;d disocvered finding something to keep your mind busy. Anything from her or any painful thoughts. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_csoie9w", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/3bp3or/im_unable_to_find_any_strength_to_move_on_i/csoie9w/", "num_reports": null, "stickied": false, "created": 1435769420.0, "author_flair_text": null, "created_utc": 1435740620.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]