[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have been abused by my parents when i was a kid. There is a threat present wherever i am. Needless to say that was the cause of my PTSD. My full story here: &lt;a href=\"https://redd.it/480ocf\"&gt;https://redd.it/480ocf&lt;/a&gt; (please don&amp;#39;t call cops because it&amp;#39;s from suicidewatch, please)&lt;/p&gt;\n\n&lt;p&gt;As much as i hated my parents and whoever bullied or failed to protect me, i have been debating whether i am right to hate them or not.&lt;/p&gt;\n\n&lt;p&gt;For the bullied kids, the dilemma was simple. Of course they deserve to be hated, but i also hate myself for not doing anything more to fight against them. I was weak, powerless, and no one was there to help. Therefore i endured. I could have secretly harass them for revenge. But i didn&amp;#39;t. I was wonder if it was my fault that i was being a coward to take a bigger step to fight for myself.&lt;/p&gt;\n\n&lt;p&gt;As for my sister, i also hate her, but she did not directly involve in my abuse. She was spoiled by my parents, and she got everything i ever wished for without a bit of suffering. She get to say that she&amp;#39;s lazy whereas i have to work my ass off with zero break. I was annoyed the hell out dealing with her spoiled ad childish personality. I hated her for supporting my parents&amp;#39; belief which ultimately made me suffer. She was the one who insults me every time she was praised or whenever i want to do something. She insulted, belittled me for everything. She was there laughing while i have to work extra to meet my parent&amp;#39;s expectations. She was there laughing when my parents beat me up. She rubbed it on my face every time it happened. She did not tell my parents to stop my beating and the drugs. But maybe i was wrong. After all, she did support me a bit. She did helped me with my studies sometimes and she did cook for me a few meals. I am too sensitive to handle her verbal abuse? Also, if i hate her because she didn&amp;#39;t support me for my beatings and drugs, i might be in the wrong. Children have no right no speak against parent, that&amp;#39;s my culture. She&amp;#39;s as helpless as i am, just without the beatings and drugs. I don&amp;#39;t know if i am just envious for what she owned or just straight out hating her.&lt;/p&gt;\n\n&lt;p&gt;As for my parents. They did things to me, good and bad, i recognize it. As much as the abuse went, they did took me out for vacations. They made birthdays parties. They did pay for my education, buy stuffs i need and giving me a prosperous environment that many people dreamed of. They even sent my to study oversea, which hardly any family able to afford. Does that compensate for what they&amp;#39;ve put me through? The beatings they gave me was considered the norm. Almost every parents in my country beat up their kids and forced them to study after hours. It was believed to be a good way to educate children. Am i the only freak who think it&amp;#39;s wrong? Maybe they just didn&amp;#39;t know what i think, or maybe just poorly educated? If they were educated will they stop my beating and after hour education? After all, i do know that they love me. In short, are they at fault for not knowing? Same goes for the drugs. It was painful, so painful i begged for my survival. But they wanted me to be healthy. They have good intention. Is it even a valid excuse? Same goes as when he forced me to have sex with my mom. They just believed that it is the easiest and quickest way for sex ed. They just do what they think they have to. I don&amp;#39;t think they would even understand my hardship with their self-centered personality but what if they do?&lt;/p&gt;\n\n&lt;p&gt;What i also feared the most is when i need to separate from them (like now), is fighting against the majority that would support my parents and not me. Mental illness isn&amp;#39;t something my country have yet accepted. If you picked a random person on the street and talk about mental illness, most likely they would throw the good old &amp;quot;man up&amp;quot; at you. They would throw the &amp;quot;obey your parents&amp;quot; and &amp;quot;you are having more than most people wished for&amp;quot;. That&amp;#39;s my home country, and i&amp;#39;m only a guest where i&amp;#39;m staying. It means that i&amp;#39;d have to go back where i &amp;quot;belong&amp;quot; soon. It means torment. I hate it when country matters, but that&amp;#39;s the thing and i can&amp;#39;t do anything about it. Soon enough, there won&amp;#39;t be a safe place for me anymore. &lt;/p&gt;\n\n&lt;p&gt;I will try to fight with my trauma, but for now, i just want to know whether or not i am right to hate them, or am i just a sensitive, spoiled kid.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have been abused by my parents when i was a kid. There is a threat present wherever i am. Needless to say that was the cause of my PTSD. My full story here: https://redd.it/480ocf (please don't call cops because it's from suicidewatch, please)\n\nAs much as i hated my parents and whoever bullied or failed to protect me, i have been debating whether i am right to hate them or not.\n\nFor the bullied kids, the dilemma was simple. Of course they deserve to be hated, but i also hate myself for not doing anything more to fight against them. I was weak, powerless, and no one was there to help. Therefore i endured. I could have secretly harass them for revenge. But i didn't. I was wonder if it was my fault that i was being a coward to take a bigger step to fight for myself.\n\nAs for my sister, i also hate her, but she did not directly involve in my abuse. She was spoiled by my parents, and she got everything i ever wished for without a bit of suffering. She get to say that she's lazy whereas i have to work my ass off with zero break. I was annoyed the hell out dealing with her spoiled ad childish personality. I hated her for supporting my parents' belief which ultimately made me suffer. She was the one who insults me every time she was praised or whenever i want to do something. She insulted, belittled me for everything. She was there laughing while i have to work extra to meet my parent's expectations. She was there laughing when my parents beat me up. She rubbed it on my face every time it happened. She did not tell my parents to stop my beating and the drugs. But maybe i was wrong. After all, she did support me a bit. She did helped me with my studies sometimes and she did cook for me a few meals. I am too sensitive to handle her verbal abuse? Also, if i hate her because she didn't support me for my beatings and drugs, i might be in the wrong. Children have no right no speak against parent, that's my culture. She's as helpless as i am, just without the beatings and drugs. I don't know if i am just envious for what she owned or just straight out hating her.\n\nAs for my parents. They did things to me, good and bad, i recognize it. As much as the abuse went, they did took me out for vacations. They made birthdays parties. They did pay for my education, buy stuffs i need and giving me a prosperous environment that many people dreamed of. They even sent my to study oversea, which hardly any family able to afford. Does that compensate for what they've put me through? The beatings they gave me was considered the norm. Almost every parents in my country beat up their kids and forced them to study after hours. It was believed to be a good way to educate children. Am i the only freak who think it's wrong? Maybe they just didn't know what i think, or maybe just poorly educated? If they were educated will they stop my beating and after hour education? After all, i do know that they love me. In short, are they at fault for not knowing? Same goes for the drugs. It was painful, so painful i begged for my survival. But they wanted me to be healthy. They have good intention. Is it even a valid excuse? Same goes as when he forced me to have sex with my mom. They just believed that it is the easiest and quickest way for sex ed. They just do what they think they have to. I don't think they would even understand my hardship with their self-centered personality but what if they do?\n\nWhat i also feared the most is when i need to separate from them (like now), is fighting against the majority that would support my parents and not me. Mental illness isn't something my country have yet accepted. If you picked a random person on the street and talk about mental illness, most likely they would throw the good old \"man up\" at you. They would throw the \"obey your parents\" and \"you are having more than most people wished for\". That's my home country, and i'm only a guest where i'm staying. It means that i'd have to go back where i \"belong\" soon. It means torment. I hate it when country matters, but that's the thing and i can't do anything about it. Soon enough, there won't be a safe place for me anymore. \n\nI will try to fight with my trauma, but for now, i just want to know whether or not i am right to hate them, or am i just a sensitive, spoiled kid.\n\n", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4d5i8m", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "LeSolari", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 7, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 16, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_4d5i8m", "spoiler": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1459701649.0, "url": "https://www.reddit.com/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/", "author_flair_text": null, "quarantine": false, "title": "Am i right to hate my parents? (TW)", "created_utc": 1459672849.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.77, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 7}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 6, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d1oyyd8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "juanappleseed", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1ogr3h", "score": 2, "approved_by": null, "downs": 0, "body": "You are ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1oyyd8", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1oyyd8/", "num_reports": null, "stickied": false, "created": 1459771984.0, "author_flair_text": null, "created_utc": 1459743184.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1ogr3h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LeSolari", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1o78jx", "score": 1, "approved_by": null, "downs": 0, "body": "Thanks, it really helped me. \n\nJust one problem: i have tried many meditation methods including yoga and chi gong. They don't work. I will bring this up to my psychiatrist next week. I'd like to know if there is another way to ease my anger, if any. Thanks", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, it really helped me. &lt;/p&gt;\n\n&lt;p&gt;Just one problem: i have tried many meditation methods including yoga and chi gong. They don&amp;#39;t work. I will bring this up to my psychiatrist next week. I&amp;#39;d like to know if there is another way to ease my anger, if any. Thanks&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1ogr3h", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1ogr3h/", "num_reports": null, "stickied": false, "created": 1459744702.0, "author_flair_text": null, "created_utc": 1459715902.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d1oavgu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "lugnutter", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1o78jx", "score": 3, "approved_by": null, "downs": 0, "body": "This is the best response possible, in my opinion. Your feelings are important and you must learn to accept them as they are. They aren't good. They aren't bad. They just are what they are. And that's okay. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the best response possible, in my opinion. Your feelings are important and you must learn to accept them as they are. They aren&amp;#39;t good. They aren&amp;#39;t bad. They just are what they are. And that&amp;#39;s okay. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1oavgu", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1oavgu/", "num_reports": null, "stickied": false, "created": 1459735367.0, "author_flair_text": null, "created_utc": 1459706567.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1o78jx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "juanappleseed", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4d5i8m", "score": 6, "approved_by": null, "downs": 0, "body": "The brain doesn't work by you coming to a logical conclusion and then that making you feel the appropriate feeling.\n\nAll you need to know is you feel angry, and indignant, for what you perceived that people did to you. You need to honor that, for \"what you resist, persists\". In other words, if you rationally decide you shouldn't be angry with them when you are OBVIOUSLY feeling anger and rage and indignation, you are going to repress those feelings and they will grow in intensity over time.\n\nYou must allow yourself the freedom to feel whatever you feel, otherwise you are inviting supreme suffering on yourself. \n\nA hallmark of cptsd is that victims question the legitimacy of their feelings because they are so repetitively disregarded and hurt. Because we learned that our emotions will cause us too much pain in our traumatic relationships, we didn't learn that they are to be honored and attended to, no matter if they're justified, because no matter what, INTRINSICALLY, THE WAY WE FEEL ALWAYS MATTERS WHETHER IT MAKES SENSE OR NOT. It will be a long road to believing this, but if you don't you will never have a healthy emotional system, and you won't be able to socially bond with people in any kind of deep rewarding way either.\n\nIonically, when you allow room for your anger whether it's rational or not, that anger energy will disperse and you will become calm and you wont be angry anymore no matter how much its justified. This is the idea behind meditation by the way. Super effective for emotional, mental, central nervous system health, which are the biggest influences on how great or horrible your experience of life is going to be moment by moment.\n\nHope this helps, feel free to ask any questions, all this comes from experience and research into how to have emotional and central nervous system health and move on from old angers and trauma.", "edited": 1459701427.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The brain doesn&amp;#39;t work by you coming to a logical conclusion and then that making you feel the appropriate feeling.&lt;/p&gt;\n\n&lt;p&gt;All you need to know is you feel angry, and indignant, for what you perceived that people did to you. You need to honor that, for &amp;quot;what you resist, persists&amp;quot;. In other words, if you rationally decide you shouldn&amp;#39;t be angry with them when you are OBVIOUSLY feeling anger and rage and indignation, you are going to repress those feelings and they will grow in intensity over time.&lt;/p&gt;\n\n&lt;p&gt;You must allow yourself the freedom to feel whatever you feel, otherwise you are inviting supreme suffering on yourself. &lt;/p&gt;\n\n&lt;p&gt;A hallmark of cptsd is that victims question the legitimacy of their feelings because they are so repetitively disregarded and hurt. Because we learned that our emotions will cause us too much pain in our traumatic relationships, we didn&amp;#39;t learn that they are to be honored and attended to, no matter if they&amp;#39;re justified, because no matter what, INTRINSICALLY, THE WAY WE FEEL ALWAYS MATTERS WHETHER IT MAKES SENSE OR NOT. It will be a long road to believing this, but if you don&amp;#39;t you will never have a healthy emotional system, and you won&amp;#39;t be able to socially bond with people in any kind of deep rewarding way either.&lt;/p&gt;\n\n&lt;p&gt;Ionically, when you allow room for your anger whether it&amp;#39;s rational or not, that anger energy will disperse and you will become calm and you wont be angry anymore no matter how much its justified. This is the idea behind meditation by the way. Super effective for emotional, mental, central nervous system health, which are the biggest influences on how great or horrible your experience of life is going to be moment by moment.&lt;/p&gt;\n\n&lt;p&gt;Hope this helps, feel free to ask any questions, all this comes from experience and research into how to have emotional and central nervous system health and move on from old angers and trauma.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1o78jx", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1o78jx/", "num_reports": null, "stickied": false, "created": 1459729895.0, "author_flair_text": null, "created_utc": 1459701095.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d1og61b", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LeSolari", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1nzwet", "score": 1, "approved_by": null, "downs": 0, "body": "i can apply for permanent resident with compassionate reason, which is what i am doing right now. There is no guaranteed success but at least it's worth a shot. I can work while in school as long as apply for work permit, which should take about a month to process. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i can apply for permanent resident with compassionate reason, which is what i am doing right now. There is no guaranteed success but at least it&amp;#39;s worth a shot. I can work while in school as long as apply for work permit, which should take about a month to process. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1og61b", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1og61b/", "num_reports": null, "stickied": false, "created": 1459743766.0, "author_flair_text": null, "created_utc": 1459714966.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1nzwet", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "sophiewophie666", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4d5i8m", "score": 3, "approved_by": null, "downs": 0, "body": "I am so, so, SO sorry that your parents are absolute monsters. You have every right to hate them. How they've treated you and what they've done to you is sick and disgusting. \n\nIs there anyway you can apply for a green card, or work while you're in school so you can save money and escape them if you return to Vietnam? I wish I could rescue you myself. I'm so sorry. \n\nThere is also a good suhreddit that might help with some resources at /r/raisedbynarcissists ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am so, so, SO sorry that your parents are absolute monsters. You have every right to hate them. How they&amp;#39;ve treated you and what they&amp;#39;ve done to you is sick and disgusting. &lt;/p&gt;\n\n&lt;p&gt;Is there anyway you can apply for a green card, or work while you&amp;#39;re in school so you can save money and escape them if you return to Vietnam? I wish I could rescue you myself. I&amp;#39;m so sorry. &lt;/p&gt;\n\n&lt;p&gt;There is also a good suhreddit that might help with some resources at &lt;a href=\"/r/raisedbynarcissists\"&gt;/r/raisedbynarcissists&lt;/a&gt; &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1nzwet", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1nzwet/", "num_reports": null, "stickied": false, "created": 1459714819.0, "author_flair_text": null, "created_utc": 1459686019.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 5, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d1q8u5l", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Acrophobe", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1q8lyb", "score": 2, "approved_by": null, "downs": 0, "body": "I'm glad I could give you some ideas, you're the one doing the hard work. It's important to realize that you are doing a great job asking for help and following through. It's easy to discount your strides towards getting help. Be proud of yourself. I hope everything works out! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad I could give you some ideas, you&amp;#39;re the one doing the hard work. It&amp;#39;s important to realize that you are doing a great job asking for help and following through. It&amp;#39;s easy to discount your strides towards getting help. Be proud of yourself. I hope everything works out! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1q8u5l", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1q8u5l/", "num_reports": null, "stickied": false, "created": 1459854091.0, "author_flair_text": null, "created_utc": 1459825291.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1q8lyb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LeSolari", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1ow3x3", "score": 1, "approved_by": null, "downs": 0, "body": "Wow, you definitely are saving my ass with your suggestions. I actually did look into that way on immigrating, and it is possible to stay in Canada because i have a student permit. My visa extends for 2 years and processing time could go pass that. I'll research further into extending visas and see what paper is needed. \n\nAs for charities, i'll see how effective CauseVox is (they have free individual plan) and i'll start as soon as things go well. Specifically, as soon as i get my work permit.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, you definitely are saving my ass with your suggestions. I actually did look into that way on immigrating, and it is possible to stay in Canada because i have a student permit. My visa extends for 2 years and processing time could go pass that. I&amp;#39;ll research further into extending visas and see what paper is needed. &lt;/p&gt;\n\n&lt;p&gt;As for charities, i&amp;#39;ll see how effective CauseVox is (they have free individual plan) and i&amp;#39;ll start as soon as things go well. Specifically, as soon as i get my work permit.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1q8lyb", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1q8lyb/", "num_reports": null, "stickied": false, "created": 1459853749.0, "author_flair_text": null, "created_utc": 1459824949.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1ow3x3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Acrophobe", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1oh9c6", "score": 2, "approved_by": null, "downs": 0, "body": "Honestly it's hard when you want nothing to do with people who really hurt you but they have power or money that could help you have a future that they took away from you by abusing you. Think of it as you taking what you deserve, you deserved a bright future without the burden of PTSD, they took you and made you want to kill yourself. That is wrong, you deserve better. As my therapist always tells me \"you need to focus on what is best for you now.\" I used to worry about taking care of my parents but they are the ones that made me not want to take care of them. \n\nYou don't need to feel like you owe them. The problem with parents that abuse is they get in your head and make you feel like you owe them for not letting you die as a baby which honestly is fucked up. If you have a child you are responsible for it because you brought it into this world not of its choice but of yours. A baby relies on you because it's a baby, in the wild most animals train their kids to survive and then set them free when they can handle themselves (sometimes even kick them out at that point). Human society requires a lot for you to survive, what should happen is your parents do a good job loving and raising you that you feel grateful and want to help them when they are older because you love them. Not out of some family duty, but because they earned your help by being good parents. You clearly didn't get that. You don't owe them anything, they owe you. \n\nYou won't be in the wrong for naming them or not taking care of them for retirement, but I think getting the law involved might be emotionally straining for you and I don't know how drawn out the process would become. It might be something to ask people if they need that information and would need to press charges so you can stay in Canada. Also you could ask if they would let you stay while they review your application for compassionate permanent residency.\n\nAlso it doesn't hurt to let your situation be known, if you need money for an immigration lawyer so you can stay you could set up a Kickstarter or something and spread the word around about your situation. Reddit is another way to get attention for your situation. A lot of people do care, you can look into charities or other organizations that are meant to help immigrants. A lot of people know what it's like to be stuck in a shitty situation. Also if you can graduate you can apply for a post-graduation work permit in Canada. Definitely ask around at various immigration places if you can. Some immigration lawyers won't charge you if they fail in getting you citizenship. I wish I could give you better help, but I'm not Canadian. You could ask on Reddit about Canadian immigration info, though it'd be best to ask immigration. I really hope everything works out for you.\n\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly it&amp;#39;s hard when you want nothing to do with people who really hurt you but they have power or money that could help you have a future that they took away from you by abusing you. Think of it as you taking what you deserve, you deserved a bright future without the burden of PTSD, they took you and made you want to kill yourself. That is wrong, you deserve better. As my therapist always tells me &amp;quot;you need to focus on what is best for you now.&amp;quot; I used to worry about taking care of my parents but they are the ones that made me not want to take care of them. &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t need to feel like you owe them. The problem with parents that abuse is they get in your head and make you feel like you owe them for not letting you die as a baby which honestly is fucked up. If you have a child you are responsible for it because you brought it into this world not of its choice but of yours. A baby relies on you because it&amp;#39;s a baby, in the wild most animals train their kids to survive and then set them free when they can handle themselves (sometimes even kick them out at that point). Human society requires a lot for you to survive, what should happen is your parents do a good job loving and raising you that you feel grateful and want to help them when they are older because you love them. Not out of some family duty, but because they earned your help by being good parents. You clearly didn&amp;#39;t get that. You don&amp;#39;t owe them anything, they owe you. &lt;/p&gt;\n\n&lt;p&gt;You won&amp;#39;t be in the wrong for naming them or not taking care of them for retirement, but I think getting the law involved might be emotionally straining for you and I don&amp;#39;t know how drawn out the process would become. It might be something to ask people if they need that information and would need to press charges so you can stay in Canada. Also you could ask if they would let you stay while they review your application for compassionate permanent residency.&lt;/p&gt;\n\n&lt;p&gt;Also it doesn&amp;#39;t hurt to let your situation be known, if you need money for an immigration lawyer so you can stay you could set up a Kickstarter or something and spread the word around about your situation. Reddit is another way to get attention for your situation. A lot of people do care, you can look into charities or other organizations that are meant to help immigrants. A lot of people know what it&amp;#39;s like to be stuck in a shitty situation. Also if you can graduate you can apply for a post-graduation work permit in Canada. Definitely ask around at various immigration places if you can. Some immigration lawyers won&amp;#39;t charge you if they fail in getting you citizenship. I wish I could give you better help, but I&amp;#39;m not Canadian. You could ask on Reddit about Canadian immigration info, though it&amp;#39;d be best to ask immigration. I really hope everything works out for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1ow3x3", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1ow3x3/", "num_reports": null, "stickied": false, "created": 1459767616.0, "author_flair_text": null, "created_utc": 1459738816.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1oh9c6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LeSolari", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1nymck", "score": 1, "approved_by": null, "downs": 0, "body": "It's a good idea. I could get the papers from them by lying. I will figure out the best lying reason soon.\n\nFar as i am concern, i don't want to use them or their money because it'd make me feel like i owe them. But in no way i can run away without doing it.\n\nI checked with a refugee clinic in Canada. I can apply for permanent  resident with compassionate reason but it has a ridiculous time frame from 6 months to 4 years. That's the only way because i can't apply for other status. If i apply for refugee status and succeed, i will lose my student status and if i fail (which i likely am) i will be deported. I can't apply permanent residence normally because i don't have my degree yet. Hell, i don't even know if i can graduate with my state of mind right now.\n\nWhat i'm also wondering is whether it is right to publicly shame them by releasing their names. Surely it'd pressure them to release me, but if a lot of people think it's wrong to do this then it might backfire. They are asking me to take care of them for their retirement, and in no way i will do it.", "edited": 1459718876.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s a good idea. I could get the papers from them by lying. I will figure out the best lying reason soon.&lt;/p&gt;\n\n&lt;p&gt;Far as i am concern, i don&amp;#39;t want to use them or their money because it&amp;#39;d make me feel like i owe them. But in no way i can run away without doing it.&lt;/p&gt;\n\n&lt;p&gt;I checked with a refugee clinic in Canada. I can apply for permanent  resident with compassionate reason but it has a ridiculous time frame from 6 months to 4 years. That&amp;#39;s the only way because i can&amp;#39;t apply for other status. If i apply for refugee status and succeed, i will lose my student status and if i fail (which i likely am) i will be deported. I can&amp;#39;t apply permanent residence normally because i don&amp;#39;t have my degree yet. Hell, i don&amp;#39;t even know if i can graduate with my state of mind right now.&lt;/p&gt;\n\n&lt;p&gt;What i&amp;#39;m also wondering is whether it is right to publicly shame them by releasing their names. Surely it&amp;#39;d pressure them to release me, but if a lot of people think it&amp;#39;s wrong to do this then it might backfire. They are asking me to take care of them for their retirement, and in no way i will do it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1oh9c6", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1oh9c6/", "num_reports": null, "stickied": false, "created": 1459745484.0, "author_flair_text": null, "created_utc": 1459716684.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1nymck", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Acrophobe", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4d5i8m", "score": 5, "approved_by": null, "downs": 0, "body": "I'm going to suggest something a bit odd, but you mentioned your parents want you to work hard and succeed so maybe it might be worth a shot. I looked at your post history and noticed you are getting a degree in another country, you mentioned your parents provide well for you despite their horrible abuse. It got me thinking about how I would sometimes exploit my knowledge of my parents' weakness to sales and value to get something I needed. So here's my crazy possibly impossible idea, can you manipulate your parents into getting your green card extended to get a better degree? Or ask them to extend it for an internship or something that you can do to exploit their twisted want for you to work harder? I realize it'd be challenging but if you could get them to agree you could buy time in helping you get a backup plan. Or you could use it as an excuse for them to send you the stuff you need to apply for a different green card. You mentioned they'd come after you if you said you were going to cut them off and that they had the stuff you needed to apply for citizenship/green card. Another possibility is to tell them you need that information to apply to a very respectable and important job or internship. I don't know how aware your parents would be of the possibility of you lying, or if they would send the papers. But I figured I'd mention it. \n\nAs for the abuse thing, you definitely do have a right to be angry at them, they abused and raped you. Your sister was encouraging/cheering them on for it. Your feelings are natural and justified. I don't know if my above idea could work but I figured if they had the money for you to study abroad maybe they had enough to extend it for a better degree. I hope you find a way to not go back, have you talked to immigration about things you could do? Because you mentioned you would rather commit suicide than go back. \n\nI don't know what country you currently are in but you should check into their naturalization laws to becoming a citizen. Definitely check immigration services and see if you can get help, a therapist at a college won't know how to help and you're going to have to actively look for that information elsewhere. You might also want to look into immigration lawyers if they do a free consultation. I wish you luck, you are in such a shitty situation, but I feel like there should be someone who can help you. Don't give up, I know you don't want to go back no matter what and I don't blame you, but don't resign to it. You need to look for a way out of returning even if it's only temporary, you have every right to be hurting, but sadly you need to try to save yourself. Because no one else can do that for you now. You deserve happiness and freedom.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m going to suggest something a bit odd, but you mentioned your parents want you to work hard and succeed so maybe it might be worth a shot. I looked at your post history and noticed you are getting a degree in another country, you mentioned your parents provide well for you despite their horrible abuse. It got me thinking about how I would sometimes exploit my knowledge of my parents&amp;#39; weakness to sales and value to get something I needed. So here&amp;#39;s my crazy possibly impossible idea, can you manipulate your parents into getting your green card extended to get a better degree? Or ask them to extend it for an internship or something that you can do to exploit their twisted want for you to work harder? I realize it&amp;#39;d be challenging but if you could get them to agree you could buy time in helping you get a backup plan. Or you could use it as an excuse for them to send you the stuff you need to apply for a different green card. You mentioned they&amp;#39;d come after you if you said you were going to cut them off and that they had the stuff you needed to apply for citizenship/green card. Another possibility is to tell them you need that information to apply to a very respectable and important job or internship. I don&amp;#39;t know how aware your parents would be of the possibility of you lying, or if they would send the papers. But I figured I&amp;#39;d mention it. &lt;/p&gt;\n\n&lt;p&gt;As for the abuse thing, you definitely do have a right to be angry at them, they abused and raped you. Your sister was encouraging/cheering them on for it. Your feelings are natural and justified. I don&amp;#39;t know if my above idea could work but I figured if they had the money for you to study abroad maybe they had enough to extend it for a better degree. I hope you find a way to not go back, have you talked to immigration about things you could do? Because you mentioned you would rather commit suicide than go back. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what country you currently are in but you should check into their naturalization laws to becoming a citizen. Definitely check immigration services and see if you can get help, a therapist at a college won&amp;#39;t know how to help and you&amp;#39;re going to have to actively look for that information elsewhere. You might also want to look into immigration lawyers if they do a free consultation. I wish you luck, you are in such a shitty situation, but I feel like there should be someone who can help you. Don&amp;#39;t give up, I know you don&amp;#39;t want to go back no matter what and I don&amp;#39;t blame you, but don&amp;#39;t resign to it. You need to look for a way out of returning even if it&amp;#39;s only temporary, you have every right to be hurting, but sadly you need to try to save yourself. Because no one else can do that for you now. You deserve happiness and freedom.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1nymck", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1nymck/", "num_reports": null, "stickied": false, "created": 1459710054.0, "author_flair_text": null, "created_utc": 1459681254.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 7, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4d5i8m", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d1okneu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Tooty_frooty", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1oikjh", "score": 2, "approved_by": null, "downs": 0, "body": "That's a great idea. I really hope that within the time you have in Canada your application can be processed. It's really positive that you're there and safe, guaranteed until 2018. Keep on keeping on and never be afraid to ask for help. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a great idea. I really hope that within the time you have in Canada your application can be processed. It&amp;#39;s really positive that you&amp;#39;re there and safe, guaranteed until 2018. Keep on keeping on and never be afraid to ask for help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1okneu", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1okneu/", "num_reports": null, "stickied": false, "created": 1459750802.0, "author_flair_text": null, "created_utc": 1459722002.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1oikjh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LeSolari", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1ohqnf", "score": 1, "approved_by": null, "downs": 0, "body": "i'm in Canada right now as an international student until 2018. I'll ask my psychiatrist to write a letter to explain my situation for my permanent residence application", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i&amp;#39;m in Canada right now as an international student until 2018. I&amp;#39;ll ask my psychiatrist to write a letter to explain my situation for my permanent residence application&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1oikjh", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1oikjh/", "num_reports": null, "stickied": false, "created": 1459747584.0, "author_flair_text": null, "created_utc": 1459718784.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1ohqnf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Tooty_frooty", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1ohdf2", "score": 2, "approved_by": null, "downs": 0, "body": "If Canada is safe then consider it. Where would you have to stay in the meantime? If you get to stay in Canada then at least you'll be safe. Can you go back to the psychiatrist to get some more help? Sometimes medical professionals can help you with the practical side of things too. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If Canada is safe then consider it. Where would you have to stay in the meantime? If you get to stay in Canada then at least you&amp;#39;ll be safe. Can you go back to the psychiatrist to get some more help? Sometimes medical professionals can help you with the practical side of things too. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1ohqnf", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1ohqnf/", "num_reports": null, "stickied": false, "created": 1459746254.0, "author_flair_text": null, "created_utc": 1459717454.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1ohdf2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "LeSolari", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d1nxgfy", "score": 1, "approved_by": null, "downs": 0, "body": "i did talk to a refugee consultation and a psychiatrist. Apparently Canada would help me, but there is a ridiculous processing time frame.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i did talk to a refugee consultation and a psychiatrist. Apparently Canada would help me, but there is a ridiculous processing time frame.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1ohdf2", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1ohdf2/", "num_reports": null, "stickied": false, "created": 1459745659.0, "author_flair_text": null, "created_utc": 1459716859.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d1nxgfy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Tooty_frooty", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4d5i8m", "score": 7, "approved_by": null, "downs": 0, "body": "I definitely wouldn't say you are a spoiled, sensitive kid. You have every reason to be upset with your family.\nIf it makes it easier for you to accept, you don't have to commit yourself to 'hating' your parents. You can be angry with them, upset, disappointed, feel cheated out of your childhood- you don't have to commit to hating them.\nHave you spoken to anybody about this?\nCan you seek help from the country you are in now? A lot of countries will help you if you say it isn't safe for you to return home. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I definitely wouldn&amp;#39;t say you are a spoiled, sensitive kid. You have every reason to be upset with your family.\nIf it makes it easier for you to accept, you don&amp;#39;t have to commit yourself to &amp;#39;hating&amp;#39; your parents. You can be angry with them, upset, disappointed, feel cheated out of your childhood- you don&amp;#39;t have to commit to hating them.\nHave you spoken to anybody about this?\nCan you seek help from the country you are in now? A lot of countries will help you if you say it isn&amp;#39;t safe for you to return home. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d1nxgfy", "score_hidden": false, "permalink": "/r/ptsd/comments/4d5i8m/am_i_right_to_hate_my_parents_tw/d1nxgfy/", "num_reports": null, "stickied": false, "created": 1459704932.0, "author_flair_text": null, "created_utc": 1459676132.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]