[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2t5sa", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SRSDiscussion", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello dear Dildz,&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been having a couple of questions in my head for a while and I&amp;#39;d like to ask what you think. I&amp;#39;m pretty ignorant on how to view this subject with a feminist/SJ eye. Here we go :&lt;/p&gt;\n\n&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;[I want you to change my mind or tell me why you have a similar opinion] What do you think of couples with (legal) a high age difference? Here&amp;#39;s I&amp;#39;m specifically talking about heterosexual couples (gay couples and queer couples will follow in question 4). I get weirded out when on TV or in reality, I see such couples (say ages 19, 55). Is there something wrong with me or is it really kind of weird? It&amp;#39;s hard for me to explain what I find weird about it, maybe it&amp;#39;s because in some cases it almost looks like &lt;a href=\"/tw%20pedophilia\"&gt;TW&lt;/a&gt; even though the younger person is at age of consent. Maybe it&amp;#39;s weird because both people have so little in common in term of cultural references or in terms of life experience? I don&amp;#39;t know.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It does seem to me that most of these couples happen to be with a younger woman and an older man. Why is that? Why is it so unusual to see a younger man with an older woman? To me, it&amp;#39;s kind of obvious that movies, media, TV, etc. feeds this culture of &amp;quot;for a man to be successful, the younger his girlfriend is, the better&amp;quot;. I believe that kind of thinking has been around since... forever.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;What would be an ideal solution/outcome to the inequality of the last question if we want to restore &amp;quot;balance&amp;quot;? Should society stop feeding the &amp;quot;younger girlfriend&amp;quot; culture to men? Or should we encourage couples with younger-man/older-woman more often? Maybe a combination of both? Keep in mind what you&amp;#39;ve already answered in question 1.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;What about gay or queer couples with high age difference? Considering we&amp;#39;re seeing more gay couples on media than before and that queer couples have little to no media coverage, most of the time these couples are portrayed as relatively the same age. Would it still be weird to have a couple (say 19, 55) of two women or two queer folks?&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;Feel free to correct me if I said anything wrong. Thank you fellow Dildz!&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello dear Dildz,\n\nI've been having a couple of questions in my head for a while and I'd like to ask what you think. I'm pretty ignorant on how to view this subject with a feminist/SJ eye. Here we go :\n\n1. [I want you to change my mind or tell me why you have a similar opinion] What do you think of couples with (legal) a high age difference? Here's I'm specifically talking about heterosexual couples (gay couples and queer couples will follow in question 4). I get weirded out when on TV or in reality, I see such couples (say ages 19, 55). Is there something wrong with me or is it really kind of weird? It's hard for me to explain what I find weird about it, maybe it's because in some cases it almost looks like [TW](/tw pedophilia) even though the younger person is at age of consent. Maybe it's weird because both people have so little in common in term of cultural references or in terms of life experience? I don't know.\n\n2. It does seem to me that most of these couples happen to be with a younger woman and an older man. Why is that? Why is it so unusual to see a younger man with an older woman? To me, it's kind of obvious that movies, media, TV, etc. feeds this culture of \"for a man to be successful, the younger his girlfriend is, the better\". I believe that kind of thinking has been around since... forever.\n\n3. What would be an ideal solution/outcome to the inequality of the last question if we want to restore \"balance\"? Should society stop feeding the \"younger girlfriend\" culture to men? Or should we encourage couples with younger-man/older-woman more often? Maybe a combination of both? Keep in mind what you've already answered in question 1.\n\n4. What about gay or queer couples with high age difference? Considering we're seeing more gay couples on media than before and that queer couples have little to no media coverage, most of the time these couples are portrayed as relatively the same age. Would it still be weird to have a couple (say 19, 55) of two women or two queer folks?\n\nFeel free to correct me if I said anything wrong. Thank you fellow Dildz!", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4r2hkm", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "doyouknowBRD", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 5, "approved_by": null, "over_18": false, "domain": "self.SRSDiscussion", "hidden": false, "num_comments": 17, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 14120, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_4r2hkm", "spoiler": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1467589406.0, "url": "https://www.reddit.com/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/", "author_flair_text": null, "quarantine": false, "title": "Couples with high age difference", "created_utc": 1467560606.0, "subreddit_name_prefixed": "r/SRSDiscussion", "distinguished": null, "media": null, "upvote_ratio": 0.65, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 5}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 13, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4xybod", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "doyouknowBRD", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xxvpa", "score": 2, "approved_by": null, "downs": 0, "body": "This is a well-written response. Thank you. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is a well-written response. Thank you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xybod", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4xybod/", "num_reports": null, "stickied": false, "created": 1467602654.0, "author_flair_text": null, "created_utc": 1467573854.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4xxvpa", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "IAmASolipsist", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 13, "approved_by": null, "downs": 0, "body": "1.  It really depends on the people.  I don't think there's anything \"innately\" wrong with it if everyone is of consenting age, but it can lead to problems of power imbalance.  If you're dating someone as old as your parents then you'll have a tendency to treat them like an \"adult\" and let them make more decisions for you and take what they say more seriously than a peer relationship.  I think this problems lessens as both parties age (a 35 year old dating someone 60 will likely have found more of their own sense of self and be much further away from the mentality of looking up to adults.)  I guess I'd worry a lot more if everyone someone was looking to date was younger than them, if a 50 year old is only ever considering dating someone in their 20's then they probably aren't looking for a good match as much as for something more superficial like youthful attractiveness or naivety.  I wouldn't ever seek out a relationship with someone of a large age difference, but if it happens and there doesn't appear to be any power imbalance issues then I wouldn't avoid a relationship just due to age.\n\n2.  The younger woman/older man dynamic is a complex subject.  Some of it has to do with men, especially older men, valuing virginal aspects a lot including naivety and less sexual experience.  Some has to do with younger people often being more attractive in our culture (smoother and tighter skin, more energy from less medical problems, and just generally idealized.)  I'm sure some comes from men wanting to relive their younger years by proxy.  On the other side I think older men can provide some more perceived stability, I've heard a lot of women mention young men are often very immature and while that is likely the case for most young people I haven't found it to be much different in older men seeking younger women.  I think part of it can be someone you'd think of as a mentor (and even for young women that image in your head is still an older man, though note that many young boys do fantasize about teachers who are women) and getting the affection and praise from someone you think of as a \"better\" likely feels good.  I think often a natural desire to be close to someone you respect can turn into this when that person you respect has a sexual or romantic desire for you (in either direction really, though the stereotype is often of older men using the idolization of themselves for sexual gain.)\n\n3.  I'm honestly not sure if there's a good way to fix this problem.  Encouraging age imbalanced relationships in the other direction isn't really going to help anything.  Encouraging older women to be in leading roles more in media could definitely help, but I'm just as uncomfortable using them as a prop for sexual fantasies as I am with younger women.  I think the best way is to lead your dating life in a more altruistic way to set an example and encourage not having needlessly superficial dating criteria like an unrealistically lower age and whatnot would help.  I don't think shaming the \"younger girlfriend\" culture will work as you'll be attacking those who have good relationships alongside those who don't and will easily become something to point out as an ignorant attack...I think you also run the danger of by shaming the relationship regardless for just that fact that you are taking something away from the agency the younger girlfriend has in the decision making process of dating.\n\n4.  I don't think it would be any more weird to have age imbalances among gay or queer couples or really anyone.  I do think that oftentimes a nice aspect of same sex relationships is more parity between the couple.  They have the same advantages and disadvantages of their gender and less \"otherism\" tendencies between each other (I kind of doubt gay men write about their spouses the same way straight men write about the weird thing their spouses do in that they wouldn't as frequently stereotype the entire gender in a dehumanizing way.)\n\nI think relationships are a pretty complex thing and a good policy is to be fairly hands off if they are consenting adults and there isn't obvious abuse.  People are weird in general and if everyone involved is happy I don't feel a strong need to judge, I do recommend against specifically looking for age imbalances, but I wouldn't attack any couple I know based on that as I wouldn't know their relationship well enough to judge if it's a bad or good one.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;It really depends on the people.  I don&amp;#39;t think there&amp;#39;s anything &amp;quot;innately&amp;quot; wrong with it if everyone is of consenting age, but it can lead to problems of power imbalance.  If you&amp;#39;re dating someone as old as your parents then you&amp;#39;ll have a tendency to treat them like an &amp;quot;adult&amp;quot; and let them make more decisions for you and take what they say more seriously than a peer relationship.  I think this problems lessens as both parties age (a 35 year old dating someone 60 will likely have found more of their own sense of self and be much further away from the mentality of looking up to adults.)  I guess I&amp;#39;d worry a lot more if everyone someone was looking to date was younger than them, if a 50 year old is only ever considering dating someone in their 20&amp;#39;s then they probably aren&amp;#39;t looking for a good match as much as for something more superficial like youthful attractiveness or naivety.  I wouldn&amp;#39;t ever seek out a relationship with someone of a large age difference, but if it happens and there doesn&amp;#39;t appear to be any power imbalance issues then I wouldn&amp;#39;t avoid a relationship just due to age.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The younger woman/older man dynamic is a complex subject.  Some of it has to do with men, especially older men, valuing virginal aspects a lot including naivety and less sexual experience.  Some has to do with younger people often being more attractive in our culture (smoother and tighter skin, more energy from less medical problems, and just generally idealized.)  I&amp;#39;m sure some comes from men wanting to relive their younger years by proxy.  On the other side I think older men can provide some more perceived stability, I&amp;#39;ve heard a lot of women mention young men are often very immature and while that is likely the case for most young people I haven&amp;#39;t found it to be much different in older men seeking younger women.  I think part of it can be someone you&amp;#39;d think of as a mentor (and even for young women that image in your head is still an older man, though note that many young boys do fantasize about teachers who are women) and getting the affection and praise from someone you think of as a &amp;quot;better&amp;quot; likely feels good.  I think often a natural desire to be close to someone you respect can turn into this when that person you respect has a sexual or romantic desire for you (in either direction really, though the stereotype is often of older men using the idolization of themselves for sexual gain.)&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I&amp;#39;m honestly not sure if there&amp;#39;s a good way to fix this problem.  Encouraging age imbalanced relationships in the other direction isn&amp;#39;t really going to help anything.  Encouraging older women to be in leading roles more in media could definitely help, but I&amp;#39;m just as uncomfortable using them as a prop for sexual fantasies as I am with younger women.  I think the best way is to lead your dating life in a more altruistic way to set an example and encourage not having needlessly superficial dating criteria like an unrealistically lower age and whatnot would help.  I don&amp;#39;t think shaming the &amp;quot;younger girlfriend&amp;quot; culture will work as you&amp;#39;ll be attacking those who have good relationships alongside those who don&amp;#39;t and will easily become something to point out as an ignorant attack...I think you also run the danger of by shaming the relationship regardless for just that fact that you are taking something away from the agency the younger girlfriend has in the decision making process of dating.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I don&amp;#39;t think it would be any more weird to have age imbalances among gay or queer couples or really anyone.  I do think that oftentimes a nice aspect of same sex relationships is more parity between the couple.  They have the same advantages and disadvantages of their gender and less &amp;quot;otherism&amp;quot; tendencies between each other (I kind of doubt gay men write about their spouses the same way straight men write about the weird thing their spouses do in that they wouldn&amp;#39;t as frequently stereotype the entire gender in a dehumanizing way.)&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n\n&lt;p&gt;I think relationships are a pretty complex thing and a good policy is to be fairly hands off if they are consenting adults and there isn&amp;#39;t obvious abuse.  People are weird in general and if everyone involved is happy I don&amp;#39;t feel a strong need to judge, I do recommend against specifically looking for age imbalances, but I wouldn&amp;#39;t attack any couple I know based on that as I wouldn&amp;#39;t know their relationship well enough to judge if it&amp;#39;s a bad or good one.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xxvpa", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4xxvpa/", "num_reports": null, "stickied": false, "created": 1467601930.0, "author_flair_text": null, "created_utc": 1467573130.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 5, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4y2t9b", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "anace", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xy4s5", "score": 3, "approved_by": null, "downs": 0, "body": "oh ok. The way it was written implied to me that they were exclusive, i.e. two non-queer women or two non-women queer people, which would only make sense if lesbians were not considered queer.\n\nI tried just now coming up with an unambiguous alternative, but the more I look at it, the more it seems like the misreading was all on me.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oh ok. The way it was written implied to me that they were exclusive, i.e. two non-queer women or two non-women queer people, which would only make sense if lesbians were not considered queer.&lt;/p&gt;\n\n&lt;p&gt;I tried just now coming up with an unambiguous alternative, but the more I look at it, the more it seems like the misreading was all on me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4y2t9b", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4y2t9b/", "num_reports": null, "stickied": false, "created": 1467609841.0, "author_flair_text": null, "created_utc": 1467581041.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4xy4s5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "doyouknowBRD", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xxwe1", "score": 1, "approved_by": null, "downs": 0, "body": "I know, I wasn't referring to men; I gave two examples and I left out men.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know, I wasn&amp;#39;t referring to men; I gave two examples and I left out men.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xy4s5", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4xy4s5/", "num_reports": null, "stickied": false, "created": 1467602350.0, "author_flair_text": null, "created_utc": 1467573550.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4xxwe1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "anace", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 5, "approved_by": null, "downs": 0, "body": "&gt;two women or two queer folks?\n\n\"queer\", in its modern usage, refers to all LGBT people, not just men. The reason for it is because \"LGBT\" leaves out a ton of identities. Instead of adding more and more letters to the acronym, we just say 'queer' instead.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;two women or two queer folks?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;&amp;quot;queer&amp;quot;, in its modern usage, refers to all LGBT people, not just men. The reason for it is because &amp;quot;LGBT&amp;quot; leaves out a ton of identities. Instead of adding more and more letters to the acronym, we just say &amp;#39;queer&amp;#39; instead.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xxwe1", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4xxwe1/", "num_reports": null, "stickied": false, "created": 1467601962.0, "author_flair_text": null, "created_utc": 1467573162.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 7, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4xrx3t", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "doyouknowBRD", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xrbqi", "score": 2, "approved_by": null, "downs": 0, "body": "Wow thanks for your answer. It makes a lot of sense. I don't know why I didn't think of the power imbalance argument.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow thanks for your answer. It makes a lot of sense. I don&amp;#39;t know why I didn&amp;#39;t think of the power imbalance argument.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xrx3t", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4xrx3t/", "num_reports": null, "stickied": false, "created": 1467591883.0, "author_flair_text": null, "created_utc": 1467563083.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4xrbqi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "creepris", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 7, "approved_by": null, "downs": 0, "body": "large age differences are more likely than not to end terribly, due to the fact of a natural power imbalance. ignoring gender, (although I'll get to older guy/younger lady in a sec) the older person just has more life experience and the younger person often doesn't. they will probably just take the older person's word on everything and older person can easily abuse younger person's naivete. sure, some age differences do work out but you gotta think why someone who is 30/40/50 has so much in common with someone who is 18-23. often it's lack of maturity and that no one their own age would tolerate their bs in a relationship.\n\nnow, the reason we see older guy+younger lady so often is bcus society doesnt like older women as their age makes them \"less desirable\". only men are allowed to be old but women are not. take a look at Hollywood and the trends of casting older leading men with much younger leading ladies. in relationships some men might have the fantasy of taking a woman's virginity as well so that could play into it.\n\npersonally I am not a fan of large age gaps as I've been groomed by older guys online when i was 18/19. I was naive and uneducated about power imbalances. I think the patriarchy is just pushing through only valuing women for their beauty and we will all continue to fall victim to it until it's abolished :/\n\nas for lgbtqa couples, the same applies but I feel that it's harder for younger queer people to find a partner their own age cause dating while queer involves bars, hookup apps and being online, dating methods which arent always savory. so they gravitate to older folks and well, the same can and will happen. :(\n\nI hope I wasn't too rambly!\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;large age differences are more likely than not to end terribly, due to the fact of a natural power imbalance. ignoring gender, (although I&amp;#39;ll get to older guy/younger lady in a sec) the older person just has more life experience and the younger person often doesn&amp;#39;t. they will probably just take the older person&amp;#39;s word on everything and older person can easily abuse younger person&amp;#39;s naivete. sure, some age differences do work out but you gotta think why someone who is 30/40/50 has so much in common with someone who is 18-23. often it&amp;#39;s lack of maturity and that no one their own age would tolerate their bs in a relationship.&lt;/p&gt;\n\n&lt;p&gt;now, the reason we see older guy+younger lady so often is bcus society doesnt like older women as their age makes them &amp;quot;less desirable&amp;quot;. only men are allowed to be old but women are not. take a look at Hollywood and the trends of casting older leading men with much younger leading ladies. in relationships some men might have the fantasy of taking a woman&amp;#39;s virginity as well so that could play into it.&lt;/p&gt;\n\n&lt;p&gt;personally I am not a fan of large age gaps as I&amp;#39;ve been groomed by older guys online when i was 18/19. I was naive and uneducated about power imbalances. I think the patriarchy is just pushing through only valuing women for their beauty and we will all continue to fall victim to it until it&amp;#39;s abolished :/&lt;/p&gt;\n\n&lt;p&gt;as for lgbtqa couples, the same applies but I feel that it&amp;#39;s harder for younger queer people to find a partner their own age cause dating while queer involves bars, hookup apps and being online, dating methods which arent always savory. so they gravitate to older folks and well, the same can and will happen. :(&lt;/p&gt;\n\n&lt;p&gt;I hope I wasn&amp;#39;t too rambly!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xrbqi", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4xrbqi/", "num_reports": null, "stickied": false, "created": 1467590845.0, "author_flair_text": null, "created_utc": 1467562045.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 7, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4y235x", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "doyouknowBRD", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4y18bv", "score": 2, "approved_by": null, "downs": 0, "body": "Thank you for your response. I'm sorry for bringing up pedophilia. I'm aware it's different (and it's also why I said it reminded of it, not that it was), I was trying to find out to what was weird about the whole situation. I probably shouldn't have talked about, I'm sorry.\n\nI agree with your point of not jumping to conclusion too fast.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your response. I&amp;#39;m sorry for bringing up pedophilia. I&amp;#39;m aware it&amp;#39;s different (and it&amp;#39;s also why I said it reminded of it, not that it was), I was trying to find out to what was weird about the whole situation. I probably shouldn&amp;#39;t have talked about, I&amp;#39;m sorry.&lt;/p&gt;\n\n&lt;p&gt;I agree with your point of not jumping to conclusion too fast.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4y235x", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4y235x/", "num_reports": null, "stickied": false, "created": 1467608626.0, "author_flair_text": null, "created_utc": 1467579826.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d5qqlx0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "sibeliushelp", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d5q5ty3", "score": 2, "approved_by": null, "downs": 0, "body": "Nice projection creep.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Nice projection creep.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d5qqlx0", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d5qqlx0/", "num_reports": null, "stickied": false, "created": 1469520271.0, "author_flair_text": null, "created_utc": 1469491471.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d5q5ty3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d5pr6zq", "score": 1, "approved_by": null, "downs": 0, "body": "Yeah, I am way beyond caring about SRS's weird and creepy obsession with what 18 year olds should do with their genitals.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, I am way beyond caring about SRS&amp;#39;s weird and creepy obsession with what 18 year olds should do with their genitals.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "SRSDiscussion", "name": "t1_d5q5ty3", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d5q5ty3/", "num_reports": null, "stickied": false, "created": 1469493658.0, "author_flair_text": null, "created_utc": 1469464858.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d5pr6zq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "sibeliushelp", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4y18bv", "score": 2, "approved_by": null, "downs": 0, "body": "No one is calling an 18-23 year old dating someone older \"pedophilia\" or questioning whether it should be allowed.\n\nJust because something is legally permissible does't mean people can't critique it.\n\nRE \"ageism\" - I'm amazed how concerned people suddenly become with young women's \"agency\" when it comes to dating old men! Because let's be honest, this is gendered.\n\n\n\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No one is calling an 18-23 year old dating someone older &amp;quot;pedophilia&amp;quot; or questioning whether it should be allowed.&lt;/p&gt;\n\n&lt;p&gt;Just because something is legally permissible does&amp;#39;t mean people can&amp;#39;t critique it.&lt;/p&gt;\n\n&lt;p&gt;RE &amp;quot;ageism&amp;quot; - I&amp;#39;m amazed how concerned people suddenly become with young women&amp;#39;s &amp;quot;agency&amp;quot; when it comes to dating old men! Because let&amp;#39;s be honest, this is gendered.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d5pr6zq", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d5pr6zq/", "num_reports": null, "stickied": false, "created": 1469464585.0, "author_flair_text": null, "created_utc": 1469435785.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4y18bv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 7, "approved_by": null, "downs": 0, "body": "Honestly, we do have to place the \"cut off\" somewhere as it were. And most societies have decided this is when a person turns 18 years old. \n\nAdults are allowed to date other adults. Yes, there can be power dynamics specific to large age difference but there are other power dynamics too in relationships. \n\nAlso it's easy to end up being really ageist here. We should be careful not to completely ignore the agency of the younger person. If someone is 18-24 and dating a 40-50 person we shouldn't immediately jump to conclusions about how the younger person is being manipulated in some way.\n\nAlso, I dread to do this in an SRS subreddit but... pedophilia is defined as an attraction to prepubescent children. An 18-23 year old is definitely not a child let alone a prepubescent one, and calling it (large age difference relationships) pedophilia is not doing anyone any good.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Honestly, we do have to place the &amp;quot;cut off&amp;quot; somewhere as it were. And most societies have decided this is when a person turns 18 years old. &lt;/p&gt;\n\n&lt;p&gt;Adults are allowed to date other adults. Yes, there can be power dynamics specific to large age difference but there are other power dynamics too in relationships. &lt;/p&gt;\n\n&lt;p&gt;Also it&amp;#39;s easy to end up being really ageist here. We should be careful not to completely ignore the agency of the younger person. If someone is 18-24 and dating a 40-50 person we shouldn&amp;#39;t immediately jump to conclusions about how the younger person is being manipulated in some way.&lt;/p&gt;\n\n&lt;p&gt;Also, I dread to do this in an SRS subreddit but... pedophilia is defined as an attraction to prepubescent children. An 18-23 year old is definitely not a child let alone a prepubescent one, and calling it (large age difference relationships) pedophilia is not doing anyone any good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "SRSDiscussion", "name": "t1_d4y18bv", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4y18bv/", "num_reports": null, "stickied": false, "created": 1467607252.0, "author_flair_text": null, "created_utc": 1467578452.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4ycjki", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "PrettyIceCube", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 2, "approved_by": null, "downs": 0, "body": "1. Age gaps in relationships are definitely a cause for concern.  There is a massive experience gap between a 20 year old and a 40 year old which will put the 40 year old in a position of power.  While the relationship could technically work, I think it's just best to avoid them completely because of the risks attached.  \n#\nYou also need to question the reasons why a 40 year old man would want to date someone that is barely an adult instead of someone their own age that they'll have a huge amount more in common with.  The reasons they have for wanting to date a younger women will be things like: reducing women to their bodies and how sexually attractive the body is, wanting an inexperienced person because they'll be easier to take advantage of.  \n\n2. Women in particular have a massive amount of their importance attached to their physical looks.  Men have a massive preference for younger women, often finding women close to or below the age of adulthood to be the most attractive, even when they themselves are in their 50s or 60s.  Because of this women will go to great lengths to make themselves look younger in an effort to be attractive to men.  Men do not face these pressures and older men are easily seen as being attractive by women.  \n\n3. Women need to be treated as people instead of as sex objects.  When women are treated like people then their other attributes will be valued more highly and they won't be reduced to how sexually attractive they are.  This will largely remove the desires men have for pursuing young women.  \n\n4. The older man - younger women trope doesn't exist for non-straight pairings, so the couples are chosen to be around the same age as this is what is natural.  A non-straight relationship with a large age gap would have the same problems that a same sex couple with a large age gap has, so would still be something to avoid.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;Age gaps in relationships are definitely a cause for concern.  There is a massive experience gap between a 20 year old and a 40 year old which will put the 40 year old in a position of power.  While the relationship could technically work, I think it&amp;#39;s just best to avoid them completely because of the risks attached.  &lt;/p&gt;\n\n&lt;p&gt;You also need to question the reasons why a 40 year old man would want to date someone that is barely an adult instead of someone their own age that they&amp;#39;ll have a huge amount more in common with.  The reasons they have for wanting to date a younger women will be things like: reducing women to their bodies and how sexually attractive the body is, wanting an inexperienced person because they&amp;#39;ll be easier to take advantage of.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Women in particular have a massive amount of their importance attached to their physical looks.  Men have a massive preference for younger women, often finding women close to or below the age of adulthood to be the most attractive, even when they themselves are in their 50s or 60s.  Because of this women will go to great lengths to make themselves look younger in an effort to be attractive to men.  Men do not face these pressures and older men are easily seen as being attractive by women.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Women need to be treated as people instead of as sex objects.  When women are treated like people then their other attributes will be valued more highly and they won&amp;#39;t be reduced to how sexually attractive they are.  This will largely remove the desires men have for pursuing young women.  &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;The older man - younger women trope doesn&amp;#39;t exist for non-straight pairings, so the couples are chosen to be around the same age as this is what is natural.  A non-straight relationship with a large age gap would have the same problems that a same sex couple with a large age gap has, so would still be something to avoid.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4ycjki", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4ycjki/", "num_reports": null, "stickied": false, "created": 1467627599.0, "author_flair_text": null, "created_utc": 1467598799.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d51bql7", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Futsuo", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 3, "approved_by": null, "downs": 0, "body": "It is pedophilic and thus wrong. With a large age difference, there is a big power imbalance. To say that it's okay because they're both legally adults is like saying it's okay for me to rape a teenager because it's legal in my country. The law is not the same as what is moral. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It is pedophilic and thus wrong. With a large age difference, there is a big power imbalance. To say that it&amp;#39;s okay because they&amp;#39;re both legally adults is like saying it&amp;#39;s okay for me to rape a teenager because it&amp;#39;s legal in my country. The law is not the same as what is moral. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d51bql7", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d51bql7/", "num_reports": null, "stickied": false, "created": 1467840307.0, "author_flair_text": null, "created_utc": 1467811507.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d51mz8a", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "nicotinized", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 1, "approved_by": null, "downs": 0, "body": "1. I thinks its natural that you find it weird , im not sure why you find it weird but it probally has something to do with you associating it with a daughter and father  relationship when you see a young girl and an older man and that everyone finds weird.\n\n2. I think this has to do with the structures of society. When a older man is with a younger woman he is usually called a sugar daddy so essentially  she provides sexual services for money/gifts and the reason the older man is called that is because as u stated couples  with such an age difference typicly have little in common in terms of cultural references or in terms of life experience so the only other reason why they might be togeher is exchange of service or the woman having daddy issues. In the past women have been thought that they need a man to provide for them and thats why there is probally more young women with older man than the other way around and even if there is women with younger men they are probally ashamed of it and dont want to show it in public.\n\n3. I dont think the reason men have younger girlfriends is because society tells them so , i think it more has to do with them being attracted to a young womans figure. In terms of fixing the inequality i think we are moving in that direction already , as we become more equal in terms of economy and how we are perceived i dont think women will need sugar daddys anymore and i think that women will be allowed to date hot young studs since they dont need a man to provide for them anymore.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;ol&gt;\n&lt;li&gt;&lt;p&gt;I thinks its natural that you find it weird , im not sure why you find it weird but it probally has something to do with you associating it with a daughter and father  relationship when you see a young girl and an older man and that everyone finds weird.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I think this has to do with the structures of society. When a older man is with a younger woman he is usually called a sugar daddy so essentially  she provides sexual services for money/gifts and the reason the older man is called that is because as u stated couples  with such an age difference typicly have little in common in terms of cultural references or in terms of life experience so the only other reason why they might be togeher is exchange of service or the woman having daddy issues. In the past women have been thought that they need a man to provide for them and thats why there is probally more young women with older man than the other way around and even if there is women with younger men they are probally ashamed of it and dont want to show it in public.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;I dont think the reason men have younger girlfriends is because society tells them so , i think it more has to do with them being attracted to a young womans figure. In terms of fixing the inequality i think we are moving in that direction already , as we become more equal in terms of economy and how we are perceived i dont think women will need sugar daddys anymore and i think that women will be allowed to date hot young studs since they dont need a man to provide for them anymore.&lt;/p&gt;&lt;/li&gt;\n&lt;/ol&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d51mz8a", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d51mz8a/", "num_reports": null, "stickied": false, "created": 1467855330.0, "author_flair_text": null, "created_utc": 1467826530.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r2hkm", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4ybhqu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "day-ja-voo", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r2hkm", "score": 1, "approved_by": null, "downs": 0, "body": "I don't think it's fair to assume that an age-gap relationship is based solely on manipulation or financial compensation.\n\nOf course, I'm going by personal anecdotes here, but I was in a relationship with a man old enough to be my father. It didn't work out, but it wasn't abusive or even a sugar daddy-type situation.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think it&amp;#39;s fair to assume that an age-gap relationship is based solely on manipulation or financial compensation.&lt;/p&gt;\n\n&lt;p&gt;Of course, I&amp;#39;m going by personal anecdotes here, but I was in a relationship with a man old enough to be my father. It didn&amp;#39;t work out, but it wasn&amp;#39;t abusive or even a sugar daddy-type situation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4ybhqu", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r2hkm/couples_with_high_age_difference/d4ybhqu/", "num_reports": null, "stickied": false, "created": 1467625522.0, "author_flair_text": null, "created_utc": 1467596722.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]