[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2t5sa", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SRSDiscussion", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Unfortunately for me, I&amp;#39;ve been primarily exposed to SRS and social justice/feminism through the lens of the reddit hivemind. I&amp;#39;ve always been sympathetic to the idea of social justice, equality, correcting systemic injustices, and avoiding discrimination, though I&amp;#39;m undecided on many of the implementation details (which I don&amp;#39;t particularly need explained to me, I&amp;#39;ll do the reading). &lt;/p&gt;\n\n&lt;p&gt;As a privileged person, albeit with a disability, who tries to think about things critically, I have concerns with parts of the social justice movement, particularly about the image they seem to present to many parts of the Internet, and broader society. However, I recognize that this puts me in danger of being a well-intentioned concern troll, or being labeled as a bad actor. I wouldn&amp;#39;t even think about trying to make such an argument on SRS prime, because it&amp;#39;s not the space for it, being a self-described circlejerk space, and intentionally criticism-free, but I&amp;#39;m hoping that there&amp;#39;s some room here in SRSDiscussion to start an actual discussion about the image problems social justice and SRS has on reddit in particular, beyond dismissing enormous swathes of people as irredeemable shitlords who cannot be convinced. I have a little more faith in humanity than that, which I might need to have ground out of me by reality, and think people generally have better intentions than that, or at least want to think of themselves as having better intentions. Perhaps I should read through comments that social justice bloggers receive first.&lt;/p&gt;\n\n&lt;p&gt;So. Does social justice/SRS/feminism have an image problem? If so, what can be done about it?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Unfortunately for me, I've been primarily exposed to SRS and social justice/feminism through the lens of the reddit hivemind. I've always been sympathetic to the idea of social justice, equality, correcting systemic injustices, and avoiding discrimination, though I'm undecided on many of the implementation details (which I don't particularly need explained to me, I'll do the reading). \n\nAs a privileged person, albeit with a disability, who tries to think about things critically, I have concerns with parts of the social justice movement, particularly about the image they seem to present to many parts of the Internet, and broader society. However, I recognize that this puts me in danger of being a well-intentioned concern troll, or being labeled as a bad actor. I wouldn't even think about trying to make such an argument on SRS prime, because it's not the space for it, being a self-described circlejerk space, and intentionally criticism-free, but I'm hoping that there's some room here in SRSDiscussion to start an actual discussion about the image problems social justice and SRS has on reddit in particular, beyond dismissing enormous swathes of people as irredeemable shitlords who cannot be convinced. I have a little more faith in humanity than that, which I might need to have ground out of me by reality, and think people generally have better intentions than that, or at least want to think of themselves as having better intentions. Perhaps I should read through comments that social justice bloggers receive first.\n\nSo. Does social justice/SRS/feminism have an image problem? If so, what can be done about it?", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4r0fsx", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "arbitrariness", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 22, "approved_by": null, "over_18": false, "domain": "self.SRSDiscussion", "hidden": false, "num_comments": 7, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 14120, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_4r0fsx", "spoiler": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1467545467.0, "url": "https://www.reddit.com/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/", "author_flair_text": null, "quarantine": false, "title": "Avoiding Concern Trolling", "created_utc": 1467516667.0, "subreddit_name_prefixed": "r/SRSDiscussion", "distinguished": null, "media": null, "upvote_ratio": 0.88, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 22}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d5241fz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "qnvx", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r0fsx", "score": 3, "approved_by": null, "downs": 0, "body": "Thanks for posting the question I've been thinking about.\n\nI browse SRS a lot, because of the drama and because I agree with pretty much all the agendas they want to advance and issues thwy want to fix. However, I don't necessarily agree with how they portray their message. I know that the point of SRS isn't to convince people or change views, but I still can't help but wonder if the existence of SRS does more harm or good. On one hand it does point out various kinds of discrimination against minorities, but on the other it has become the \"SJW HQ\" where those disagreeing with the inhabitants are mocked and banned, making the people of SRS, and by extensions leftists, appear ignorant. I'm not saying that the \"other side\" is any better (I think they're a bit worse) and I think progressives would be viewed negatively by many people whether SRS existed or not, but I can't help but think if it's amplified by its existence.\n\nThis comment was more about the usefulness of the existance of SRS, but it does have to do with leftist/feminist image problems.", "edited": 1467848540.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks for posting the question I&amp;#39;ve been thinking about.&lt;/p&gt;\n\n&lt;p&gt;I browse SRS a lot, because of the drama and because I agree with pretty much all the agendas they want to advance and issues thwy want to fix. However, I don&amp;#39;t necessarily agree with how they portray their message. I know that the point of SRS isn&amp;#39;t to convince people or change views, but I still can&amp;#39;t help but wonder if the existence of SRS does more harm or good. On one hand it does point out various kinds of discrimination against minorities, but on the other it has become the &amp;quot;SJW HQ&amp;quot; where those disagreeing with the inhabitants are mocked and banned, making the people of SRS, and by extensions leftists, appear ignorant. I&amp;#39;m not saying that the &amp;quot;other side&amp;quot; is any better (I think they&amp;#39;re a bit worse) and I think progressives would be viewed negatively by many people whether SRS existed or not, but I can&amp;#39;t help but think if it&amp;#39;s amplified by its existence.&lt;/p&gt;\n\n&lt;p&gt;This comment was more about the usefulness of the existance of SRS, but it does have to do with leftist/feminist image problems.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d5241fz", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d5241fz/", "num_reports": null, "stickied": false, "created": 1467876985.0, "author_flair_text": null, "created_utc": 1467848185.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4xi18s", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "honeyinyoureyes", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r0fsx", "score": 3, "approved_by": null, "downs": 0, "body": "I agree that social justice has an image problem. A lot of people seem to have the idea that there is a large group of radical \"SJWs\", and it's our job to do something about this. Of course feminists/social justice advocates with actually harmful and radical ideas exist, but I *very rarely* encounter them. Not even on SRS, while reddit seems to think that all of SRS consists of crazy man hating SJWs.\n\nI think the issue is that because so many people make fun of SJWs, a lot of the terms that feminists use have become associated in their head with their idea of evil SJWs. Terms like privilege, patriarchy, rape culture, etc. They don't know what these words actually mean, and only every encounter them in places in which they're made fun of. \"Check your privilege shitlord, I identify as an attack helicopter lol\" - is pretty much the only context in which they see these terms used. So when they encounter anyone talking about privilege, they assume this person is the mythical man hating SJW that people make fun of all the time.\n\nObviously we can't just make up different words. These terms are very useful, and we can't avoid them just because people don't understand what they mean. I think what we can do is to educate people as much as possible on what these terms mean. I personally think feminism should be taught in schools. Unfortunately we're just not at that point, so all we can do in the meantime is create clear resources for people not familiar with feminism. \n\nAnother thing I try to do is when talking to people who are not educated on feminism to avoid words that are too loaded and not necessary for the discussion. When I do need to mention terms people don't understand, I try to explain them: \"privilege, and by that I mean...\". It would be too tiring to do that all the time though, and it shouldn't be necessary in places that are meant for discussion with like-minded people. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that social justice has an image problem. A lot of people seem to have the idea that there is a large group of radical &amp;quot;SJWs&amp;quot;, and it&amp;#39;s our job to do something about this. Of course feminists/social justice advocates with actually harmful and radical ideas exist, but I &lt;em&gt;very rarely&lt;/em&gt; encounter them. Not even on SRS, while reddit seems to think that all of SRS consists of crazy man hating SJWs.&lt;/p&gt;\n\n&lt;p&gt;I think the issue is that because so many people make fun of SJWs, a lot of the terms that feminists use have become associated in their head with their idea of evil SJWs. Terms like privilege, patriarchy, rape culture, etc. They don&amp;#39;t know what these words actually mean, and only every encounter them in places in which they&amp;#39;re made fun of. &amp;quot;Check your privilege shitlord, I identify as an attack helicopter lol&amp;quot; - is pretty much the only context in which they see these terms used. So when they encounter anyone talking about privilege, they assume this person is the mythical man hating SJW that people make fun of all the time.&lt;/p&gt;\n\n&lt;p&gt;Obviously we can&amp;#39;t just make up different words. These terms are very useful, and we can&amp;#39;t avoid them just because people don&amp;#39;t understand what they mean. I think what we can do is to educate people as much as possible on what these terms mean. I personally think feminism should be taught in schools. Unfortunately we&amp;#39;re just not at that point, so all we can do in the meantime is create clear resources for people not familiar with feminism. &lt;/p&gt;\n\n&lt;p&gt;Another thing I try to do is when talking to people who are not educated on feminism to avoid words that are too loaded and not necessary for the discussion. When I do need to mention terms people don&amp;#39;t understand, I try to explain them: &amp;quot;privilege, and by that I mean...&amp;quot;. It would be too tiring to do that all the time though, and it shouldn&amp;#39;t be necessary in places that are meant for discussion with like-minded people. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xi18s", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d4xi18s/", "num_reports": null, "stickied": false, "created": 1467564313.0, "author_flair_text": null, "created_utc": 1467535513.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 5, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 32, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 10, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4xouo0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "dlgn13", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xhagn", "score": 10, "approved_by": null, "downs": 0, "body": "It can be easy to pick up on \"we're good, they're bad, now let's be as toxic pointlessly obnoxious as possible and we can feel powerful AND self-righteous.\" There was a user in BoOC spouting kindergarten level nonsense (\"go back to your mommy Nazi pedo groomers for the therapeutic jerk, junior\") who actually got upvoted for a while.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It can be easy to pick up on &amp;quot;we&amp;#39;re good, they&amp;#39;re bad, now let&amp;#39;s be as toxic pointlessly obnoxious as possible and we can feel powerful AND self-righteous.&amp;quot; There was a user in BoOC spouting kindergarten level nonsense (&amp;quot;go back to your mommy Nazi pedo groomers for the therapeutic jerk, junior&amp;quot;) who actually got upvoted for a while.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xouo0", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d4xouo0/", "num_reports": null, "stickied": false, "created": 1467586215.0, "author_flair_text": null, "created_utc": 1467557415.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4xhj6j", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Meshleth", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xhagn", "score": 2, "approved_by": null, "downs": 0, "body": "&gt;  but the incentive structure built around the online social-justice-sphere rewards the assholes for being assholes.\n\nPrimarily because the assholes are not being challenged from within. But this is a problem that all movements must deal with that is seperate from the image presented to the outside world.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but the incentive structure built around the online social-justice-sphere rewards the assholes for being assholes.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Primarily because the assholes are not being challenged from within. But this is a problem that all movements must deal with that is seperate from the image presented to the outside world.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xhj6j", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d4xhj6j/", "num_reports": null, "stickied": false, "created": 1467562361.0, "author_flair_text": null, "created_utc": 1467533561.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4xhagn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "emojiclast", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4xdh5c", "score": 32, "approved_by": null, "downs": 0, "body": "Wishful thinking....and unfortunately very, very untrue. I am someone who has been involved in street-level activism and organization for a decade and a half, and there is not only an image problem...there is a legitimately toxic contingency that tends to be the loudest voice in the room. The worst part is we *know* they are out there and nobody calls their shit out because they are afraid of the very same stigma that OP has voiced, aside from the occasion No True Scotsman. Sure, there are assholes in every movement and every scene, but the incentive structure built around the online social-justice-sphere rewards the assholes for being assholes. \n\n ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wishful thinking....and unfortunately very, very untrue. I am someone who has been involved in street-level activism and organization for a decade and a half, and there is not only an image problem...there is a legitimately toxic contingency that tends to be the loudest voice in the room. The worst part is we &lt;em&gt;know&lt;/em&gt; they are out there and nobody calls their shit out because they are afraid of the very same stigma that OP has voiced, aside from the occasion No True Scotsman. Sure, there are assholes in every movement and every scene, but the incentive structure built around the online social-justice-sphere rewards the assholes for being assholes. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xhagn", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d4xhagn/", "num_reports": null, "stickied": false, "created": 1467561465.0, "author_flair_text": null, "created_utc": 1467532665.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4xdh5c", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Meshleth", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r0fsx", "score": 5, "approved_by": null, "downs": 0, "body": "&gt;Does social justice/SRS/feminism have an image problem?\n\nOnly, really, in terms of those opposed to social justice and those that do not understand any of these topics. While we really shouldnt care about the opinions of those opposed to social justice/the existence of SRS/feminism, in terms of those that are truly uneducated or dont understand, I dont believe that there is a real image problem.\n\nThe image problem that first arises with those that dont understand is that they have been bombarded with anti-social justice memes and thought, so they have to unlearn that.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Does social justice/SRS/feminism have an image problem?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Only, really, in terms of those opposed to social justice and those that do not understand any of these topics. While we really shouldnt care about the opinions of those opposed to social justice/the existence of SRS/feminism, in terms of those that are truly uneducated or dont understand, I dont believe that there is a real image problem.&lt;/p&gt;\n\n&lt;p&gt;The image problem that first arises with those that dont understand is that they have been bombarded with anti-social justice memes and thought, so they have to unlearn that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xdh5c", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d4xdh5c/", "num_reports": null, "stickied": false, "created": 1467550410.0, "author_flair_text": null, "created_utc": 1467521610.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4r0fsx", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4xfwyf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "arbitrariness", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4r0fsx", "score": 2, "approved_by": null, "downs": 0, "body": "Actually, while I'm here, I'd like to ask something slightly different. I think I've figured out the core concept underlying a lot of the social justice movement's thought, what it means to \"understand and agree with\".\n\nAs a member of (privileged class), my perceptions and opinions are biased and skewed in a way that is invisible to me, or that I cannot/will not correct for, warped by the structures of power I'm used to, and the culture I've been raised in. The only way for me to see outside of my bias as one with privilege is to ask those without, the oppressed, who don't have privilege clouding their gaze. (unless they've been influenced by the privileged culture, see internalized misogyny/racism). I think this is called Standpoint theory?\n\nThis concept (that the oppressed have a better perspective to judge what is ultimately just in society) has historical backing in other social justice movements, where the majority has rejected seemingly radical ideas, but accepted them (sometimes begrudgingly) as dialogue shifted, and seemingly radical ideas became normal, because those ideas had merit (or because they were convenient to the privileged in some manner).\n\nDoes this seem like a somewhat accurate summary?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Actually, while I&amp;#39;m here, I&amp;#39;d like to ask something slightly different. I think I&amp;#39;ve figured out the core concept underlying a lot of the social justice movement&amp;#39;s thought, what it means to &amp;quot;understand and agree with&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;As a member of (privileged class), my perceptions and opinions are biased and skewed in a way that is invisible to me, or that I cannot/will not correct for, warped by the structures of power I&amp;#39;m used to, and the culture I&amp;#39;ve been raised in. The only way for me to see outside of my bias as one with privilege is to ask those without, the oppressed, who don&amp;#39;t have privilege clouding their gaze. (unless they&amp;#39;ve been influenced by the privileged culture, see internalized misogyny/racism). I think this is called Standpoint theory?&lt;/p&gt;\n\n&lt;p&gt;This concept (that the oppressed have a better perspective to judge what is ultimately just in society) has historical backing in other social justice movements, where the majority has rejected seemingly radical ideas, but accepted them (sometimes begrudgingly) as dialogue shifted, and seemingly radical ideas became normal, because those ideas had merit (or because they were convenient to the privileged in some manner).&lt;/p&gt;\n\n&lt;p&gt;Does this seem like a somewhat accurate summary?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_d4xfwyf", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/4r0fsx/avoiding_concern_trolling/d4xfwyf/", "num_reports": null, "stickied": false, "created": 1467556832.0, "author_flair_text": null, "created_utc": 1467528032.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]