[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been in major depression for a few months, and if I&amp;#39;m honest, maybe for a few years. I just started seeing a psych in October and I&amp;#39;m on the max dose of nortriptyline and I also take clonazepam. And normally I&amp;#39;m semi-okay. Like, I&amp;#39;m barely about to fracture but I can hold it together.&lt;/p&gt;\n\n&lt;p&gt;My grandma had a stroke a few weeks ago and it&amp;#39;s not looking good. She can&amp;#39;t walk, can barely swallow, and she&amp;#39;s having memory issues. My mom is her primary caretaker but has to fight against three highly narcissistic siblings while the other are just mentally ill (which isn&amp;#39;t their fault whatsoever). She&amp;#39;s been busting ass, and finally standing up for herself, and I am so proud of her. She needs to take care of herself, and I see her blossoming and I want that so badly.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s me that&amp;#39;s crumbling.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been perusing &lt;a href=\"/r/raisedbynarcissists\"&gt;r/raisedbynarcissists&lt;/a&gt; and while some of the things don&amp;#39;t fit, a lot of them do. And I&amp;#39;ve had this epiphany for the last few &lt;del&gt;days&lt;/del&gt; weeks that I&amp;#39;m being emotionally abused. I&amp;#39;m 27, temporarily disabled due to severe depression and chronic daily migraines and fibromyalgia, and I depend on them for food and for shelter. And I am so grateful. But it seems like if I do one tiny thing wrong I get blasted and then threatened by calling the police to kick me out of the house (which legally they can&amp;#39;t do), but my car is in their name, and they make purchases on a few of my credit cards, and God forbid I show any kind of depression because it&amp;#39;s immediately treated as hostility. I&amp;#39;m trying my best but I keep looking to my stockpile of pills (from when I was afraid that I would lose health insurance a few months ago) and wondering if maybe after my grandma gets put into a home if it would make everyone&amp;#39;s life easier. I have plenty of tricyclics that would do the trick.&lt;/p&gt;\n\n&lt;p&gt;I feel so trapped. I can&amp;#39;t breathe. Every time I inhale and exhale it comes out as sobs. I don&amp;#39;t want to get out of bed, either from severe pain or from sheer apathy. It&amp;#39;s so hard to get myself motivated to do anything. My face feels like it weighs twenty pounds. My body feels like sludge. And my heart feels like it&amp;#39;s breaking into two - no, an infinite number of fractures. Humpty Dumpty had a great fall and broke my heart in the midst of it all. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know why I&amp;#39;m writing this. I don&amp;#39;t want to die. But I don&amp;#39;t want to live like this anymore.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've been in major depression for a few months, and if I'm honest, maybe for a few years. I just started seeing a psych in October and I'm on the max dose of nortriptyline and I also take clonazepam. And normally I'm semi-okay. Like, I'm barely about to fracture but I can hold it together.\n\nMy grandma had a stroke a few weeks ago and it's not looking good. She can't walk, can barely swallow, and she's having memory issues. My mom is her primary caretaker but has to fight against three highly narcissistic siblings while the other are just mentally ill (which isn't their fault whatsoever). She's been busting ass, and finally standing up for herself, and I am so proud of her. She needs to take care of herself, and I see her blossoming and I want that so badly.\n\nIt's me that's crumbling.\n\nI've been perusing r/raisedbynarcissists and while some of the things don't fit, a lot of them do. And I've had this epiphany for the last few ~~days~~ weeks that I'm being emotionally abused. I'm 27, temporarily disabled due to severe depression and chronic daily migraines and fibromyalgia, and I depend on them for food and for shelter. And I am so grateful. But it seems like if I do one tiny thing wrong I get blasted and then threatened by calling the police to kick me out of the house (which legally they can't do), but my car is in their name, and they make purchases on a few of my credit cards, and God forbid I show any kind of depression because it's immediately treated as hostility. I'm trying my best but I keep looking to my stockpile of pills (from when I was afraid that I would lose health insurance a few months ago) and wondering if maybe after my grandma gets put into a home if it would make everyone's life easier. I have plenty of tricyclics that would do the trick.\n\nI feel so trapped. I can't breathe. Every time I inhale and exhale it comes out as sobs. I don't want to get out of bed, either from severe pain or from sheer apathy. It's so hard to get myself motivated to do anything. My face feels like it weighs twenty pounds. My body feels like sludge. And my heart feels like it's breaking into two - no, an infinite number of fractures. Humpty Dumpty had a great fall and broke my heart in the midst of it all. \n\nI don't know why I'm writing this. I don't want to die. But I don't want to live like this anymore.", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "5wre3o", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "ouch-my-head-hurts", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 3, "thumbnail": "", "hide_score": false, "edited": 1488335964.0, "link_flair_css_class": null, "author_flair_css_class": "modmsg", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83419, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_5wre3o", "spoiler": false, "permalink": "/r/SuicideWatch/comments/5wre3o/trying_to_fight_suicidal_ideation/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1488353802.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/5wre3o/trying_to_fight_suicidal_ideation/", "author_flair_text": "", "quarantine": false, "title": "Trying to fight suicidal ideation", "created_utc": 1488325002.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5wre3o", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5wre3o", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5wre3o", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "deco996", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "sofar1776", "can_mod_post": false, "send_replies": true, "parent_id": "t1_decn4h2", "score": 1, "approved_by": null, "downs": 0, "body": "My first goal is that you stay with us. I don't think I am being much help, but I am trying. It is hard to realize that our parents are only human. I have been through that already. My Mom is disabled and in her eighties, so I know she has her limits.     \n\nI think its great that you got to  talk to your uncle. That must have been a big help. I really hope you make progress and keep going in that right direction. ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My first goal is that you stay with us. I don&amp;#39;t think I am being much help, but I am trying. It is hard to realize that our parents are only human. I have been through that already. My Mom is disabled and in her eighties, so I know she has her limits.     &lt;/p&gt;\n\n&lt;p&gt;I think its great that you got to  talk to your uncle. That must have been a big help. I really hope you make progress and keep going in that right direction. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_deco996", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/5wre3o/trying_to_fight_suicidal_ideation/deco996/", "num_reports": null, "stickied": false, "created": 1488366294.0, "author_flair_text": "", "created_utc": 1488337494.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "decn4h2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ouch-my-head-hurts", "can_mod_post": false, "send_replies": true, "parent_id": "t1_decltgx", "score": 1, "approved_by": null, "downs": 0, "body": "I know it isn't the answer. That's why I posted in here. I still feel like I'm in this quasi-land of seeing my mom as a nearly-perfect person and yet I look and I see the mask start to fall off and I see what she really is, and it's terrifying and paralyzingly. And it isn't to say that she's a bad person. But there are absolutely certain circumstances in which she doesn't handle things right. \n\nI'm gonna talk to my psych about it. I didn't realize how much it was bothering me until today.\n\nOut of the blue my uncle Alex (who has his master in Psychology weirdly enough) decided to call me, and for someone who avoids the phone, he talked to me for an hour. Listened to me. Gave me feedback. And I think I have a better idea of what's going on with me, and with knowledge comes power, so I'm gonna do my best to keep taking one step after another in the right direction. It won't fix things overnight, but any kind of improvement is better than nothing. ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know it isn&amp;#39;t the answer. That&amp;#39;s why I posted in here. I still feel like I&amp;#39;m in this quasi-land of seeing my mom as a nearly-perfect person and yet I look and I see the mask start to fall off and I see what she really is, and it&amp;#39;s terrifying and paralyzingly. And it isn&amp;#39;t to say that she&amp;#39;s a bad person. But there are absolutely certain circumstances in which she doesn&amp;#39;t handle things right. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gonna talk to my psych about it. I didn&amp;#39;t realize how much it was bothering me until today.&lt;/p&gt;\n\n&lt;p&gt;Out of the blue my uncle Alex (who has his master in Psychology weirdly enough) decided to call me, and for someone who avoids the phone, he talked to me for an hour. Listened to me. Gave me feedback. And I think I have a better idea of what&amp;#39;s going on with me, and with knowledge comes power, so I&amp;#39;m gonna do my best to keep taking one step after another in the right direction. It won&amp;#39;t fix things overnight, but any kind of improvement is better than nothing. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_decn4h2", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/5wre3o/trying_to_fight_suicidal_ideation/decn4h2/", "num_reports": null, "stickied": false, "created": 1488365033.0, "author_flair_text": "", "created_utc": 1488336233.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "decltgx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "sofar1776", "can_mod_post": false, "send_replies": true, "parent_id": "t3_5wre3o", "score": 1, "approved_by": null, "downs": 0, "body": "I am sorry about your grandmother. Its so hard when someone starts to fail that way. It isn't right that you are being emotionally abused at all. But an overdose isn't the answer. Maybe you could talk to your psych about it and find a better way to handle what you are going through. I can't give you a brilliant answer, just ask that you keep trying. ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am sorry about your grandmother. Its so hard when someone starts to fail that way. It isn&amp;#39;t right that you are being emotionally abused at all. But an overdose isn&amp;#39;t the answer. Maybe you could talk to your psych about it and find a better way to handle what you are going through. I can&amp;#39;t give you a brilliant answer, just ask that you keep trying. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_decltgx", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/5wre3o/trying_to_fight_suicidal_ideation/decltgx/", "num_reports": null, "stickied": false, "created": 1488363580.0, "author_flair_text": "", "created_utc": 1488334780.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]