[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I blame my parents. I&amp;#39;m 19, they&amp;#39;re christians and its like hell to me. They are too controlling. They don&amp;#39;t allow me to hang with my friends at night.. Well, I&amp;#39;ve like 2 because they fucked up my social life. Alcohol is a no-no. Can&amp;#39;t go to the city, have some fun. Its caused depressions, anxieties (mainly social), low self-esteem. &lt;/p&gt;\n\n&lt;p&gt;All I do if I&amp;#39;m not at work is to gamble away my money, because I&amp;#39;m too bored of being home all the time. I&amp;#39;m sich of watching videos, play video games etc. And now I have a deep extreme social anxiety, and if I&amp;#39;m lucky to find one at my age I will fuck up straight away. &lt;/p&gt;\n\n&lt;p&gt;I plan to take a flight to another country, walk to a mountain and die of hunger or something. Fuck life, I&amp;#39;m screwed.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I blame my parents. I'm 19, they're christians and its like hell to me. They are too controlling. They don't allow me to hang with my friends at night.. Well, I've like 2 because they fucked up my social life. Alcohol is a no-no. Can't go to the city, have some fun. Its caused depressions, anxieties (mainly social), low self-esteem. \n\nAll I do if I'm not at work is to gamble away my money, because I'm too bored of being home all the time. I'm sich of watching videos, play video games etc. And now I have a deep extreme social anxiety, and if I'm lucky to find one at my age I will fuck up straight away. \n\nI plan to take a flight to another country, walk to a mountain and die of hunger or something. Fuck life, I'm screwed.", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4qpcpp", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "FuckLife97", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 7, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 5, "thumbnail": "", "hide_score": false, "edited": 1467340781.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83420, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_4qpcpp", "spoiler": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1467367708.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/", "author_flair_text": null, "quarantine": false, "title": "My parents have fucked up my life", "created_utc": 1467338908.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 0.77, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 7}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4qpcpp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4qpcpp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4v1r06", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FuckLife97", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4uytau", "score": 2, "approved_by": null, "downs": 0, "body": "Thanks, hope you're doing well. Actually, in February this year I was probably on my lowest depression ever. Then I met this beautiful girl. I only were with her for 5 days at my working place, but still. Of course I fucked up things straight away, but she accepted it. She was like a life savier at that point, I would probably have been dead now if it wasn't for her. She has a boyfriend, but that doesn't matter for me. If she's happy, I'm too. We're still having some contact, she lives an hour away from me. Whenever she's texting me or sending me a snap, I feel alive and then I smile for a week. It's happening rarely now, but still sometimes. All of this gave me hope that there are good people in this world. It boosted my morale, and without her I would have nothing to be happy for at all. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, hope you&amp;#39;re doing well. Actually, in February this year I was probably on my lowest depression ever. Then I met this beautiful girl. I only were with her for 5 days at my working place, but still. Of course I fucked up things straight away, but she accepted it. She was like a life savier at that point, I would probably have been dead now if it wasn&amp;#39;t for her. She has a boyfriend, but that doesn&amp;#39;t matter for me. If she&amp;#39;s happy, I&amp;#39;m too. We&amp;#39;re still having some contact, she lives an hour away from me. Whenever she&amp;#39;s texting me or sending me a snap, I feel alive and then I smile for a week. It&amp;#39;s happening rarely now, but still sometimes. All of this gave me hope that there are good people in this world. It boosted my morale, and without her I would have nothing to be happy for at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_d4v1r06", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/d4v1r06/", "num_reports": null, "stickied": false, "created": 1467383386.0, "author_flair_text": null, "created_utc": 1467354586.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4uytau", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Tipptipphorray", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4qpcpp", "score": 1, "approved_by": null, "downs": 0, "body": "I'm feeling very similarly -- I'm 24 and my parents emotionally and religiously abused me for 21 years. I recently got diagnosed with PTSD and depression because of it. For a long time I thought that the way I was raised would prevent me from talking to anyone or having a life that I enjoyed living. Life is hard for me as I assume life is hard for you as well but, I've found that BECAUSE of the hard life that my parents gave me I am able to see the world in a completely different and unique way. Once I was able to spend a significant amount of time away from my parents, for me I did a lot of travelling through school to get away, my peers really took a liking to me. I thought I was going to fuck up every single relationship I encountered because my parents didn't let me socialize very much. Some of them I fucked up, others I didn't. But I can tell you the biggest problem for me was getting over my own terrible ideas about what everyone thought about me. I can guarantee you, you are not as bad as your mind has tricked you into believing -- Christianity has a way of making you believe the worst things about yourself, even if they aren't true. I don't know if that helps -- I don't want to to tell you what to do, but I do what to give you an immense amount of hope that there are lots of people out there willing and ready to accept you as friend, even with all your perceived faults. ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m feeling very similarly -- I&amp;#39;m 24 and my parents emotionally and religiously abused me for 21 years. I recently got diagnosed with PTSD and depression because of it. For a long time I thought that the way I was raised would prevent me from talking to anyone or having a life that I enjoyed living. Life is hard for me as I assume life is hard for you as well but, I&amp;#39;ve found that BECAUSE of the hard life that my parents gave me I am able to see the world in a completely different and unique way. Once I was able to spend a significant amount of time away from my parents, for me I did a lot of travelling through school to get away, my peers really took a liking to me. I thought I was going to fuck up every single relationship I encountered because my parents didn&amp;#39;t let me socialize very much. Some of them I fucked up, others I didn&amp;#39;t. But I can tell you the biggest problem for me was getting over my own terrible ideas about what everyone thought about me. I can guarantee you, you are not as bad as your mind has tricked you into believing -- Christianity has a way of making you believe the worst things about yourself, even if they aren&amp;#39;t true. I don&amp;#39;t know if that helps -- I don&amp;#39;t want to to tell you what to do, but I do what to give you an immense amount of hope that there are lots of people out there willing and ready to accept you as friend, even with all your perceived faults. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_d4uytau", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/d4uytau/", "num_reports": null, "stickied": false, "created": 1467376712.0, "author_flair_text": "", "created_utc": 1467347912.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4qpcpp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4qpcpp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4uyhal", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FuckLife97", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4uwyp9", "score": 2, "approved_by": null, "downs": 0, "body": "You are right about the alcohol thing, its not like I'm dying to try it, it's just the socialize and create friends etc I want to get out of it. Being home on my computer won't solve anything. \n\nDon't really feels for any hobbies at the moment. I used to play football before, but I did quit a few years ago. I regret I did quit, because I was doing good and I was talented. The pressure did get to me when I got scouts from other countries watching me. I gave my chance away and I'm not proud of it. I just can't stand people judge me, fuck them.\n\nI will be moving out in some years if I'm still alive then. I doubt I will move to another country, just because I don't want to speak a foreign language. It will just cause one more anxiety when I see other people.\n\nIn a year time I will have my \"job-exam\". I'm not educated yet, but I'm still working full time. I will loose my job if I fail of course, and yeah I believe I have 10% chance of succeed. If it would have been a writing test, I would give myself 80% at the moment. But with my social anxiety I will fuck it up with two sensors judging my abilities as it is a speaking exam, and I have to explain them all the processes etc. Would not go well at all. I've been depressed just thinking about that day since I got the job.\n\nIf I fail that exam, I will go through and do it as there is no future for me if I fail.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are right about the alcohol thing, its not like I&amp;#39;m dying to try it, it&amp;#39;s just the socialize and create friends etc I want to get out of it. Being home on my computer won&amp;#39;t solve anything. &lt;/p&gt;\n\n&lt;p&gt;Don&amp;#39;t really feels for any hobbies at the moment. I used to play football before, but I did quit a few years ago. I regret I did quit, because I was doing good and I was talented. The pressure did get to me when I got scouts from other countries watching me. I gave my chance away and I&amp;#39;m not proud of it. I just can&amp;#39;t stand people judge me, fuck them.&lt;/p&gt;\n\n&lt;p&gt;I will be moving out in some years if I&amp;#39;m still alive then. I doubt I will move to another country, just because I don&amp;#39;t want to speak a foreign language. It will just cause one more anxiety when I see other people.&lt;/p&gt;\n\n&lt;p&gt;In a year time I will have my &amp;quot;job-exam&amp;quot;. I&amp;#39;m not educated yet, but I&amp;#39;m still working full time. I will loose my job if I fail of course, and yeah I believe I have 10% chance of succeed. If it would have been a writing test, I would give myself 80% at the moment. But with my social anxiety I will fuck it up with two sensors judging my abilities as it is a speaking exam, and I have to explain them all the processes etc. Would not go well at all. I&amp;#39;ve been depressed just thinking about that day since I got the job.&lt;/p&gt;\n\n&lt;p&gt;If I fail that exam, I will go through and do it as there is no future for me if I fail.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_d4uyhal", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/d4uyhal/", "num_reports": null, "stickied": false, "created": 1467376076.0, "author_flair_text": null, "created_utc": 1467347276.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4uwyp9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "TA2462", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4qpcpp", "score": 1, "approved_by": null, "downs": 0, "body": "Similar situation here although I am a bit older than you.  For me my parents were way to controlling when I was younger and due to this my social skills never evolved to much.  \n\nDespite not having an issue with consuming alcohol I dislike it.  It's not for everyone.  I found most people my age that drink do it because they see it as a social norm.  These people give into peer pressure way to easily.\n\nI know its tough because you don't always have the energy but you should try some hobbies. Photography, dancing, cooking or really anything. Devote time to things you have always wishes you were better at.\n\nRather than trying to kill yourself in another country why not try live in another country?  Some societies cater to different types of personalities better than others.", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Similar situation here although I am a bit older than you.  For me my parents were way to controlling when I was younger and due to this my social skills never evolved to much.  &lt;/p&gt;\n\n&lt;p&gt;Despite not having an issue with consuming alcohol I dislike it.  It&amp;#39;s not for everyone.  I found most people my age that drink do it because they see it as a social norm.  These people give into peer pressure way to easily.&lt;/p&gt;\n\n&lt;p&gt;I know its tough because you don&amp;#39;t always have the energy but you should try some hobbies. Photography, dancing, cooking or really anything. Devote time to things you have always wishes you were better at.&lt;/p&gt;\n\n&lt;p&gt;Rather than trying to kill yourself in another country why not try live in another country?  Some societies cater to different types of personalities better than others.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_d4uwyp9", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/d4uwyp9/", "num_reports": null, "stickied": false, "created": 1467373261.0, "author_flair_text": "", "created_utc": 1467344461.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4qpcpp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4qpcpp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d4v142h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FuckLife97", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d4uwr2v", "score": 1, "approved_by": null, "downs": 0, "body": "To scared to seek professional help. And I will never speak to my parents about this, it will only makes things worse. As it is now I'm watching the people I know at my age on social medias, being out enjoying themselves.. I'm jealous to be honest, although it would be hard for me to even try to socialize with them now due to my social anxiety. But yeah in a few years, if I'm still alive and living on my own, I'll try my best to socialize and gain a normal life.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;To scared to seek professional help. And I will never speak to my parents about this, it will only makes things worse. As it is now I&amp;#39;m watching the people I know at my age on social medias, being out enjoying themselves.. I&amp;#39;m jealous to be honest, although it would be hard for me to even try to socialize with them now due to my social anxiety. But yeah in a few years, if I&amp;#39;m still alive and living on my own, I&amp;#39;ll try my best to socialize and gain a normal life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_d4v142h", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/d4v142h/", "num_reports": null, "stickied": false, "created": 1467381765.0, "author_flair_text": null, "created_utc": 1467352965.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d4uwr2v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4qpcpp", "score": 0, "approved_by": null, "downs": 0, "body": "[deleted]", "edited": 1467481307.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[deleted]&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_d4uwr2v", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/4qpcpp/my_parents_have_fucked_up_my_life/d4uwr2v/", "num_reports": null, "stickied": false, "created": 1467372868.0, "author_flair_text": null, "created_utc": 1467344068.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]