[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2w2s8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;To make this argument I&amp;#39;ll first lay out what I think we collectively expect from a critic.  The definition of a critic is simple: “a person who judges the merits of literary, artistic, or musical works, especially one who does so professionally.”  Now, Christgau certainly does this.  I&amp;#39;m not arguing whether he qualifies as a critic or not, I&amp;#39;m arguing that he is bad at being a critic.  This is because in truth what a good critic does goes beyond that basic definition.  Here are a few of what I see as commonly-agreed-upon methods of good criticism:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;They make their opinions on the work clear. This is the easy part.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;They provide a justification for those opinions, based on the work, so that they are credible.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Those are the most vital two.  As long as you fulfill those requirements you are essentially doing the job of a critic.  Your actual writing may be poor but your criticism is still good.  However, there are a few further elements which, though arguable, also help:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Criticising not the artist, but his art.  That is, you call the music idiotic, but you don&amp;#39;t call the muscians idiots.  Basically, avoid ad-hominem attacks, both because you&amp;#39;re an art critic and not a people critic, and because it&amp;#39;s highly unprofessional.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Forming your opinions based on what the art is trying to achieve rather than what you desire. I.e. don&amp;#39;t criticize Hamlet for being sad.  It&amp;#39;s a tragedy, and is meant to be sad, so that means it succeeds in what it&amp;#39;s doing.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Consistency isn&amp;#39;t required, especially if a critic has a long career like Christgau&amp;#39;s and thus their outlook changes over the years.  However, a critic&amp;#39;s tastes shouldn&amp;#39;t be constantly jumping around or they become unreliable and arbitrary.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;There are probably more, but those are the basics, and no matter how many requirements you set up, it ultimately doesn&amp;#39;t matter, because Christgau violates every last one.  To be clear, I&amp;#39;m not saying that all of his reviews violate all of these criteria, but that he fails at least one of them in seemingly every review I&amp;#39;ve seen of his, and that those few reviews in which he doesn&amp;#39;t (I give him the benefit of the doubt and assume they&amp;#39;re out there, because of the enormous breadth of his work and the likelihood that I&amp;#39;ve forgotten the particulars of some that I have read) are so rare as to constitute only a tiny fraction of his critical output.  In short, he fails to be a good critic more often than he succeeds, and is therefore bad.&lt;/p&gt;\n\n&lt;p&gt;Now, to get onto his actual mistakes (for lack of a better word; many are so flagrant that it&amp;#39;s obvious he deliberately does them).  In no particular order of extremity or “badness”, here are all of his transgressions that I can think of at the moment:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;He frequently insults his subjects and cruelly makes attacks on their personal lives.  Perhaps most famous but also most innocuous is his inexplicable hatred for Jim Morrison, describing him in his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=The+Doors\"&gt;“Very Best Of the Doors”&lt;/a&gt; as an “ass man”, “slimeball” and “asshole.” More harsh is in his review of the album &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=The+Libertines\"&gt;“The Libertines”&lt;/a&gt; by the Libertines, where he makes fun of Pete Doherty&amp;#39;s drug addictions.  As if that weren&amp;#39;t too far, he does it again in his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Babyshambles\"&gt;“Shotter&amp;#39;s Nation”&lt;/a&gt; by Babyshambles, as well as what may be an attack on Doherty&amp;#39;s romantic life, though it is written so ambiguously that I can&amp;#39;t exactly tell (this is another issue which we&amp;#39;ll reach later).  In a case that doesn&amp;#39;t delve into personal problems, he seems to have a fairly creepy view of Karen O from Yeah Yeah Yeahs, mentioning her &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Yeah+Yeah+Yeahs\"&gt;“fuck-me persona”, calling her a “dolly” and describing one album as “sex...and icy hot”.  But worst of all is his suspicious denial that he wants her for a girlfriend in his review of “Show Your Bones,”&lt;/a&gt; evidently meant to be humourous but coming across as gratuitous.  I&amp;#39;m not pretending Karen O isn&amp;#39;t attractive – in fact, I agree with him on most of it.  But is it necessary for half your writing about a band to be about how sexy the one female member is?  And at that, he wrote those reviews at the ages of 59 to 71, during which time she was 22 to 34 (forgive me if my math is wrong; the point is it&amp;#39;s damn creepy).  He also can&amp;#39;t resist commenting on &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Nicki+Minaj\"&gt;Nicki Minaj&amp;#39;s&lt;/a&gt; breasts and butt, which is arguably justified since she actually writes songs on at least one of those subjects, but still leaves a bad taste in one&amp;#39;s mouth. In the absolute worst, most disgustingly tasteless example of this, he praises Ian Curtis for committing suicide in his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=interpol\"&gt;“Turn On the Bright Lights”&lt;/a&gt; by Interpol (for those out of the loop, when Ian Curtis killed himself, his former bandmates reformed into the band New Order), made all the more unnecessary by the fact that he&amp;#39;s not even reviewing Ian Curtis&amp;#39; music – he just felt the review needed some kind of offensive flair to generate interest, apparently.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;His reviews often consist of so much jargon that they are nearly or completely incomprehensible, and even those not containing jargon can be hard or impossible to parse.  Half of these examples appear to be, quite literally, jokes, which is either evidence that he doesn&amp;#39;t respect the people he&amp;#39;s reviewing or he doesn&amp;#39;t respect his job as a critic.  Some examples: his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=queen\"&gt;“Queen II”&lt;/a&gt; by Queen, which means absolutely nothing and seems to be a lazy attempt to dismiss their style entirely.  This is a case of not making his opinion clear, nor providing a reason for why that opinion is.  Another is his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=The+Strokes\"&gt;“First Impressions of Earth”&lt;/a&gt; by the Strokes, which appears to be an idiom meaning, well, something or other, but is again so unclear that it ultimately communicates nothing.  There&amp;#39;s also the case of his reviews of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=The+Fall\"&gt;“Extricate” and “Kimble”&lt;/a&gt; by the Fall, the former of which means nothing and the second of which contains no reasoning for its judgment.  There are many more examples of this but I feel these are egregious enough to demonstrate his tendencies.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;His opinions are often inconsistent.  In his review of the Rolling Stones&amp;#39; &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=The+Rolling+Stones\"&gt;“Exile on Main Street”&lt;/a&gt; he praises the “layers of studio murk” over the singer&amp;#39;s voice and gives it an A+.  It&amp;#39;s pretty clear he thinks that this is the band&amp;#39;s best album.  But in his review of “Undercover” by the same band, one of his first criticisms is that the album is “murky,” and he concludes it is their worst studio album.  So, is murkiness good or bad?  Not only that, but his review of the Stones&amp;#39; album “Steel Wheels” is a B-, which seems to me like a very middling grade.  Then in his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Sonic+Youth\"&gt;“The Eternal”&lt;/a&gt; by Sonic Youth, he calls Steel Wheels “immortal.”  Isn&amp;#39;t that high praise for a B- when you&amp;#39;ve given them A&amp;#39;s and A+&amp;#39;s before?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Christgau sometimes goes so far as to outright not review an artist&amp;#39;s music.  He does this in a negative way with his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Korn\"&gt;“Korn”&lt;/a&gt; by Korn, which consists of a review of the album&amp;#39;s cover art, an implication that the band members are pedophiles and a pun on their name.  Sure, his point is clear: he hates the band.  But what is it about their music that he hates?  We&amp;#39;ll never know.  I specified that example was negative because he also manages to do this as a form of praise, exemplified with his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=The+Strokes\"&gt;“The Modern Age”&lt;/a&gt; by the Strokes, in which he dedicates the start of the review to figuring out which 60s/70s punk band he thinks it sounds like, and when he settles on the Vibrators he spends the rest of the review describing them.  Does Christgau really think somebody reading a review for the Strokes wants to instead read a review of a band two decades older and part of a different genre?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;He insults fans of artists he doesn&amp;#39;t like, which is needless to say a very immature move for somebody who is allegedly an esteemed critic.  Was it necessary, in his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Nick+Cave+%26+the+Bad+Seeds\"&gt;“Henry&amp;#39;s Dream”&lt;/a&gt; by Nick Cave &amp;amp; the Bad Seeds, to call his fans cultists and insult their taste in lyrics?  Whether or not he&amp;#39;s right, he&amp;#39;s supposed to be reviewing the music and not the people who listen to it.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;His ratings often have very poor, arbitrary justifications.  The best example is probably his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Captain+Beefheart+and+the+Magic+Band\"&gt;“Trust Mask Replica”&lt;/a&gt; by Captain Beefheart, which he says he wants to give an A, but won&amp;#39;t, because it&amp;#39;s “just too weird.”  What kind of reasoning is that?  Is Christgau really so beholden to others that he can&amp;#39;t even state his true opinions on an album?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Finally, he outright states in his review of &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=Public+Image+Ltd.\"&gt;“Flowers of Romance”&lt;/a&gt; by Public Image Ltd that he doesn&amp;#39;t even like rock music or rock criticism (at the risk of this sounding cheap, maybe that&amp;#39;s why he&amp;#39;s so bad at it).  Perhaps this is ultimately unnecessary, but surely to be a music critic you should have an actual interest, if not a passion, in the music you critique?  I mean, imagine the outrage there would be if Roger Ebert confessed, after winning his Pulitzer Prize, that he thinks the entire medium of film is “boring.”  &lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;As far as I can tell that concludes my issues with Robert Christgau.  In summary: his reviews often state their judgments in an unclear manner.  In those cases when they don&amp;#39;t, the judgments often have little-to-no reasoning to back them up, and are further marred by a variety of problems such as engaging in ad-hominem attacks on both the musicians and their fans.  In this way he fails to fulfill his duties as a critic and is thus bad at his job.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;&lt;em&gt;Hello, users of CMV! This is a footnote from your moderators. We&amp;#39;d just like to remind you of a couple of things. Firstly, please remember to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules\"&gt;read through our rules&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting\"&gt;downvotes don&amp;#39;t change views&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;&lt;em&gt;! If you are thinking about submitting a CMV yourself, please have a look through our&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/populartopics\"&gt;popular topics wiki&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt; &lt;em&gt;first. Any questions or concerns? Feel free to&lt;/em&gt; &lt;strong&gt;&lt;em&gt;&lt;a href=\"http://www.reddit.com/message/compose?to=/r/changemyview\"&gt;message us&lt;/a&gt;&lt;/em&gt;&lt;/strong&gt;. &lt;em&gt;Happy CMVing!&lt;/em&gt;&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "To make this argument I'll first lay out what I think we collectively expect from a critic.  The definition of a critic is simple: “a person who judges the merits of literary, artistic, or musical works, especially one who does so professionally.”  Now, Christgau certainly does this.  I'm not arguing whether he qualifies as a critic or not, I'm arguing that he is bad at being a critic.  This is because in truth what a good critic does goes beyond that basic definition.  Here are a few of what I see as commonly-agreed-upon methods of good criticism:\n\n - They make their opinions on the work clear. This is the easy part.\n\n - They provide a justification for those opinions, based on the work, so that they are credible.\n\nThose are the most vital two.  As long as you fulfill those requirements you are essentially doing the job of a critic.  Your actual writing may be poor but your criticism is still good.  However, there are a few further elements which, though arguable, also help:\n\n - Criticising not the artist, but his art.  That is, you call the music idiotic, but you don't call the muscians idiots.  Basically, avoid ad-hominem attacks, both because you're an art critic and not a people critic, and because it's highly unprofessional.\n\n - Forming your opinions based on what the art is trying to achieve rather than what you desire. I.e. don't criticize Hamlet for being sad.  It's a tragedy, and is meant to be sad, so that means it succeeds in what it's doing.\n\n - Consistency isn't required, especially if a critic has a long career like Christgau's and thus their outlook changes over the years.  However, a critic's tastes shouldn't be constantly jumping around or they become unreliable and arbitrary.\n\nThere are probably more, but those are the basics, and no matter how many requirements you set up, it ultimately doesn't matter, because Christgau violates every last one.  To be clear, I'm not saying that all of his reviews violate all of these criteria, but that he fails at least one of them in seemingly every review I've seen of his, and that those few reviews in which he doesn't (I give him the benefit of the doubt and assume they're out there, because of the enormous breadth of his work and the likelihood that I've forgotten the particulars of some that I have read) are so rare as to constitute only a tiny fraction of his critical output.  In short, he fails to be a good critic more often than he succeeds, and is therefore bad.\n\nNow, to get onto his actual mistakes (for lack of a better word; many are so flagrant that it's obvious he deliberately does them).  In no particular order of extremity or “badness”, here are all of his transgressions that I can think of at the moment:\n\n - He frequently insults his subjects and cruelly makes attacks on their personal lives.  Perhaps most famous but also most innocuous is his inexplicable hatred for Jim Morrison, describing him in his review of [“Very Best Of the Doors”](http://www.robertchristgau.com/get_artist.php?name=The+Doors) as an “ass man”, “slimeball” and “asshole.” More harsh is in his review of the album [“The Libertines”](http://www.robertchristgau.com/get_artist.php?name=The+Libertines) by the Libertines, where he makes fun of Pete Doherty's drug addictions.  As if that weren't too far, he does it again in his review of [“Shotter's Nation”](http://www.robertchristgau.com/get_artist.php?name=Babyshambles) by Babyshambles, as well as what may be an attack on Doherty's romantic life, though it is written so ambiguously that I can't exactly tell (this is another issue which we'll reach later).  In a case that doesn't delve into personal problems, he seems to have a fairly creepy view of Karen O from Yeah Yeah Yeahs, mentioning her [“fuck-me persona”, calling her a “dolly” and describing one album as “sex...and icy hot”.  But worst of all is his suspicious denial that he wants her for a girlfriend in his review of “Show Your Bones,”](http://www.robertchristgau.com/get_artist.php?name=Yeah+Yeah+Yeahs) evidently meant to be humourous but coming across as gratuitous.  I'm not pretending Karen O isn't attractive – in fact, I agree with him on most of it.  But is it necessary for half your writing about a band to be about how sexy the one female member is?  And at that, he wrote those reviews at the ages of 59 to 71, during which time she was 22 to 34 (forgive me if my math is wrong; the point is it's damn creepy).  He also can't resist commenting on [Nicki Minaj's](http://www.robertchristgau.com/get_artist.php?name=Nicki+Minaj) breasts and butt, which is arguably justified since she actually writes songs on at least one of those subjects, but still leaves a bad taste in one's mouth. In the absolute worst, most disgustingly tasteless example of this, he praises Ian Curtis for committing suicide in his review of [“Turn On the Bright Lights”](http://www.robertchristgau.com/get_artist.php?name=interpol) by Interpol (for those out of the loop, when Ian Curtis killed himself, his former bandmates reformed into the band New Order), made all the more unnecessary by the fact that he's not even reviewing Ian Curtis' music – he just felt the review needed some kind of offensive flair to generate interest, apparently.\n\n - His reviews often consist of so much jargon that they are nearly or completely incomprehensible, and even those not containing jargon can be hard or impossible to parse.  Half of these examples appear to be, quite literally, jokes, which is either evidence that he doesn't respect the people he's reviewing or he doesn't respect his job as a critic.  Some examples: his review of [“Queen II”](http://www.robertchristgau.com/get_artist.php?name=queen) by Queen, which means absolutely nothing and seems to be a lazy attempt to dismiss their style entirely.  This is a case of not making his opinion clear, nor providing a reason for why that opinion is.  Another is his review of [“First Impressions of Earth”](http://www.robertchristgau.com/get_artist.php?name=The+Strokes) by the Strokes, which appears to be an idiom meaning, well, something or other, but is again so unclear that it ultimately communicates nothing.  There's also the case of his reviews of [“Extricate” and “Kimble”](http://www.robertchristgau.com/get_artist.php?name=The+Fall) by the Fall, the former of which means nothing and the second of which contains no reasoning for its judgment.  There are many more examples of this but I feel these are egregious enough to demonstrate his tendencies.\n\n - His opinions are often inconsistent.  In his review of the Rolling Stones' [“Exile on Main Street”](http://www.robertchristgau.com/get_artist.php?name=The+Rolling+Stones) he praises the “layers of studio murk” over the singer's voice and gives it an A+.  It's pretty clear he thinks that this is the band's best album.  But in his review of “Undercover” by the same band, one of his first criticisms is that the album is “murky,” and he concludes it is their worst studio album.  So, is murkiness good or bad?  Not only that, but his review of the Stones' album “Steel Wheels” is a B-, which seems to me like a very middling grade.  Then in his review of [“The Eternal”](http://www.robertchristgau.com/get_artist.php?name=Sonic+Youth) by Sonic Youth, he calls Steel Wheels “immortal.”  Isn't that high praise for a B- when you've given them A's and A+'s before?\n\n - Christgau sometimes goes so far as to outright not review an artist's music.  He does this in a negative way with his review of [“Korn”](http://www.robertchristgau.com/get_artist.php?name=Korn) by Korn, which consists of a review of the album's cover art, an implication that the band members are pedophiles and a pun on their name.  Sure, his point is clear: he hates the band.  But what is it about their music that he hates?  We'll never know.  I specified that example was negative because he also manages to do this as a form of praise, exemplified with his review of [“The Modern Age”](http://www.robertchristgau.com/get_artist.php?name=The+Strokes) by the Strokes, in which he dedicates the start of the review to figuring out which 60s/70s punk band he thinks it sounds like, and when he settles on the Vibrators he spends the rest of the review describing them.  Does Christgau really think somebody reading a review for the Strokes wants to instead read a review of a band two decades older and part of a different genre?\n\n - He insults fans of artists he doesn't like, which is needless to say a very immature move for somebody who is allegedly an esteemed critic.  Was it necessary, in his review of [“Henry's Dream”](http://www.robertchristgau.com/get_artist.php?name=Nick+Cave+%26+the+Bad+Seeds) by Nick Cave &amp; the Bad Seeds, to call his fans cultists and insult their taste in lyrics?  Whether or not he's right, he's supposed to be reviewing the music and not the people who listen to it.\n\n - His ratings often have very poor, arbitrary justifications.  The best example is probably his review of [“Trust Mask Replica”](http://www.robertchristgau.com/get_artist.php?name=Captain+Beefheart+and+the+Magic+Band) by Captain Beefheart, which he says he wants to give an A, but won't, because it's “just too weird.”  What kind of reasoning is that?  Is Christgau really so beholden to others that he can't even state his true opinions on an album?\n\n - Finally, he outright states in his review of [“Flowers of Romance”](http://www.robertchristgau.com/get_artist.php?name=Public+Image+Ltd.) by Public Image Ltd that he doesn't even like rock music or rock criticism (at the risk of this sounding cheap, maybe that's why he's so bad at it).  Perhaps this is ultimately unnecessary, but surely to be a music critic you should have an actual interest, if not a passion, in the music you critique?  I mean, imagine the outrage there would be if Roger Ebert confessed, after winning his Pulitzer Prize, that he thinks the entire medium of film is “boring.”  \n\nAs far as I can tell that concludes my issues with Robert Christgau.  In summary: his reviews often state their judgments in an unclear manner.  In those cases when they don't, the judgments often have little-to-no reasoning to back them up, and are further marred by a variety of problems such as engaging in ad-hominem attacks on both the musicians and their fans.  In this way he fails to fulfill his duties as a critic and is thus bad at his job.\n\n_____\n\n&gt; *Hello, users of CMV! This is a footnote from your moderators. We'd just like to remind you of a couple of things. Firstly, please remember to* ***[read through our rules](http://www.reddit.com/r/changemyview/wiki/rules)***. *If you see a comment that has broken one, it is more effective to report it than downvote it. Speaking of which,* ***[downvotes don't change views](http://www.reddit.com/r/changemyview/wiki/guidelines#wiki_upvoting.2Fdownvoting)****! If you are thinking about submitting a CMV yourself, please have a look through our* ***[popular topics wiki](http://www.reddit.com/r/changemyview/wiki/populartopics)*** *first. Any questions or concerns? Feel free to* ***[message us](http://www.reddit.com/message/compose?to=/r/changemyview)***. *Happy CMVing!*", "likes": null, "suggested_sort": "qa", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "3j53bb", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "Sadsharks", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 16, "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "num_comments": 8, "thumbnail": "", "hide_score": false, "edited": 1441060271.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 539231, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_3j53bb", "spoiler": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1441087992.0, "url": "https://www.reddit.com/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/", "author_flair_text": "3∆", "quarantine": false, "title": "CMV: Robert Christgau is a bad critic.", "created_utc": 1441059192.0, "subreddit_name_prefixed": "r/changemyview", "distinguished": null, "media": null, "upvote_ratio": 0.69, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 16}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cumklc5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "n_5", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cumjsb8", "score": 1, "approved_by": null, "downs": 0, "body": "That's a lot of criticism, though. Tell someone to look up an album they like on P4K - chances are they won't be able to wade through more than two paragraphs before being brought down in a slew of meaningless terminology. This is how it was before Christgau as well - just read any hoity-toity modern classical review and you'll see what I mean. What Christgau did, IMO, was that, even if he didn't make his writing fully accessible, he definitely made it more so. That 50% was revolutionary compared to the incomprehensible garble that was art criticism of that era. He may have said silly and poorly-explained things, sure, but his explanations were a hell of a lot more to the point and clear than anything else about rock of the time.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s a lot of criticism, though. Tell someone to look up an album they like on P4K - chances are they won&amp;#39;t be able to wade through more than two paragraphs before being brought down in a slew of meaningless terminology. This is how it was before Christgau as well - just read any hoity-toity modern classical review and you&amp;#39;ll see what I mean. What Christgau did, IMO, was that, even if he didn&amp;#39;t make his writing fully accessible, he definitely made it more so. That 50% was revolutionary compared to the incomprehensible garble that was art criticism of that era. He may have said silly and poorly-explained things, sure, but his explanations were a hell of a lot more to the point and clear than anything else about rock of the time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumklc5", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumklc5/", "num_reports": null, "stickied": false, "created": 1441101874.0, "author_flair_text": "26∆", "created_utc": 1441073074.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 6, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cumjsb8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Sadsharks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cumip4a", "score": 2, "approved_by": null, "downs": 0, "body": "I agree with that fully, and mean no offense, but either you've missed my point or I haven't stated it clearly.\n\nBasically, imagine this: you're an average music fan.  There's an album you want to buy but you're not sure if it will be your thing, so you read a review.  You've heard that Christgau is famous and all so you check out what he thinks of it.\n\nThe way I see it there's a 50% chance that you won't even understand what he's saying.  In the cases where you *do,* it's very likely that what he says will be irrelevant to the music, badly explained, etc.  In this sense, he fails to be a good critic.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with that fully, and mean no offense, but either you&amp;#39;ve missed my point or I haven&amp;#39;t stated it clearly.&lt;/p&gt;\n\n&lt;p&gt;Basically, imagine this: you&amp;#39;re an average music fan.  There&amp;#39;s an album you want to buy but you&amp;#39;re not sure if it will be your thing, so you read a review.  You&amp;#39;ve heard that Christgau is famous and all so you check out what he thinks of it.&lt;/p&gt;\n\n&lt;p&gt;The way I see it there&amp;#39;s a 50% chance that you won&amp;#39;t even understand what he&amp;#39;s saying.  In the cases where you &lt;em&gt;do,&lt;/em&gt; it&amp;#39;s very likely that what he says will be irrelevant to the music, badly explained, etc.  In this sense, he fails to be a good critic.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumjsb8", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumjsb8/", "num_reports": null, "stickied": false, "created": 1441100529.0, "author_flair_text": "3∆", "created_utc": 1441071729.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cumip4a", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "n_5", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cumigyr", "score": 1, "approved_by": null, "downs": 0, "body": "He's definitely not perfect, and he's said a lot of shitty things. That said, the amount of influence he's had is enormous, and his best work continues to inform music reviews today. It's definitely a case of \"right place, right time\" but he was so in the right place at the right time that music criticism was forever changed thanks to him and a few other people. It wouldn't be where it is today otherwise, and shittiness or no shittiness it's hard to argue he hasn't left his fingerprint all over the current state of writing.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;He&amp;#39;s definitely not perfect, and he&amp;#39;s said a lot of shitty things. That said, the amount of influence he&amp;#39;s had is enormous, and his best work continues to inform music reviews today. It&amp;#39;s definitely a case of &amp;quot;right place, right time&amp;quot; but he was so in the right place at the right time that music criticism was forever changed thanks to him and a few other people. It wouldn&amp;#39;t be where it is today otherwise, and shittiness or no shittiness it&amp;#39;s hard to argue he hasn&amp;#39;t left his fingerprint all over the current state of writing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumip4a", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumip4a/", "num_reports": null, "stickied": false, "created": 1441098726.0, "author_flair_text": "26∆", "created_utc": 1441069926.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cumigyr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Sadsharks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cumi1jk", "score": 1, "approved_by": null, "downs": 0, "body": "I suppose if we were to take the bad with the good we would first have to figure out which one is really worth taking -- that is, do his thoughtful, insightful reviews actually outnumber his lazy, petty ones?  As you've said, he's had such a long career that it would be virtually impossible.  Maybe my emotions are getting the better of me but from what I've seen, even if his shitty reviews are in the minority, there's enough of them and they're bad enough that the sheer volume puts (or should put) a sizeable dent in his reputation.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I suppose if we were to take the bad with the good we would first have to figure out which one is really worth taking -- that is, do his thoughtful, insightful reviews actually outnumber his lazy, petty ones?  As you&amp;#39;ve said, he&amp;#39;s had such a long career that it would be virtually impossible.  Maybe my emotions are getting the better of me but from what I&amp;#39;ve seen, even if his shitty reviews are in the minority, there&amp;#39;s enough of them and they&amp;#39;re bad enough that the sheer volume puts (or should put) a sizeable dent in his reputation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumigyr", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumigyr/", "num_reports": null, "stickied": false, "created": 1441098345.0, "author_flair_text": "3∆", "created_utc": 1441069545.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cumi1jk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "n_5", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cumh4sh", "score": 2, "approved_by": null, "downs": 0, "body": "I mean, the man's probably written millions of words at this point. Chances are, he's said a few things he'd like to take back. The Ian Curtis bit is pretty terrible, even if he does make the good point that New Order would not have been possible with anything less than the tragic circumstances of his death.\n\nBut when I'm talking about \"nitpicking,\" I'm talking more about taking issue with certain things he's said in certain reviews when he probably has upwards of a thousand written over his career (if not far, far more). It's like getting mad at a super-great rapper for a few homophobic lyrics or some classic rockers for some words that cross the \"acceptable-sexism\" boundaries. Like, we can get mad at them, but in the bigger picture their influence and legacy is too important to get bogged down in these little things.\n\nSo, yeah, his name-calling is kinda petty, but it just kinda reinforces his legacy as a cantankerous dude who occasionally loves his music. Sometimes his writing is lazy, but sometimes his writing is brilliant (I particularly like his [Endtroducing..... review](http://www.robertchristgau.com/get_artist.php?name=DJ+Shadow) - and that's pretty true of all great writers. Take the bad with the good, and seeing him at his worst makes him at his best - succinct, yet capturing the essence of what makes music so compelling through one album or artist - all that much sweeter.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, the man&amp;#39;s probably written millions of words at this point. Chances are, he&amp;#39;s said a few things he&amp;#39;d like to take back. The Ian Curtis bit is pretty terrible, even if he does make the good point that New Order would not have been possible with anything less than the tragic circumstances of his death.&lt;/p&gt;\n\n&lt;p&gt;But when I&amp;#39;m talking about &amp;quot;nitpicking,&amp;quot; I&amp;#39;m talking more about taking issue with certain things he&amp;#39;s said in certain reviews when he probably has upwards of a thousand written over his career (if not far, far more). It&amp;#39;s like getting mad at a super-great rapper for a few homophobic lyrics or some classic rockers for some words that cross the &amp;quot;acceptable-sexism&amp;quot; boundaries. Like, we can get mad at them, but in the bigger picture their influence and legacy is too important to get bogged down in these little things.&lt;/p&gt;\n\n&lt;p&gt;So, yeah, his name-calling is kinda petty, but it just kinda reinforces his legacy as a cantankerous dude who occasionally loves his music. Sometimes his writing is lazy, but sometimes his writing is brilliant (I particularly like his &lt;a href=\"http://www.robertchristgau.com/get_artist.php?name=DJ+Shadow\"&gt;Endtroducing..... review&lt;/a&gt; - and that&amp;#39;s pretty true of all great writers. Take the bad with the good, and seeing him at his worst makes him at his best - succinct, yet capturing the essence of what makes music so compelling through one album or artist - all that much sweeter.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumi1jk", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumi1jk/", "num_reports": null, "stickied": false, "created": 1441097617.0, "author_flair_text": "26∆", "created_utc": 1441068817.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cumh4sh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Sadsharks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cumg4a4", "score": 1, "approved_by": null, "downs": 0, "body": "I can see where you're coming from on a lot of this and agree with you to some degree - sort of like how a band might nowadays seems pretty terrible, but is important and worth remembering for how it changed the scene at the time.  I do get a feeling that he's trying, in a way, to make his reviews almost into an art form of their own.  But I'm trying to approach it from the view of somebody reading his work as what it ostensibly claims to be, criticism.  Even if your criticism is unique and changed the atmosphere of criticism at the time, if it doesn't actually criticize the art (i.e. \"indefatigueable-uh\") then in that sense it isn't good criticism.  There are cases where he actually explains his view quite well, such as his Bob Dylan and Ramones reviews, which are actually enjoyable to read because he does in fact know what he's talking about.\n\nAnd about nitpicking - I realize I did some, especially with the Stones stuff, which is pretty weak on my part (I had to resort to that because I had a much better example involving the PiL song \"This Is Not a Love Song\", which he referred to in separate reviews as \"magnificent\" and then \"ruined,\" before I realized he was talking about two different versions).  However, I think when the writing is done in his format - single-paragraph reviews where every word counts - then it's more justified.\n\nI agree that it's impossible in many cases to fully separate art and artist, but I'm not really asking him to do that.  If he wants to actually make a good argument against Jim Morrison, which is fully possible given the things Morrison did, then I think that would be reasonable.  In fact, he's done just that before, such as in his reviews for Sparks, who he calls misogynistic.  I don't know if that's true, but it's a genuine criticism.  This makes me think that if he actually had a good reason to go after Morrison, he would. But instead he resorts to name-calling.  And that Ian Curtis thing is still pretty indefensible, especially since he actually *liked* Joy Division.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can see where you&amp;#39;re coming from on a lot of this and agree with you to some degree - sort of like how a band might nowadays seems pretty terrible, but is important and worth remembering for how it changed the scene at the time.  I do get a feeling that he&amp;#39;s trying, in a way, to make his reviews almost into an art form of their own.  But I&amp;#39;m trying to approach it from the view of somebody reading his work as what it ostensibly claims to be, criticism.  Even if your criticism is unique and changed the atmosphere of criticism at the time, if it doesn&amp;#39;t actually criticize the art (i.e. &amp;quot;indefatigueable-uh&amp;quot;) then in that sense it isn&amp;#39;t good criticism.  There are cases where he actually explains his view quite well, such as his Bob Dylan and Ramones reviews, which are actually enjoyable to read because he does in fact know what he&amp;#39;s talking about.&lt;/p&gt;\n\n&lt;p&gt;And about nitpicking - I realize I did some, especially with the Stones stuff, which is pretty weak on my part (I had to resort to that because I had a much better example involving the PiL song &amp;quot;This Is Not a Love Song&amp;quot;, which he referred to in separate reviews as &amp;quot;magnificent&amp;quot; and then &amp;quot;ruined,&amp;quot; before I realized he was talking about two different versions).  However, I think when the writing is done in his format - single-paragraph reviews where every word counts - then it&amp;#39;s more justified.&lt;/p&gt;\n\n&lt;p&gt;I agree that it&amp;#39;s impossible in many cases to fully separate art and artist, but I&amp;#39;m not really asking him to do that.  If he wants to actually make a good argument against Jim Morrison, which is fully possible given the things Morrison did, then I think that would be reasonable.  In fact, he&amp;#39;s done just that before, such as in his reviews for Sparks, who he calls misogynistic.  I don&amp;#39;t know if that&amp;#39;s true, but it&amp;#39;s a genuine criticism.  This makes me think that if he actually had a good reason to go after Morrison, he would. But instead he resorts to name-calling.  And that Ian Curtis thing is still pretty indefensible, especially since he actually &lt;em&gt;liked&lt;/em&gt; Joy Division.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumh4sh", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumh4sh/", "num_reports": null, "stickied": false, "created": 1441096115.0, "author_flair_text": "3∆", "created_utc": 1441067315.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cumg4a4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "n_5", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3j53bb", "score": 2, "approved_by": null, "downs": 0, "body": "Wow, this was a long CMV! Let me try to respond here. Context: I'm an amateur music writer (write for The 405, Sputnikmusic, and now Popmatters), and love Christgau for the most part.\n\nWhat Christgau did, first and foremost, was strip all the navel-gazing and meaningless pretention and art-for-art's-sake from music reviewing. He brought serious, punchy criticism into the realm of popular music, and allowed for level-headed appraisal of music that older critics would have snootily disregarded.\n\nWhat I see you arguing, for the most part, is that he embodies a certain pettiness and sleaziness that's super undesirable in a critic, especially now. I'm not going to deny that in some cases. However, I don't think he's just poking fun at Doherty's drug addictions or Morrison's reputation for the most part - I see it as informing the music he's writing about. When he mentions Doherty's \"powder-sniffing,\" he's doing so in the context of what makes their album great, and when he mentions Morrison's \"slimeball\" nature, he's doing so to explain what either makes the album unenjoyable or great (LA Women, for example).\n\nHere's where I think we diverge: it's impossible to totally separate the art and the artist - i.e. take the art in a total vacuum. This is pretty obvious in extreme examples, obviously - like, it's kinda tough to enjoy the Cosby Show now, and it's tough to listen to Lostprophets now that Ian Watkins has been convicted of pedophilia. However, in subtler cases the artist informs the art as well. This can be negative - try listening to Mark Kozelek's misanthropy without thinking of his general shittiness and occasional misogyny - and positive - would *My Beautiful Dark Twisted Fantasy* have been quite so impressive without Kanye's general publicness and loudness?\n\nAnd, obviously, it's possible - I know plenty of people who love Sun Kil Moon regardless of Kozelek's public actions. But not every critic wants to do that. Christgau is going to take the artist along with the art, though I don't think he really ever takes the artist in the art's *stead*, but I think they are impossible to extricate from one another. Occasionally, this is more obscure - the KoRn review, for example - but I think that even in those reviews the tone of the surrounding material almost \"makes\" the music: it's a shitty aesthetic, and that shittiness extends through to the music as well (image above boring \"death-industrial,\" leading to boring and dumb music).\n\nAnd, yeah, occasionally his stuff is unwarranted. His Karen O thing is bad, which is why I think that having someone like Jess Hopper in command of P4K is important (even if I generally dislike her writing and self-importance). However, he's a caustic dude in a largely caustic-dude-centric field - I won't forgive him for his sexism, but I can at least understand where it comes from.\n\nSo, in conclusion: Christgau is great primarily because of how he transformed music writing, especially in how he (IMO) tastefully balances art and artist. Nitpicking like you're doing there is fair, but it's a little like nitpicking DJ Shadow's *Endtroducing.....* for sounding a little dated in 2015 when all the 2015 instrumental hip-hop wouldn't exist without it. He's praised largely for his influence, especially in terms of tone and brevity, and for that I have to give him the credit he's due.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow, this was a long CMV! Let me try to respond here. Context: I&amp;#39;m an amateur music writer (write for The 405, Sputnikmusic, and now Popmatters), and love Christgau for the most part.&lt;/p&gt;\n\n&lt;p&gt;What Christgau did, first and foremost, was strip all the navel-gazing and meaningless pretention and art-for-art&amp;#39;s-sake from music reviewing. He brought serious, punchy criticism into the realm of popular music, and allowed for level-headed appraisal of music that older critics would have snootily disregarded.&lt;/p&gt;\n\n&lt;p&gt;What I see you arguing, for the most part, is that he embodies a certain pettiness and sleaziness that&amp;#39;s super undesirable in a critic, especially now. I&amp;#39;m not going to deny that in some cases. However, I don&amp;#39;t think he&amp;#39;s just poking fun at Doherty&amp;#39;s drug addictions or Morrison&amp;#39;s reputation for the most part - I see it as informing the music he&amp;#39;s writing about. When he mentions Doherty&amp;#39;s &amp;quot;powder-sniffing,&amp;quot; he&amp;#39;s doing so in the context of what makes their album great, and when he mentions Morrison&amp;#39;s &amp;quot;slimeball&amp;quot; nature, he&amp;#39;s doing so to explain what either makes the album unenjoyable or great (LA Women, for example).&lt;/p&gt;\n\n&lt;p&gt;Here&amp;#39;s where I think we diverge: it&amp;#39;s impossible to totally separate the art and the artist - i.e. take the art in a total vacuum. This is pretty obvious in extreme examples, obviously - like, it&amp;#39;s kinda tough to enjoy the Cosby Show now, and it&amp;#39;s tough to listen to Lostprophets now that Ian Watkins has been convicted of pedophilia. However, in subtler cases the artist informs the art as well. This can be negative - try listening to Mark Kozelek&amp;#39;s misanthropy without thinking of his general shittiness and occasional misogyny - and positive - would &lt;em&gt;My Beautiful Dark Twisted Fantasy&lt;/em&gt; have been quite so impressive without Kanye&amp;#39;s general publicness and loudness?&lt;/p&gt;\n\n&lt;p&gt;And, obviously, it&amp;#39;s possible - I know plenty of people who love Sun Kil Moon regardless of Kozelek&amp;#39;s public actions. But not every critic wants to do that. Christgau is going to take the artist along with the art, though I don&amp;#39;t think he really ever takes the artist in the art&amp;#39;s &lt;em&gt;stead&lt;/em&gt;, but I think they are impossible to extricate from one another. Occasionally, this is more obscure - the KoRn review, for example - but I think that even in those reviews the tone of the surrounding material almost &amp;quot;makes&amp;quot; the music: it&amp;#39;s a shitty aesthetic, and that shittiness extends through to the music as well (image above boring &amp;quot;death-industrial,&amp;quot; leading to boring and dumb music).&lt;/p&gt;\n\n&lt;p&gt;And, yeah, occasionally his stuff is unwarranted. His Karen O thing is bad, which is why I think that having someone like Jess Hopper in command of P4K is important (even if I generally dislike her writing and self-importance). However, he&amp;#39;s a caustic dude in a largely caustic-dude-centric field - I won&amp;#39;t forgive him for his sexism, but I can at least understand where it comes from.&lt;/p&gt;\n\n&lt;p&gt;So, in conclusion: Christgau is great primarily because of how he transformed music writing, especially in how he (IMO) tastefully balances art and artist. Nitpicking like you&amp;#39;re doing there is fair, but it&amp;#39;s a little like nitpicking DJ Shadow&amp;#39;s &lt;em&gt;Endtroducing.....&lt;/em&gt; for sounding a little dated in 2015 when all the 2015 instrumental hip-hop wouldn&amp;#39;t exist without it. He&amp;#39;s praised largely for his influence, especially in terms of tone and brevity, and for that I have to give him the credit he&amp;#39;s due.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cumg4a4", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cumg4a4/", "num_reports": null, "stickied": false, "created": 1441094410.0, "author_flair_text": "26∆", "created_utc": 1441065610.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3j53bb", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cump0n5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NorbitGorbit", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3j53bb", "score": 0, "approved_by": null, "downs": 0, "body": "re: adhom attacks, to a large extent when you review music you are reviewing the artist, otherwise we would all accept tribute cover bands as being as good or better than the original.\n\nre: xgau, who would you cite as a good music critic then spanning roughly the same amount of time?", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;re: adhom attacks, to a large extent when you review music you are reviewing the artist, otherwise we would all accept tribute cover bands as being as good or better than the original.&lt;/p&gt;\n\n&lt;p&gt;re: xgau, who would you cite as a good music critic then spanning roughly the same amount of time?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_cump0n5", "score_hidden": false, "permalink": "/r/changemyview/comments/3j53bb/cmv_robert_christgau_is_a_bad_critic/cump0n5/", "num_reports": null, "stickied": false, "created": 1441109859.0, "author_flair_text": "9∆", "created_utc": 1441081059.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]