[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have c-ptsd from childhood sex abuse and later exposure to intense violence (street life and sex work). My experiences from the last few years seem to have leveled out and I&amp;#39;ve come to manage the trauma from those incidents, but I can&amp;#39;t seem to integrate the experiences from my youth. &lt;/p&gt;\n\n&lt;p&gt;Honestly, I just don&amp;#39;t remember the specifics well enough. I want to know my trauma, so I can work through it in therapy. I can remember them in dreams and wake up with fleeting memories. In waking life, I can hear my screams from back then, but not see the traumatic event. I feel that it&amp;#39;s happening to me and I don&amp;#39;t know what &amp;quot;it&amp;quot; is on a conscious level to understand it. &lt;/p&gt;\n\n&lt;p&gt;When I started therapy, I was taught to accept my experiences and move forward. With this, despite it having been there all along, I can&amp;#39;t recollected with enough clarity. I have several identifiable triggers, so I could cut and paste the scenario together, but I want to dig deeper, I want to know certainly what happened to me. &lt;/p&gt;\n\n&lt;p&gt;Your thoughts?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have c-ptsd from childhood sex abuse and later exposure to intense violence (street life and sex work). My experiences from the last few years seem to have leveled out and I've come to manage the trauma from those incidents, but I can't seem to integrate the experiences from my youth. \n\nHonestly, I just don't remember the specifics well enough. I want to know my trauma, so I can work through it in therapy. I can remember them in dreams and wake up with fleeting memories. In waking life, I can hear my screams from back then, but not see the traumatic event. I feel that it's happening to me and I don't know what \"it\" is on a conscious level to understand it. \n\nWhen I started therapy, I was taught to accept my experiences and move forward. With this, despite it having been there all along, I can't recollected with enough clarity. I have several identifiable triggers, so I could cut and paste the scenario together, but I want to dig deeper, I want to know certainly what happened to me. \n\nYour thoughts?", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "3v554j", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "tweekytrap", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 5, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 5, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_3v554j", "spoiler": false, "permalink": "/r/ptsd/comments/3v554j/digging_deeper/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1449093514.0, "url": "https://www.reddit.com/r/ptsd/comments/3v554j/digging_deeper/", "author_flair_text": null, "quarantine": false, "title": "Digging Deeper..?", "created_utc": 1449064714.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.79, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 5}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3v554j", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cxs50n4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "penismelon", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3v554j", "score": 1, "approved_by": null, "downs": 0, "body": "I don't know if it's something you're up for, but MMJ can work some magic in this area.\n\nRight when I started suspecting that I had C-PTSD, I couldn't really remember much of my childhood to definitively say that my problems stemmed from things that happened back then. Everything I could remember seemed so happy and perfect, so my doubt was strong.\n\nAround this time, whenever I'd smoke/vape with my closer friends and let my mind wander, it would jump back to the first decade of my life. I'd start having *intense* urges to break down and cry for what felt like no reason, coupled with some ambiguous feelings and vague/blurry snippets of memories. I knew I'd subconsciously blocked off access to those old memories for a reason, but now I needed them. Every time I smoked/vaped, I would try and recall at least one memory and deal with the emotions that came with it, just to make a little progress. \n\n6 months later (today), I've had a lot of my memory restored...but at a price. I was better equipped at emotionally processing them all than I thought I'd be, but I don't know if a person ever *could* be totally ready. Your subconscious has locked those memories away because of how painful they are; you might feel ready to face your biggest demons, but they might be bigger than you even remember. For me, it seems like they've grown. When I was little, I was just confused and hurt (ignorance *can* be bliss), but now that I'm older, I can see the entire situation for what it was and there are a LOT of extra heavy feelings that come along with that. I was doing okay before I realized just how much it all impacted me, but now I'm trying to fight off a full-blown regression.\n\nI can certainly say that MMJ could be able to help if you use it for this purpose; I can't talk you out of trying. If you think you can face what happened and deal with the fallout, I'd say give it a shot if it's what you need to keep moving in life. It takes a special kind of person to actively seek out the answers, even when they know they'll be painful to find. Good luck, we're in this together. :)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if it&amp;#39;s something you&amp;#39;re up for, but MMJ can work some magic in this area.&lt;/p&gt;\n\n&lt;p&gt;Right when I started suspecting that I had C-PTSD, I couldn&amp;#39;t really remember much of my childhood to definitively say that my problems stemmed from things that happened back then. Everything I could remember seemed so happy and perfect, so my doubt was strong.&lt;/p&gt;\n\n&lt;p&gt;Around this time, whenever I&amp;#39;d smoke/vape with my closer friends and let my mind wander, it would jump back to the first decade of my life. I&amp;#39;d start having &lt;em&gt;intense&lt;/em&gt; urges to break down and cry for what felt like no reason, coupled with some ambiguous feelings and vague/blurry snippets of memories. I knew I&amp;#39;d subconsciously blocked off access to those old memories for a reason, but now I needed them. Every time I smoked/vaped, I would try and recall at least one memory and deal with the emotions that came with it, just to make a little progress. &lt;/p&gt;\n\n&lt;p&gt;6 months later (today), I&amp;#39;ve had a lot of my memory restored...but at a price. I was better equipped at emotionally processing them all than I thought I&amp;#39;d be, but I don&amp;#39;t know if a person ever &lt;em&gt;could&lt;/em&gt; be totally ready. Your subconscious has locked those memories away because of how painful they are; you might feel ready to face your biggest demons, but they might be bigger than you even remember. For me, it seems like they&amp;#39;ve grown. When I was little, I was just confused and hurt (ignorance &lt;em&gt;can&lt;/em&gt; be bliss), but now that I&amp;#39;m older, I can see the entire situation for what it was and there are a LOT of extra heavy feelings that come along with that. I was doing okay before I realized just how much it all impacted me, but now I&amp;#39;m trying to fight off a full-blown regression.&lt;/p&gt;\n\n&lt;p&gt;I can certainly say that MMJ could be able to help if you use it for this purpose; I can&amp;#39;t talk you out of trying. If you think you can face what happened and deal with the fallout, I&amp;#39;d say give it a shot if it&amp;#39;s what you need to keep moving in life. It takes a special kind of person to actively seek out the answers, even when they know they&amp;#39;ll be painful to find. Good luck, we&amp;#39;re in this together. :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cxs50n4", "score_hidden": false, "permalink": "/r/ptsd/comments/3v554j/digging_deeper/cxs50n4/", "num_reports": null, "stickied": false, "created": 1449644788.0, "author_flair_text": null, "created_utc": 1449615988.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3v554j", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cxomffb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3v554j", "score": 1, "approved_by": null, "downs": 0, "body": "I think digging deeper can be very dangerous, so its not something I can really recommend. I have wanted to put the pieces together and force myself to remember everything in the hopes that I can reach closure that way. I have C-PTSD too and a lot of repressed and lost and fuzzy memories. Its frustrating...I wanted to \"solve\" this puzzle so I could understand it. I had triggers that I didn't understand and I wanted to know why. I figured that if I could recall it all and fully understand what happened, then my brain would be able to move on, the triggers and choppy memories would no longer be a paradox that I was trying to solve. I don't think it works that way though, and you can never underestimate how harrowing it can be to actually start to recall things. There is no knowing that what you recall will even be true and not distorted or confabulated. \n\nI pushed myself at one point because I wanted to know \"what happened\" and it was disastrous. Even went as far as to try hypnosis but I was turned away. Spent the next five years in a really profoundly ill state, in and out of hospitals, terrible self injury and self destructive behaviors, stress seizures, and I developed psychosis with hallucinations and delusions. It was not good. I don't try to bring up anything anymore because I know now that forcing myself just left me sick and almost dead. Those memories are like a storm I can see in the distance now, and if I keep moving forward they stay there, in the periphery. But if I pursue them then eventually it takes over and my whole existence becomes this perpetually violent storm. You lose yourself in that state and its hard to pull out of. I never want to go back to that and I never want anyone else to experience that. Its tempting to want to figure it out, but its better to have the mystery than to live in even more misery. You have enough to worry about and heal from as it is. \n\nI was told by another friend in treatment once that your body and your mind are smart. They hide information from you to protect you, and only let you remember what you are ready to remember. Forcing yourself to remember things that you are not actually ready for is incredibly damaging and destabilizing and it can take years to recover. Some don't at all. I agree with trying to focus on moving forward instead, when your body is ready it will begin to remember. In the meantime, don't forsake the present or the future for things that happened in the past. ", "edited": 1449366662.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think digging deeper can be very dangerous, so its not something I can really recommend. I have wanted to put the pieces together and force myself to remember everything in the hopes that I can reach closure that way. I have C-PTSD too and a lot of repressed and lost and fuzzy memories. Its frustrating...I wanted to &amp;quot;solve&amp;quot; this puzzle so I could understand it. I had triggers that I didn&amp;#39;t understand and I wanted to know why. I figured that if I could recall it all and fully understand what happened, then my brain would be able to move on, the triggers and choppy memories would no longer be a paradox that I was trying to solve. I don&amp;#39;t think it works that way though, and you can never underestimate how harrowing it can be to actually start to recall things. There is no knowing that what you recall will even be true and not distorted or confabulated. &lt;/p&gt;\n\n&lt;p&gt;I pushed myself at one point because I wanted to know &amp;quot;what happened&amp;quot; and it was disastrous. Even went as far as to try hypnosis but I was turned away. Spent the next five years in a really profoundly ill state, in and out of hospitals, terrible self injury and self destructive behaviors, stress seizures, and I developed psychosis with hallucinations and delusions. It was not good. I don&amp;#39;t try to bring up anything anymore because I know now that forcing myself just left me sick and almost dead. Those memories are like a storm I can see in the distance now, and if I keep moving forward they stay there, in the periphery. But if I pursue them then eventually it takes over and my whole existence becomes this perpetually violent storm. You lose yourself in that state and its hard to pull out of. I never want to go back to that and I never want anyone else to experience that. Its tempting to want to figure it out, but its better to have the mystery than to live in even more misery. You have enough to worry about and heal from as it is. &lt;/p&gt;\n\n&lt;p&gt;I was told by another friend in treatment once that your body and your mind are smart. They hide information from you to protect you, and only let you remember what you are ready to remember. Forcing yourself to remember things that you are not actually ready for is incredibly damaging and destabilizing and it can take years to recover. Some don&amp;#39;t at all. I agree with trying to focus on moving forward instead, when your body is ready it will begin to remember. In the meantime, don&amp;#39;t forsake the present or the future for things that happened in the past. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "ptsd", "name": "t1_cxomffb", "score_hidden": false, "permalink": "/r/ptsd/comments/3v554j/digging_deeper/cxomffb/", "num_reports": null, "stickied": false, "created": 1449393212.0, "author_flair_text": null, "created_utc": 1449364412.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3v554j", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cxkjpwx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CareflulWithThatAxe", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3v554j", "score": 3, "approved_by": null, "downs": 0, "body": "Please be careful. If you tear the hidden things free, it may be very hard to put them back. There might be a reason you can't remember. As in, your brain might know what it's doing by blocking. I would recommend working with your therapist on ways to feel safer (while talking about your past) and ways to step back from the memories. Usually stepping back is the hard part and you knowing you can't step back can cause your brain to block the memories altogether. Once I got better at those, it was easier to remember - still don't know it all, but that's fine - and these are quite useful skills for us.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please be careful. If you tear the hidden things free, it may be very hard to put them back. There might be a reason you can&amp;#39;t remember. As in, your brain might know what it&amp;#39;s doing by blocking. I would recommend working with your therapist on ways to feel safer (while talking about your past) and ways to step back from the memories. Usually stepping back is the hard part and you knowing you can&amp;#39;t step back can cause your brain to block the memories altogether. Once I got better at those, it was easier to remember - still don&amp;#39;t know it all, but that&amp;#39;s fine - and these are quite useful skills for us.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cxkjpwx", "score_hidden": false, "permalink": "/r/ptsd/comments/3v554j/digging_deeper/cxkjpwx/", "num_reports": null, "stickied": false, "created": 1449105017.0, "author_flair_text": null, "created_utc": 1449076217.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3v554j", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3v554j", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cxkexo4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "tweekytrap", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cxkdgc5", "score": 3, "approved_by": null, "downs": 0, "body": "I've done that with my recent traumas. I dream journal and some of my dreams are intensely disturbing and may be figment, or may have been reality. I wouldn't be able to discern rationally. My childhood memories started coming to the surface in more clarity since I've been medicated and dealt with my adulthood trauma.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve done that with my recent traumas. I dream journal and some of my dreams are intensely disturbing and may be figment, or may have been reality. I wouldn&amp;#39;t be able to discern rationally. My childhood memories started coming to the surface in more clarity since I&amp;#39;ve been medicated and dealt with my adulthood trauma.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cxkexo4", "score_hidden": false, "permalink": "/r/ptsd/comments/3v554j/digging_deeper/cxkexo4/", "num_reports": null, "stickied": false, "created": 1449097709.0, "author_flair_text": null, "created_utc": 1449068909.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cxkdgc5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "freshpondindian16", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3v554j", "score": 3, "approved_by": null, "downs": 0, "body": "I think that's fairly common with PTSD, i have problems remembering stuff from the event as well.  When you did therapy, was it CBT (Cognitive Behavioral Therapy)?  Part of my CBT involved writing a very long, very detailed description of the traumatic event.  It sucked, but helped me to eventually start to work through it.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that&amp;#39;s fairly common with PTSD, i have problems remembering stuff from the event as well.  When you did therapy, was it CBT (Cognitive Behavioral Therapy)?  Part of my CBT involved writing a very long, very detailed description of the traumatic event.  It sucked, but helped me to eventually start to work through it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cxkdgc5", "score_hidden": false, "permalink": "/r/ptsd/comments/3v554j/digging_deeper/cxkdgc5/", "num_reports": null, "stickied": false, "created": 1449094950.0, "author_flair_text": null, "created_utc": 1449066150.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]