[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2t5sa", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SRSDiscussion", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Last year, I read several articles about the issue of ignoring racial differences in order to solve racism. Lots of people called is colorblindness, although many people feel as ableist to use the term colorblind in this when you&amp;#39;re not referring to somebody who can&amp;#39;t see the full spectrum of colors that most people can see. Many people came to the realization that the best way to achieve Racial equality is to Simply ignore racial differences and to view people only as people and ignore whatever it is that makes them different. While this sounds like a good idea in theory, it often doesn&amp;#39;t work in practice. Many of the reasons why ignoring racial differences does not work are as follows. Ignoring racial differences is disingenuous, and it&amp;#39;s intellectually dishonest to say that one does not notice any difference between a black person and a white person. Another reason is that ignoring racial differences allows people to ignore in the race the fact that race has an impact on the life of person lives. Another reason is that ignoring racial differences implies that being black, for example, is a bad thing and should be ignored. Another reason is that it carries the unfortunate you have to ignore a fundamental part of somebody&amp;#39;s identity and Life Experiences in order to be able to treat them with respect. Another reason is that ignoring racial differences can result in not being able to solve more subtle forms of discrimination. MTV talked about this very point in a YouTube video as part of their decoded series. The Host said that there are three reasons why ignoring racial differences, does not work, and it differences she gave were the fact that black preschool students I just portion Italy more likely than white preschool students to be suspended in Seattle Public Schools, the fact that studies have found that people with Chinese or Indian names in Canada are less likely to receive call backs from interviews even if they have the exact same resumes as people with white sounding names, and the fact that there was lots of discrimination against people of color when it comes to trying to find apartments, and the fact that landlords will often tell people of color that no apartments are available, yet they will tell potential White tenants that there are apartments available to be toured.&lt;/p&gt;\n\n&lt;p&gt;With all these facts in mind, I&amp;#39;ve been wondering whether the idea of ignoring racial differences can be applied to other social identities.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gay.  It&amp;#39;s common for people to show their support and acceptance of gay people by telling them that they don&amp;#39;t care about their sexuality. But I&amp;#39;ve been thinking that perhaps that might not be the best way to show support, and that it could be counterproductive at best, and even contribute to the problem of homophobia much like how ignoring racial differences doesn&amp;#39;t solve the problem of racism at best, and at worst contributes to the problem of racism. I have had this discussion recently online, and I would share the link to the discussion, but I&amp;#39;m not sure if that would do any good. I will say that this was a community 4 gay men, and lots of people responded with hostility towards me for saying that I don&amp;#39;t want people to say that they don&amp;#39;t care if I&amp;#39;m gay.  That loving me includes loving every part of me includes my sexuality.They accused me of looking for reasons to be offended. They called me a social justice Warrior. They said sexuality is something that doesn&amp;#39;t matter. They said that a person can&amp;#39;t discriminate against somebody on the basis of your sexuality if they ignore it. They accuse me of saying that I want to be defined by my sexuality. I tried to counter by saying that you can acknowledge somebody&amp;#39;s sexuality, and still acknowledge every other part of them, as well as acknowledging them as a whole person and the individual parts of them. I tried to counter by saying that sexuality doesn&amp;#39;t matter whether we acknowledge it or not, whether we like it or not, because it does have an impact on how people go through life. And that you can&amp;#39;t say that sexuality doesn&amp;#39;t matter when they&amp;#39;re still people being discriminated against and even murdered because of it. But nobody would listen.&lt;/p&gt;\n\n&lt;p&gt;I guess what I&amp;#39;m wondering is who&amp;#39;s right in the situation? Can the concept of it being wrong to ignore racial differences be applied to other differences like sexuality or disability or gender or gender identity or class or any other category where some people are privileged and other people are oppressed?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Last year, I read several articles about the issue of ignoring racial differences in order to solve racism. Lots of people called is colorblindness, although many people feel as ableist to use the term colorblind in this when you're not referring to somebody who can't see the full spectrum of colors that most people can see. Many people came to the realization that the best way to achieve Racial equality is to Simply ignore racial differences and to view people only as people and ignore whatever it is that makes them different. While this sounds like a good idea in theory, it often doesn't work in practice. Many of the reasons why ignoring racial differences does not work are as follows. Ignoring racial differences is disingenuous, and it's intellectually dishonest to say that one does not notice any difference between a black person and a white person. Another reason is that ignoring racial differences allows people to ignore in the race the fact that race has an impact on the life of person lives. Another reason is that ignoring racial differences implies that being black, for example, is a bad thing and should be ignored. Another reason is that it carries the unfortunate you have to ignore a fundamental part of somebody's identity and Life Experiences in order to be able to treat them with respect. Another reason is that ignoring racial differences can result in not being able to solve more subtle forms of discrimination. MTV talked about this very point in a YouTube video as part of their decoded series. The Host said that there are three reasons why ignoring racial differences, does not work, and it differences she gave were the fact that black preschool students I just portion Italy more likely than white preschool students to be suspended in Seattle Public Schools, the fact that studies have found that people with Chinese or Indian names in Canada are less likely to receive call backs from interviews even if they have the exact same resumes as people with white sounding names, and the fact that there was lots of discrimination against people of color when it comes to trying to find apartments, and the fact that landlords will often tell people of color that no apartments are available, yet they will tell potential White tenants that there are apartments available to be toured.\n\nWith all these facts in mind, I've been wondering whether the idea of ignoring racial differences can be applied to other social identities.\n\nI'm gay.  It's common for people to show their support and acceptance of gay people by telling them that they don't care about their sexuality. But I've been thinking that perhaps that might not be the best way to show support, and that it could be counterproductive at best, and even contribute to the problem of homophobia much like how ignoring racial differences doesn't solve the problem of racism at best, and at worst contributes to the problem of racism. I have had this discussion recently online, and I would share the link to the discussion, but I'm not sure if that would do any good. I will say that this was a community 4 gay men, and lots of people responded with hostility towards me for saying that I don't want people to say that they don't care if I'm gay.  That loving me includes loving every part of me includes my sexuality.They accused me of looking for reasons to be offended. They called me a social justice Warrior. They said sexuality is something that doesn't matter. They said that a person can't discriminate against somebody on the basis of your sexuality if they ignore it. They accuse me of saying that I want to be defined by my sexuality. I tried to counter by saying that you can acknowledge somebody's sexuality, and still acknowledge every other part of them, as well as acknowledging them as a whole person and the individual parts of them. I tried to counter by saying that sexuality doesn't matter whether we acknowledge it or not, whether we like it or not, because it does have an impact on how people go through life. And that you can't say that sexuality doesn't matter when they're still people being discriminated against and even murdered because of it. But nobody would listen.\n\nI guess what I'm wondering is who's right in the situation? Can the concept of it being wrong to ignore racial differences be applied to other differences like sexuality or disability or gender or gender identity or class or any other category where some people are privileged and other people are oppressed?", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "7ast3o", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "no_follow": false, "author": "RJSAE", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 10, "approved_by": null, "over_18": false, "domain": "self.SRSDiscussion", "hidden": false, "num_comments": 4, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 14120, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_7ast3o", "spoiler": false, "permalink": "/r/SRSDiscussion/comments/7ast3o/in_social_justice_circles_the_idea_of_ignoring/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1509853355.0, "url": "https://www.reddit.com/r/SRSDiscussion/comments/7ast3o/in_social_justice_circles_the_idea_of_ignoring/", "author_flair_text": null, "quarantine": false, "title": "In social justice circles, the idea of ignoring racial differences is often viewed with disdain, and being counterproductive at best. Is the same true for other social differences.", "created_utc": 1509824555.0, "subreddit_name_prefixed": "r/SRSDiscussion", "distinguished": null, "media": null, "upvote_ratio": 0.73, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 10}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 10, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7ast3o", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 7, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7ast3o", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dpcl15n", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "RJSAE", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dpck7qa", "score": 7, "approved_by": null, "downs": 0, "body": "That's what I've been thinking. What you said in your last paragraph. That the most privileged of gay men are less likely to recognize oppression.  Especially if they went through life mostly accepted for being  gay. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what I&amp;#39;ve been thinking. What you said in your last paragraph. That the most privileged of gay men are less likely to recognize oppression.  Especially if they went through life mostly accepted for being  gay. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_dpcl15n", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/7ast3o/in_social_justice_circles_the_idea_of_ignoring/dpcl15n/", "num_reports": null, "stickied": false, "created": 1509857320.0, "author_flair_text": null, "created_utc": 1509828520.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dpck7qa", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "cool_and_nice", "can_mod_post": false, "send_replies": true, "parent_id": "t3_7ast3o", "score": 10, "approved_by": null, "downs": 0, "body": "That's what intersectionality is all about, right?\n\nRace is one facet of your identity that determines how society will treat you. Sexuality is another, as are gender, physical/mental ability, age, etc. \n\nIgnoring a facet of your identity that impacts how you're treated in society is just as problematic as ignoring race. Saying \"sexuality doesn't matter\" would be a nice sentiment if people of all sexualities were treated fairly in the modern day, but of course we all know they aren't, and such a sentiment can be seen less as a vote of solidarity and more of an erasure of your identity and willfull ignorance of the problems you face. \n\nAnd, eh, *in general*, white cis gay men are less oppressed than other divergent sexualities and would be less likely to recognize it, which might explain why they were so hostile to you. As a trans lesbian I can tell you cis gay men can be pretty biased in their own ways. ", "edited": 1509827918.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s what intersectionality is all about, right?&lt;/p&gt;\n\n&lt;p&gt;Race is one facet of your identity that determines how society will treat you. Sexuality is another, as are gender, physical/mental ability, age, etc. &lt;/p&gt;\n\n&lt;p&gt;Ignoring a facet of your identity that impacts how you&amp;#39;re treated in society is just as problematic as ignoring race. Saying &amp;quot;sexuality doesn&amp;#39;t matter&amp;quot; would be a nice sentiment if people of all sexualities were treated fairly in the modern day, but of course we all know they aren&amp;#39;t, and such a sentiment can be seen less as a vote of solidarity and more of an erasure of your identity and willfull ignorance of the problems you face. &lt;/p&gt;\n\n&lt;p&gt;And, eh, &lt;em&gt;in general&lt;/em&gt;, white cis gay men are less oppressed than other divergent sexualities and would be less likely to recognize it, which might explain why they were so hostile to you. As a trans lesbian I can tell you cis gay men can be pretty biased in their own ways. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_dpck7qa", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/7ast3o/in_social_justice_circles_the_idea_of_ignoring/dpck7qa/", "num_reports": null, "stickied": false, "created": 1509856322.0, "author_flair_text": null, "created_utc": 1509827522.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7ast3o", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dpd14lc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sponge_bob_", "can_mod_post": false, "send_replies": true, "parent_id": "t3_7ast3o", "score": 2, "approved_by": null, "downs": 0, "body": "&gt; the best way to achieve Racial equality is to Simply ignore racial differences and to view people only as people and ignore whatever it is that makes them different\n\ni would agree that people should be seen as people but ignoring what makes people different is not what makes a team excel. It's better in my opinion to have five people each good in one field than five all rounders.\n\n&gt;It's common for people to show their support and acceptance of gay people by telling them that they don't care about their sexuality\n\nI think actions speak louder than words. Equality is a positive trend and people want to be seen as on board. What better way to quickly show your peers with minimal effort than to say \"I support homosexuals\" out loud?\n\n&gt;Can the concept of it being wrong to ignore racial differences be applied to other differences like sexuality or disability or gender or gender identity or class or any other category where some people are privileged and other people are oppressed?\n\nIt is wrong to ignore differences. You can't deal with a problem without acknowledging it. Imagine, a black family and white family were trying to buy a home. Are you really going to ignore the difference in income averages and charge them both the same for the house? You shouldn't! \n\nThe bigger question is, how can you adjust so it's fair to all parties.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;the best way to achieve Racial equality is to Simply ignore racial differences and to view people only as people and ignore whatever it is that makes them different&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;i would agree that people should be seen as people but ignoring what makes people different is not what makes a team excel. It&amp;#39;s better in my opinion to have five people each good in one field than five all rounders.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s common for people to show their support and acceptance of gay people by telling them that they don&amp;#39;t care about their sexuality&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I think actions speak louder than words. Equality is a positive trend and people want to be seen as on board. What better way to quickly show your peers with minimal effort than to say &amp;quot;I support homosexuals&amp;quot; out loud?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can the concept of it being wrong to ignore racial differences be applied to other differences like sexuality or disability or gender or gender identity or class or any other category where some people are privileged and other people are oppressed?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It is wrong to ignore differences. You can&amp;#39;t deal with a problem without acknowledging it. Imagine, a black family and white family were trying to buy a home. Are you really going to ignore the difference in income averages and charge them both the same for the house? You shouldn&amp;#39;t! &lt;/p&gt;\n\n&lt;p&gt;The bigger question is, how can you adjust so it&amp;#39;s fair to all parties.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_dpd14lc", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/7ast3o/in_social_justice_circles_the_idea_of_ignoring/dpd14lc/", "num_reports": null, "stickied": false, "created": 1509877520.0, "author_flair_text": null, "created_utc": 1509848720.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2t5sa", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_7ast3o", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dpwv7cw", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "sunkindonut149", "can_mod_post": false, "send_replies": true, "parent_id": "t3_7ast3o", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;It's common for people to show their support and acceptance of gay people by telling them that they don't care about their sexuality.\n\nThis is the same as \"I don't see color\" ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;It&amp;#39;s common for people to show their support and acceptance of gay people by telling them that they don&amp;#39;t care about their sexuality.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This is the same as &amp;quot;I don&amp;#39;t see color&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SRSDiscussion", "name": "t1_dpwv7cw", "score_hidden": false, "permalink": "/r/SRSDiscussion/comments/7ast3o/in_social_justice_circles_the_idea_of_ignoring/dpwv7cw/", "num_reports": null, "stickied": false, "created": 1510877457.0, "author_flair_text": null, "created_utc": 1510848657.0, "subreddit_name_prefixed": "r/SRSDiscussion", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]