[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I could use some advice or maybe even someone to talk to. I don&amp;#39;t really have any friends I can rely on. The only one I can is unavailable for a while, my other friends are quite frankly pieces of shit and get pissed and annoyed by me, though I guess I kinda annoy everyone.&lt;/p&gt;\n\n&lt;p&gt;So one of my main issues in my life is not feeling I have anyone to talk to, and I kinda need someone to talk to (maybe who is experienced but open-minded about &amp;quot;love&amp;quot;). The reason this is on &lt;a href=\"/r/Depression\"&gt;r/Depression&lt;/a&gt; is because I struggle with depression and my insecurities, which then factor in to my love life very often. I really like this one girl and we&amp;#39;ve known each other for a year. I&amp;#39;ll call her Delilah (not her real name). Delilah is a shy person and because of that I have had trouble getting to know her, though there have been times when she&amp;#39;s opened up and times when she&amp;#39;s super closed off. She has told me that she has many insecurities, though the only one I know of is that she doesn&amp;#39;t think she&amp;#39;s beautiful (which is simply not true).&lt;/p&gt;\n\n&lt;p&gt;To save your time and get closer to the point, I&amp;#39;ll summarize the best I can. Basically, she flirted a lot with me in school, but got shy when we were actually talking and alone together. I&amp;#39;ve never seen or noticed her blushing during these times, but we would both awkwardly try to keep the conversation going. Fast forward to summer where we texted a lot about the most random stuff, having a good time, even hung out (not sure we&amp;#39;d call it a date) and got coffee once, and we said it was nice seeing each other (she was super shy and nervous on the trip, but opened up a bit more as it went on).&lt;/p&gt;\n\n&lt;p&gt;Fast forward to now and I&amp;#39;m not sure if it was something that I missed my chance or what? I asked her to the movies, but we never got to go since she was busy all the time (not angry or blaming her though, she has tough classes and hangs out with her family a lot). When we text nowadays the conversations are usually pretty short, and she doesn&amp;#39;t like goofing around like we used to. I off and on think she likes me obviously, then other times I think she hates me (part of a common distorted thinking pattern or two if you want to get psychological about it).&lt;/p&gt;\n\n&lt;p&gt;Delilah has done and said things that should make it obvious, I feel. She once gave (demanded to give) me a ride in the rain once, we went out for coffee and during she said that we&amp;#39;d probably do it again sometime, when I first asked her to the movies she was excited. She has complimented me several times and told me I deserved them. Recently, despite not texting me as much, she has tried putting more emotion into her texts (she rarely did before).&lt;/p&gt;\n\n&lt;p&gt;Sorry if this sounds stupidly obvious, it&amp;#39;s just that I have little confidence in myself despite knowing I&amp;#39;m a good guy (I think, sometimes I think I&amp;#39;m not good enough for anyone let alone her). Delilah&amp;#39;s done all those things and maybe some others, but every time something bad or questionable happens I start to think she hates me and I think I should give up. So, if you could spare your time and give me advice on how this all sounds, what I could possibly try to prevent thinking she hates me and such, or anything else I&amp;#39;d really appreciate it.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Sorry for the long post&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I could use some advice or maybe even someone to talk to. I don't really have any friends I can rely on. The only one I can is unavailable for a while, my other friends are quite frankly pieces of shit and get pissed and annoyed by me, though I guess I kinda annoy everyone.\n\nSo one of my main issues in my life is not feeling I have anyone to talk to, and I kinda need someone to talk to (maybe who is experienced but open-minded about \"love\"). The reason this is on r/Depression is because I struggle with depression and my insecurities, which then factor in to my love life very often. I really like this one girl and we've known each other for a year. I'll call her Delilah (not her real name). Delilah is a shy person and because of that I have had trouble getting to know her, though there have been times when she's opened up and times when she's super closed off. She has told me that she has many insecurities, though the only one I know of is that she doesn't think she's beautiful (which is simply not true).\n\nTo save your time and get closer to the point, I'll summarize the best I can. Basically, she flirted a lot with me in school, but got shy when we were actually talking and alone together. I've never seen or noticed her blushing during these times, but we would both awkwardly try to keep the conversation going. Fast forward to summer where we texted a lot about the most random stuff, having a good time, even hung out (not sure we'd call it a date) and got coffee once, and we said it was nice seeing each other (she was super shy and nervous on the trip, but opened up a bit more as it went on).\n\nFast forward to now and I'm not sure if it was something that I missed my chance or what? I asked her to the movies, but we never got to go since she was busy all the time (not angry or blaming her though, she has tough classes and hangs out with her family a lot). When we text nowadays the conversations are usually pretty short, and she doesn't like goofing around like we used to. I off and on think she likes me obviously, then other times I think she hates me (part of a common distorted thinking pattern or two if you want to get psychological about it).\n \nDelilah has done and said things that should make it obvious, I feel. She once gave (demanded to give) me a ride in the rain once, we went out for coffee and during she said that we'd probably do it again sometime, when I first asked her to the movies she was excited. She has complimented me several times and told me I deserved them. Recently, despite not texting me as much, she has tried putting more emotion into her texts (she rarely did before).\n\nSorry if this sounds stupidly obvious, it's just that I have little confidence in myself despite knowing I'm a good guy (I think, sometimes I think I'm not good enough for anyone let alone her). Delilah's done all those things and maybe some others, but every time something bad or questionable happens I start to think she hates me and I think I should give up. So, if you could spare your time and give me advice on how this all sounds, what I could possibly try to prevent thinking she hates me and such, or anything else I'd really appreciate it.\n\n**Sorry for the long post**", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "5afbq8", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "DeerInTheHeadlights9", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 0, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338992, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_5afbq8", "spoiler": false, "permalink": "/r/depression/comments/5afbq8/depressioninsecurity_with_romance_issues/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1477980164.0, "url": "https://www.reddit.com/r/depression/comments/5afbq8/depressioninsecurity_with_romance_issues/", "author_flair_text": null, "quarantine": false, "title": "Depression/Insecurity With Romance Issues", "created_utc": 1477951364.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [], "before": null}}]