[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2smsq", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "InsightfulQuestions", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;What I try to mean is that, although sometimes we can make the decision to forgive someone, for a logical reason, and even though we want to do it, our subconscious doesn&amp;#39;t let us do it at 100%, creating grief. Otherwise, sometimes we don&amp;#39;t have any logical reason to do it, but still we feel like we should.&lt;/p&gt;\n\n&lt;p&gt;So, are we humans really able to learn how to forgive? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "What I try to mean is that, although sometimes we can make the decision to forgive someone, for a logical reason, and even though we want to do it, our subconscious doesn't let us do it at 100%, creating grief. Otherwise, sometimes we don't have any logical reason to do it, but still we feel like we should.\n\nSo, are we humans really able to learn how to forgive? ", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "73psvp", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": false, "clicked": false, "no_follow": false, "author": "basc92", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 9, "approved_by": null, "over_18": false, "domain": "self.InsightfulQuestions", "hidden": false, "num_comments": 10, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 51291, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_73psvp", "spoiler": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1506936460.0, "url": "https://www.reddit.com/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/", "author_flair_text": null, "quarantine": false, "title": "Is forgiveness something you choose rationally or an instinct?", "created_utc": 1506907660.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "distinguished": null, "media": null, "upvote_ratio": 0.77, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 9}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 5, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dnzdptu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "codebuster123", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dnsbsj5", "score": 2, "approved_by": null, "downs": 0, "body": "Thank you, just reading this made me feel good.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you, just reading this made me feel good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnzdptu", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnzdptu/", "num_reports": null, "stickied": false, "created": 1507303259.0, "author_flair_text": null, "created_utc": 1507274459.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dnsbsj5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "auntieup", "can_mod_post": false, "send_replies": true, "parent_id": "t3_73psvp", "score": 5, "approved_by": null, "downs": 0, "body": "I think if you look at life, grief and forgiveness are two points in a really long process that doesn't have a name -- unless it's Life. So in that sense, forgiveness is both instinct and decision, since we need both feeling and thought to make changes.\n\nAfter someone or something has personally hurt you, there's a raw period when forgiveness is not possible. This period feels like a long time, whether it is or not, because you're inside it and you're hurting in a way you can't easily articulate. \n\nAfter this time passes, you'll be numb for a while, and relieved. You'll have chances to forgive. Some of these chances will feel like sharp reminders of that original injury, so you won't reach out for them. But then a chance will present itself, either subtly or obviously, and it won't feel like a violation. It'll just be *there,* and you'll end up investigating it of your own volition.\n\nThis event, occasion, work of art, person, whatever: it will remind you of the original injury in a way that gives you space to forgive what happened in your life. This doesn't mean you'll magically get some kind of apology or resolution: that never happens. What you will be able to do is put the injury to rest, and grow beyond it. Your active grieving will simply stop.\n\nYou will still be sad when you think of that old injury. Your life will still be changed by it. But forgiveness is the end of the grieving process, and the first step of your growth forward, to whatever you're going to do next. \n\nI hope this makes sense. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think if you look at life, grief and forgiveness are two points in a really long process that doesn&amp;#39;t have a name -- unless it&amp;#39;s Life. So in that sense, forgiveness is both instinct and decision, since we need both feeling and thought to make changes.&lt;/p&gt;\n\n&lt;p&gt;After someone or something has personally hurt you, there&amp;#39;s a raw period when forgiveness is not possible. This period feels like a long time, whether it is or not, because you&amp;#39;re inside it and you&amp;#39;re hurting in a way you can&amp;#39;t easily articulate. &lt;/p&gt;\n\n&lt;p&gt;After this time passes, you&amp;#39;ll be numb for a while, and relieved. You&amp;#39;ll have chances to forgive. Some of these chances will feel like sharp reminders of that original injury, so you won&amp;#39;t reach out for them. But then a chance will present itself, either subtly or obviously, and it won&amp;#39;t feel like a violation. It&amp;#39;ll just be &lt;em&gt;there,&lt;/em&gt; and you&amp;#39;ll end up investigating it of your own volition.&lt;/p&gt;\n\n&lt;p&gt;This event, occasion, work of art, person, whatever: it will remind you of the original injury in a way that gives you space to forgive what happened in your life. This doesn&amp;#39;t mean you&amp;#39;ll magically get some kind of apology or resolution: that never happens. What you will be able to do is put the injury to rest, and grow beyond it. Your active grieving will simply stop.&lt;/p&gt;\n\n&lt;p&gt;You will still be sad when you think of that old injury. Your life will still be changed by it. But forgiveness is the end of the grieving process, and the first step of your growth forward, to whatever you&amp;#39;re going to do next. &lt;/p&gt;\n\n&lt;p&gt;I hope this makes sense. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnsbsj5", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnsbsj5/", "num_reports": null, "stickied": false, "created": 1506944312.0, "author_flair_text": null, "created_utc": 1506915512.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dnse1id", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "_justpassingby_", "can_mod_post": false, "send_replies": true, "parent_id": "t3_73psvp", "score": 2, "approved_by": null, "downs": 0, "body": "If we view forgiveness as a practical concept, and not just some groundless spiritual ceremony, then forgiveness is closely tied to a re-installment of trust. There's a strong biological imperative to remember the causes of negative effects. If we ascribe a negative consequence to a particular person- to trusting a particular person- then it makes sense that it's not as simple as reaching a superficial \"logical\" position from which we can assure ourselves that the situation will not repeat if we re-install the trust. \n\nIf we're socially indoctrinated to forgive certain things in certain ways given a certain amount of time, we can start to feel that pressure masquerading as \"logic\". On the other hand, if the negative consequences of a person's actions impacted us deeply, then our biological imperatives could impede a reasonable judgement that things *are* different. \n\nSo we can learn to forgive in that we can learn to combat our biases and see more clearly whether forgiveness is necessary (i.e. is there a benefit to purify this person's image?) and reasonable (i.e. is there enough evidence that the situation has changed enough to prevent another negative event). I think subconscious resistance could mean any number of things, but one might be that we are trying to convince ourselves forgiveness is warranted, when the evidence is lacking. \n\nI don't think we have to forgive to \"move on\".\n\n(edit) It's also important to consider that things requiring forgiveness are generally emotionally charged- and this emotional charge is very conducive to a \"lesson well learned\" - we're more likely to remember these lessons in a deep way. Forgiveness, on the other hand, is not really an emotionally charged experience- it's either (or both) a slow waning of emotional connection between a negative event and a person, and an analytical series of steps removing that person from a repeat occurance. If we rely on an analytical approach to reach a state of forgiveness- or to inform us when we've reached forgiveness- we're neglecting the power and validity of our emotional roots.", "edited": 1506920563.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If we view forgiveness as a practical concept, and not just some groundless spiritual ceremony, then forgiveness is closely tied to a re-installment of trust. There&amp;#39;s a strong biological imperative to remember the causes of negative effects. If we ascribe a negative consequence to a particular person- to trusting a particular person- then it makes sense that it&amp;#39;s not as simple as reaching a superficial &amp;quot;logical&amp;quot; position from which we can assure ourselves that the situation will not repeat if we re-install the trust. &lt;/p&gt;\n\n&lt;p&gt;If we&amp;#39;re socially indoctrinated to forgive certain things in certain ways given a certain amount of time, we can start to feel that pressure masquerading as &amp;quot;logic&amp;quot;. On the other hand, if the negative consequences of a person&amp;#39;s actions impacted us deeply, then our biological imperatives could impede a reasonable judgement that things &lt;em&gt;are&lt;/em&gt; different. &lt;/p&gt;\n\n&lt;p&gt;So we can learn to forgive in that we can learn to combat our biases and see more clearly whether forgiveness is necessary (i.e. is there a benefit to purify this person&amp;#39;s image?) and reasonable (i.e. is there enough evidence that the situation has changed enough to prevent another negative event). I think subconscious resistance could mean any number of things, but one might be that we are trying to convince ourselves forgiveness is warranted, when the evidence is lacking. &lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think we have to forgive to &amp;quot;move on&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;(edit) It&amp;#39;s also important to consider that things requiring forgiveness are generally emotionally charged- and this emotional charge is very conducive to a &amp;quot;lesson well learned&amp;quot; - we&amp;#39;re more likely to remember these lessons in a deep way. Forgiveness, on the other hand, is not really an emotionally charged experience- it&amp;#39;s either (or both) a slow waning of emotional connection between a negative event and a person, and an analytical series of steps removing that person from a repeat occurance. If we rely on an analytical approach to reach a state of forgiveness- or to inform us when we&amp;#39;ve reached forgiveness- we&amp;#39;re neglecting the power and validity of our emotional roots.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnse1id", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnse1id/", "num_reports": null, "stickied": false, "created": 1506947993.0, "author_flair_text": null, "created_utc": 1506919193.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dnwy8jm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "auntieup", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dnvwbtb", "score": 1, "approved_by": null, "downs": 0, "body": "Agree. But forgiveness also has a lot to do with your support system, whether in the field (if you're in combat with others, or in a terrible relationship and confiding with another adult who sympathizes) or after the trauma. A loving community can make all the difference between a survivor choosing forgiveness over resentment. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Agree. But forgiveness also has a lot to do with your support system, whether in the field (if you&amp;#39;re in combat with others, or in a terrible relationship and confiding with another adult who sympathizes) or after the trauma. A loving community can make all the difference between a survivor choosing forgiveness over resentment. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnwy8jm", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnwy8jm/", "num_reports": null, "stickied": false, "created": 1507181843.0, "author_flair_text": null, "created_utc": 1507153043.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dnvwbtb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "mgale85", "can_mod_post": false, "send_replies": true, "parent_id": "t3_73psvp", "score": 2, "approved_by": null, "downs": 0, "body": "I feel as though I have the capacity to justify any action by any type of person or group of people.  Every single thing that's ever been done, the worst of it; mass murder, rape, torture.  I can think about that person or that culture's background, environment, or even their genetics.  Nothing is anyone's fault if you look back far or look deep enough.  It's all a reaction in a series of events.  I think that kind of justification is a learned thing, that can be improved with better science and emotional education.\n\nJustification can a lot of times feel like forgiveness.  But it's really not.  Forgiveness is a personal thing.  Your ability to forgive is based so much on your personal experiences, your personal emotional intelligence, and what has become important to you over time.  Of course, being able to recognize that your personal experiences and intelligence may not be 100% fact, and striving to improve in those areas, can help you forgive more frequently or wholly.  But it's really tough to be able to recognize that.  And emotions can be absolutely blinding, especially at first when they are the most strong.\n\n", "edited": 1507103006.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I feel as though I have the capacity to justify any action by any type of person or group of people.  Every single thing that&amp;#39;s ever been done, the worst of it; mass murder, rape, torture.  I can think about that person or that culture&amp;#39;s background, environment, or even their genetics.  Nothing is anyone&amp;#39;s fault if you look back far or look deep enough.  It&amp;#39;s all a reaction in a series of events.  I think that kind of justification is a learned thing, that can be improved with better science and emotional education.&lt;/p&gt;\n\n&lt;p&gt;Justification can a lot of times feel like forgiveness.  But it&amp;#39;s really not.  Forgiveness is a personal thing.  Your ability to forgive is based so much on your personal experiences, your personal emotional intelligence, and what has become important to you over time.  Of course, being able to recognize that your personal experiences and intelligence may not be 100% fact, and striving to improve in those areas, can help you forgive more frequently or wholly.  But it&amp;#39;s really tough to be able to recognize that.  And emotions can be absolutely blinding, especially at first when they are the most strong.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnvwbtb", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnvwbtb/", "num_reports": null, "stickied": false, "created": 1507131126.0, "author_flair_text": null, "created_utc": 1507102326.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dnwyvlg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "basc92", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dnwy0se", "score": 2, "approved_by": null, "downs": 0, "body": "Thank you very much for the contribution. Really good info here.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you very much for the contribution. Really good info here.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnwyvlg", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnwyvlg/", "num_reports": null, "stickied": false, "created": 1507182565.0, "author_flair_text": null, "created_utc": 1507153765.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dnwy0se", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "auntieup", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dntakf5", "score": 2, "approved_by": null, "downs": 0, "body": "I want to weigh in with some info my sister-in-law (a psychiatric researcher at Bellevue) has told me. While survivors of trauma can heal physically, more frequent trauma changes not just the brain's neural pathways but the lifespan. Studies on this go back to World War 1.\n\nWhat this means is that many soldiers who see heavy action, sexual assault or child abuse survivors, or people held against their will in hostile situations, will *learn* depression - or its darker half, aggression - and make lifelong habits of them. (This includes the inability to forgive.) These traumatized survivors also tend not to live as long as others in their cohort, not just because of physical trauma, but because their brains aren't conditioned for hope, optimism, or persistence. \n\nIn short, learning forgiveness saves lives. It's worth investigating, if only for that. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want to weigh in with some info my sister-in-law (a psychiatric researcher at Bellevue) has told me. While survivors of trauma can heal physically, more frequent trauma changes not just the brain&amp;#39;s neural pathways but the lifespan. Studies on this go back to World War 1.&lt;/p&gt;\n\n&lt;p&gt;What this means is that many soldiers who see heavy action, sexual assault or child abuse survivors, or people held against their will in hostile situations, will &lt;em&gt;learn&lt;/em&gt; depression - or its darker half, aggression - and make lifelong habits of them. (This includes the inability to forgive.) These traumatized survivors also tend not to live as long as others in their cohort, not just because of physical trauma, but because their brains aren&amp;#39;t conditioned for hope, optimism, or persistence. &lt;/p&gt;\n\n&lt;p&gt;In short, learning forgiveness saves lives. It&amp;#39;s worth investigating, if only for that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnwy0se", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnwy0se/", "num_reports": null, "stickied": false, "created": 1507181599.0, "author_flair_text": null, "created_utc": 1507152799.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2smsq", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_73psvp", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dnte8sh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "nukefudge", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dntakf5", "score": 1, "approved_by": null, "downs": 0, "body": "I wouldn't reduce forgiveness to biochemistry. The process is more extended than that - taking into account the surroundings of the person in question. Whether or not such a situation will remain unresolved depends at least in part on the larger dynamic the person is embedded in.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wouldn&amp;#39;t reduce forgiveness to biochemistry. The process is more extended than that - taking into account the surroundings of the person in question. Whether or not such a situation will remain unresolved depends at least in part on the larger dynamic the person is embedded in.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnte8sh", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnte8sh/", "num_reports": null, "stickied": false, "created": 1507004329.0, "author_flair_text": null, "created_utc": 1506975529.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dntakf5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "basc92", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dnt9qsb", "score": 2, "approved_by": null, "downs": 0, "body": "Hi Nukefudge, I agree with you that I might have not been clear enough, maybe due to a linguistic barrier. In simple terms, what I mean is that a lot of people talk about forgiving as if it was something that you aquire through social and cultural contact with your peers, although, there are situations, v.g. if your partner cheats on you, that you might want to overcome it, and though your rational part really wants to forgive, you just can't. It just feels like a trauma. Do you think that some events in your life can biochemically change the nature of the limbic system in such a permanent way that forgiveness is something that can't be achieved due to a physical condition?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi Nukefudge, I agree with you that I might have not been clear enough, maybe due to a linguistic barrier. In simple terms, what I mean is that a lot of people talk about forgiving as if it was something that you aquire through social and cultural contact with your peers, although, there are situations, v.g. if your partner cheats on you, that you might want to overcome it, and though your rational part really wants to forgive, you just can&amp;#39;t. It just feels like a trauma. Do you think that some events in your life can biochemically change the nature of the limbic system in such a permanent way that forgiveness is something that can&amp;#39;t be achieved due to a physical condition?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dntakf5", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dntakf5/", "num_reports": null, "stickied": false, "created": 1507000453.0, "author_flair_text": null, "created_utc": 1506971653.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dnt9qsb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "report_reasons": null, "author": "nukefudge", "can_mod_post": false, "send_replies": true, "parent_id": "t3_73psvp", "score": 1, "approved_by": null, "downs": 0, "body": "This is the kind of question that's hard to answer because you use words like \"rationally\", \"instinct\", \"subconscious\" and \"logical\", and we've no idea where you got them from and how exactly they figure in your understanding.\n\nAt a glance, it sounds to me like you've got a slightly simplistic view of the human condition, and you may be relying on defunct concepts - which could be part of the confusion that brought you here in the first place.\n\nForgiveness, if anything, is a process of shorter or longer duration, with many factors involved, that require a lot of talk to get at. I don't think your premises seem quite solid enough to actually hook onto the phenomena proper.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This is the kind of question that&amp;#39;s hard to answer because you use words like &amp;quot;rationally&amp;quot;, &amp;quot;instinct&amp;quot;, &amp;quot;subconscious&amp;quot; and &amp;quot;logical&amp;quot;, and we&amp;#39;ve no idea where you got them from and how exactly they figure in your understanding.&lt;/p&gt;\n\n&lt;p&gt;At a glance, it sounds to me like you&amp;#39;ve got a slightly simplistic view of the human condition, and you may be relying on defunct concepts - which could be part of the confusion that brought you here in the first place.&lt;/p&gt;\n\n&lt;p&gt;Forgiveness, if anything, is a process of shorter or longer duration, with many factors involved, that require a lot of talk to get at. I don&amp;#39;t think your premises seem quite solid enough to actually hook onto the phenomena proper.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "InsightfulQuestions", "name": "t1_dnt9qsb", "score_hidden": false, "permalink": "/r/InsightfulQuestions/comments/73psvp/is_forgiveness_something_you_choose_rationally_or/dnt9qsb/", "num_reports": null, "stickied": false, "created": 1506999570.0, "author_flair_text": null, "created_utc": 1506970770.0, "subreddit_name_prefixed": "r/InsightfulQuestions", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]