[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2w2s8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s almost impossible to have any kind of discussion about the culture of another land without talking about food. We all agree that travelling is an enriching experience, as is meeting people totally different from your self. The same is said of eating foreign food (especially when you&amp;#39;re actually in the land). &lt;/p&gt;\n\n&lt;p&gt;When talking about immigration/multiculturalism, a lot is said about the different kinds of restaurants we benefit from, how we can try things we&amp;#39;ve never tried before. How greater choice is so enriching. &lt;/p&gt;\n\n&lt;p&gt;And I just don&amp;#39;t get it. If you want culture, just pick up a book. Talk to somebody. Go online. &lt;/p&gt;\n\n&lt;p&gt;From an historical anthropological point of view, I know looking at food is a good jumping point in learning about religion, what tools were available at the time, what crops people had, what the main trade was etc. That&amp;#39;s fine. &lt;/p&gt;\n\n&lt;p&gt;What I&amp;#39;m talking about is the modern day treatment like my immigration example (and please, no immigration debates). Dropping a lot of foreign-style restaurants into your city does practically zero in adding any real understanding or appreciation of a culture. Yes, people who live close to the sea have a lot of seafood - great. Some people use their hands instead of utensils - good to know. With art you can tell a story, show what people value, reveal facts. Food is just food. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m open to change because a lot of people seem to think otherwise and my passionless utilitarian view of food may be clouding my judgment. When it comes to social stuff I can sometimes miss the obvious.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "It's almost impossible to have any kind of discussion about the culture of another land without talking about food. We all agree that travelling is an enriching experience, as is meeting people totally different from your self. The same is said of eating foreign food (especially when you're actually in the land). \n\nWhen talking about immigration/multiculturalism, a lot is said about the different kinds of restaurants we benefit from, how we can try things we've never tried before. How greater choice is so enriching. \n\nAnd I just don't get it. If you want culture, just pick up a book. Talk to somebody. Go online. \n\nFrom an historical anthropological point of view, I know looking at food is a good jumping point in learning about religion, what tools were available at the time, what crops people had, what the main trade was etc. That's fine. \n\nWhat I'm talking about is the modern day treatment like my immigration example (and please, no immigration debates). Dropping a lot of foreign-style restaurants into your city does practically zero in adding any real understanding or appreciation of a culture. Yes, people who live close to the sea have a lot of seafood - great. Some people use their hands instead of utensils - good to know. With art you can tell a story, show what people value, reveal facts. Food is just food. \n\nI'm open to change because a lot of people seem to think otherwise and my passionless utilitarian view of food may be clouding my judgment. When it comes to social stuff I can sometimes miss the obvious.", "likes": null, "suggested_sort": "qa", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "68i6u1", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "FreeAsInFreedoooooom", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 24, "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "num_comments": 30, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 539231, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_68i6u1", "spoiler": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1493618922.0, "url": "https://www.reddit.com/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/", "author_flair_text": null, "quarantine": false, "title": "CMV: Eating and generally learning about food from other cultures does virtually nothing to educate you or broaden your mind with respect to said cultures", "created_utc": 1493590122.0, "subreddit_name_prefixed": "r/changemyview", "distinguished": null, "media": null, "upvote_ratio": 0.75, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 24}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 23, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": -3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 18, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": false, "replies": "", "user_reports": [], "saved": false, "id": "dgyrkcc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "McKoijion", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyq3l0", "score": 18, "approved_by": null, "downs": 0, "body": "&gt; Maybe I'm out of touch, but don't most people just have their food and that's it?\n\nThere is a popular tv channel called the Food Network. People watch other people cook and eat food. They can't smell it, touch it, or taste it. But they watch it anyways. I think food is about a lot more than mere sustenance. I'd argue that it's the most important part of culture. People don't see fine art everyday. They listen to music maybe once a week or maybe once a day. But people eat things three or more times a day, everyday, for their entire life.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Maybe I&amp;#39;m out of touch, but don&amp;#39;t most people just have their food and that&amp;#39;s it?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There is a popular tv channel called the Food Network. People watch other people cook and eat food. They can&amp;#39;t smell it, touch it, or taste it. But they watch it anyways. I think food is about a lot more than mere sustenance. I&amp;#39;d argue that it&amp;#39;s the most important part of culture. People don&amp;#39;t see fine art everyday. They listen to music maybe once a week or maybe once a day. But people eat things three or more times a day, everyday, for their entire life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyrkcc", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyrkcc/", "num_reports": null, "stickied": false, "created": 1493625211.0, "author_flair_text": "229∆", "created_utc": 1493596411.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 8, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": false, "replies": "", "user_reports": [], "saved": false, "id": "dgysrrc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "InsidiousDefeat", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyq3l0", "score": 8, "approved_by": null, "downs": 0, "body": "I'm literally in Vietnam now. I agreed with you until I was here in Thailand/Cambodia/Vietnam. Meals and food outside the US are a much more communal thing. At restaurants, my friend and I order, eat, then have to ask to pay because they will never come with the check. They seem baffled by our desire to eat and immediately leave. So this is an example of a meal going beyond just the food in front of you. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m literally in Vietnam now. I agreed with you until I was here in Thailand/Cambodia/Vietnam. Meals and food outside the US are a much more communal thing. At restaurants, my friend and I order, eat, then have to ask to pay because they will never come with the check. They seem baffled by our desire to eat and immediately leave. So this is an example of a meal going beyond just the food in front of you. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgysrrc", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgysrrc/", "num_reports": null, "stickied": false, "created": 1493626931.0, "author_flair_text": null, "created_utc": 1493598131.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 4, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": false, "replies": "", "user_reports": [], "saved": false, "id": "dgyx6pu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "iglidante", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyq3l0", "score": 4, "approved_by": null, "downs": 0, "body": "&gt;don't most people just have their food and that's it?\n\nWhat do you mean, exactly? Are you asking if most people don't care about what they eat beyond sustaining their bodies? Plenty of people derive a lot of enjoyment from food.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;don&amp;#39;t most people just have their food and that&amp;#39;s it?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What do you mean, exactly? Are you asking if most people don&amp;#39;t care about what they eat beyond sustaining their bodies? Plenty of people derive a lot of enjoyment from food.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyx6pu", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyx6pu/", "num_reports": null, "stickied": false, "created": 1493632864.0, "author_flair_text": "2∆", "created_utc": 1493604064.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyq3l0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FreeAsInFreedoooooom", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyo46s", "score": -3, "approved_by": null, "downs": 0, "body": "I totally get your point, but I don't think that kind of mindset applies to most people. \n\nMaybe I'm out of touch, but don't most people just have their food and that's it? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I totally get your point, but I don&amp;#39;t think that kind of mindset applies to most people. &lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;m out of touch, but don&amp;#39;t most people just have their food and that&amp;#39;s it? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyq3l0", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyq3l0/", "num_reports": null, "stickied": false, "created": 1493623158.0, "author_flair_text": null, "created_utc": 1493594358.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "more", "data": {"count": 2, "name": "t1_dgyqea8", "id": "dgyqea8", "parent_id": "t1_dgyo46s", "depth": 1, "children": ["dgyqea8", "dgywfza"]}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyo46s", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "McKoijion", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 23, "approved_by": null, "downs": 0, "body": "Say Bill and Bob visit India for the first time for work. Bill has never eaten Indian food in his entire life. He goes there and meets everyone. One of his new friends invites him over for dinner. Bill goes over. He sits down and is presented with a weird smelly bowl of something that looks like it's already passed through someone's digestive system. He feels really uncomfortable. He is polite about it, but everyone can tell he dislikes their food. He is uncomfortable trying new things, like most people are. His host is also polite, but sees it as a little bit of an insult after they spent the day preparing luxurious meal for their guest. The next day, Bill has intense gastrointestinal discomfort from eating a bunch of new spices and high fiber foods. He feels miserable and associates India with the feeling. He tells people back home in America about it. He doesn't make jokes, he just states the facts. But now all of his less well traveled friends and family associate India with diarrhea. \n\nNow imagine Bob. Bob has gone to an Indian restaurant in the US. He thinks it's weird, but he tries Indian food that has been tailored to an American palate (more butter, meat, less piece, etc.) He gets used to it. Now when he goes to India, when he see the food for the first time, he doesn't see a bunch of weird slop. He sees authentic versions of some of his favorite dishes. Dishes he has already developed a taste for. His gut has already become accustomed to eating spices and fiber and he doesn't get any stomach problems. He devours everything put in front of him with a smile on his face. He is happy because he gets to eat great versions of food he loves, and his host is happy because he appreciates their cooking. When he returns back to the US, he talks about how good the food was and how much fun he had. All his friends and family develop a more positive image of India.\n\nFamiliarizing yourself with a country's food is a small thing, but it snowballs into a much bigger thing. Eating food is one of the most important activities in human life. It is an important communal experience, and is the center of many important cultural experiences. \n\nThe irony is that most food is very similar from country to country. Indian food is wheat, rice, beans, chicken, etc. That's the same basic stuff you'll find in China, America, Italy, etc. But because people don't bother to recognize the similarities, they focus on the differences, often in a negative light. Eating food is a reminder that all humans are pretty much the same with just a few small differences to keep things interesting.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Say Bill and Bob visit India for the first time for work. Bill has never eaten Indian food in his entire life. He goes there and meets everyone. One of his new friends invites him over for dinner. Bill goes over. He sits down and is presented with a weird smelly bowl of something that looks like it&amp;#39;s already passed through someone&amp;#39;s digestive system. He feels really uncomfortable. He is polite about it, but everyone can tell he dislikes their food. He is uncomfortable trying new things, like most people are. His host is also polite, but sees it as a little bit of an insult after they spent the day preparing luxurious meal for their guest. The next day, Bill has intense gastrointestinal discomfort from eating a bunch of new spices and high fiber foods. He feels miserable and associates India with the feeling. He tells people back home in America about it. He doesn&amp;#39;t make jokes, he just states the facts. But now all of his less well traveled friends and family associate India with diarrhea. &lt;/p&gt;\n\n&lt;p&gt;Now imagine Bob. Bob has gone to an Indian restaurant in the US. He thinks it&amp;#39;s weird, but he tries Indian food that has been tailored to an American palate (more butter, meat, less piece, etc.) He gets used to it. Now when he goes to India, when he see the food for the first time, he doesn&amp;#39;t see a bunch of weird slop. He sees authentic versions of some of his favorite dishes. Dishes he has already developed a taste for. His gut has already become accustomed to eating spices and fiber and he doesn&amp;#39;t get any stomach problems. He devours everything put in front of him with a smile on his face. He is happy because he gets to eat great versions of food he loves, and his host is happy because he appreciates their cooking. When he returns back to the US, he talks about how good the food was and how much fun he had. All his friends and family develop a more positive image of India.&lt;/p&gt;\n\n&lt;p&gt;Familiarizing yourself with a country&amp;#39;s food is a small thing, but it snowballs into a much bigger thing. Eating food is one of the most important activities in human life. It is an important communal experience, and is the center of many important cultural experiences. &lt;/p&gt;\n\n&lt;p&gt;The irony is that most food is very similar from country to country. Indian food is wheat, rice, beans, chicken, etc. That&amp;#39;s the same basic stuff you&amp;#39;ll find in China, America, Italy, etc. But because people don&amp;#39;t bother to recognize the similarities, they focus on the differences, often in a negative light. Eating food is a reminder that all humans are pretty much the same with just a few small differences to keep things interesting.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyo46s", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyo46s/", "num_reports": null, "stickied": false, "created": 1493620358.0, "author_flair_text": "229∆", "created_utc": 1493591558.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 8, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyrbly", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "tunaonrye", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgypaed", "score": 2, "approved_by": null, "downs": 0, "body": " You can read about baseball, learn the players, watch the games, all that... even look at [American jokes about baseball](https://www.youtube.com/watch?v=VlORWhsJjNM)... but being there is something different. A tourist can and should go to a baseball game! You can't become a member of the culture so easily - but it is a cultural experience, no doubt.\n\nThe hot dog at a gas station doesn't really tell you much on its own. I don't think any cultural artifact can say much outside of its connection to people (or without an awful lot of background study) But it isn't enough to ask someone \"Where should I eat a hot dog?\" Actually do it. You might be unmoved, but living the experience and finding those cultural connections through food has been one of the most culturally enlightening things I've done. Street food in Mumbai. Tacos in Mexico. Indian take-away in London. The food markets in Spain. More mundane things like a chat about Seder dinner or talking with a restaurant owner about sushi or Korean tradition has made many cultural practices more present in my mind. I think the sorts of things that you recommend - study, looking at history, etc. are quite valuable too - but I'll always remember the smell of a chai stand and the mulling of a crowd waiting for the chai-walla to pour. I don't remember the guidebooks as well. And I never appreciated something like Rushdie's Midnight's Children quite so fully before having a chutney in Mumbai.\n\nThe food itself isn't the starting point for a culture in terms of its sociology or its political world, etc. But we all eat, and what we eat and how its done are reflections of a culture. It isn't necesarily cultural information on its own (at least in the commodified era in which we live), but a meal can be an invitation to participate in a culture (like a hotdog at a baseball game) and a food an especially eye opening start to a conversation.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can read about baseball, learn the players, watch the games, all that... even look at &lt;a href=\"https://www.youtube.com/watch?v=VlORWhsJjNM\"&gt;American jokes about baseball&lt;/a&gt;... but being there is something different. A tourist can and should go to a baseball game! You can&amp;#39;t become a member of the culture so easily - but it is a cultural experience, no doubt.&lt;/p&gt;\n\n&lt;p&gt;The hot dog at a gas station doesn&amp;#39;t really tell you much on its own. I don&amp;#39;t think any cultural artifact can say much outside of its connection to people (or without an awful lot of background study) But it isn&amp;#39;t enough to ask someone &amp;quot;Where should I eat a hot dog?&amp;quot; Actually do it. You might be unmoved, but living the experience and finding those cultural connections through food has been one of the most culturally enlightening things I&amp;#39;ve done. Street food in Mumbai. Tacos in Mexico. Indian take-away in London. The food markets in Spain. More mundane things like a chat about Seder dinner or talking with a restaurant owner about sushi or Korean tradition has made many cultural practices more present in my mind. I think the sorts of things that you recommend - study, looking at history, etc. are quite valuable too - but I&amp;#39;ll always remember the smell of a chai stand and the mulling of a crowd waiting for the chai-walla to pour. I don&amp;#39;t remember the guidebooks as well. And I never appreciated something like Rushdie&amp;#39;s Midnight&amp;#39;s Children quite so fully before having a chutney in Mumbai.&lt;/p&gt;\n\n&lt;p&gt;The food itself isn&amp;#39;t the starting point for a culture in terms of its sociology or its political world, etc. But we all eat, and what we eat and how its done are reflections of a culture. It isn&amp;#39;t necesarily cultural information on its own (at least in the commodified era in which we live), but a meal can be an invitation to participate in a culture (like a hotdog at a baseball game) and a food an especially eye opening start to a conversation.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyrbly", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyrbly/", "num_reports": null, "stickied": false, "created": 1493624872.0, "author_flair_text": "59∆", "created_utc": 1493596072.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgypaed", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FreeAsInFreedoooooom", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyo5f1", "score": 0, "approved_by": null, "downs": 0, "body": "I'm not from you the US, but to use your hotdog example: it's definitely tied in with baseball and classic Americana but can a tourist really 'catch' that? The food isn't even acting as a starting point unless you make the decision to ask \"where do these come from, who eats these, where are they traditionally eaten\"? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not from you the US, but to use your hotdog example: it&amp;#39;s definitely tied in with baseball and classic Americana but can a tourist really &amp;#39;catch&amp;#39; that? The food isn&amp;#39;t even acting as a starting point unless you make the decision to ask &amp;quot;where do these come from, who eats these, where are they traditionally eaten&amp;quot;? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgypaed", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgypaed/", "num_reports": null, "stickied": false, "created": 1493622029.0, "author_flair_text": null, "created_utc": 1493593229.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyo5f1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "tunaonrye", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 8, "approved_by": null, "downs": 0, "body": "Food is an important part of culture. Looking at a recipe book for a Seder dinner doesn't explain what being Jewish is, yes, but going to one might.\n\nYou are right that dropping a bunch of Chinese restaurants into a city doesn't make people understand Chinese culture. Chipotle certainly doesn't teach people about Mexican culture. But find a Chinese grocery store in a city and things are more interesting. Or talk to the people at a Mercado. Look at what is sold (and even the price differences). Restaurants have to survive and make money, they are typically broad. A Grocery store serves a community - it gives people a taste of home: and that isn't just a list of spices or a type of dish - it is a memory, a feeling, a sense of belonging. \n\nThink of a hotdog (assuming you are from the US). Baseball. Picnics. The sound of a grill. A street cart (if you have been to NYC). The food itself doesn't broaden your mind, no. Especially if it is just served in some sterile environment. Consider food in context - roast turkey and mashed potatoes isn't just a thing you eat on the street. But learning about that food in context (for example: who makes it, where does it come from, who cooks it, what memories are associated with it) does amazing things to open up conversations. If you look more closely, you can find much about a culture.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Food is an important part of culture. Looking at a recipe book for a Seder dinner doesn&amp;#39;t explain what being Jewish is, yes, but going to one might.&lt;/p&gt;\n\n&lt;p&gt;You are right that dropping a bunch of Chinese restaurants into a city doesn&amp;#39;t make people understand Chinese culture. Chipotle certainly doesn&amp;#39;t teach people about Mexican culture. But find a Chinese grocery store in a city and things are more interesting. Or talk to the people at a Mercado. Look at what is sold (and even the price differences). Restaurants have to survive and make money, they are typically broad. A Grocery store serves a community - it gives people a taste of home: and that isn&amp;#39;t just a list of spices or a type of dish - it is a memory, a feeling, a sense of belonging. &lt;/p&gt;\n\n&lt;p&gt;Think of a hotdog (assuming you are from the US). Baseball. Picnics. The sound of a grill. A street cart (if you have been to NYC). The food itself doesn&amp;#39;t broaden your mind, no. Especially if it is just served in some sterile environment. Consider food in context - roast turkey and mashed potatoes isn&amp;#39;t just a thing you eat on the street. But learning about that food in context (for example: who makes it, where does it come from, who cooks it, what memories are associated with it) does amazing things to open up conversations. If you look more closely, you can find much about a culture.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyo5f1", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyo5f1/", "num_reports": null, "stickied": false, "created": 1493620406.0, "author_flair_text": "59∆", "created_utc": 1493591606.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgypblp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gremy0", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyofxe", "score": 3, "approved_by": null, "downs": 0, "body": "But it's not just based upon the food itself, I'm talking about the social interaction that occurs because of it.\n\nAmhed the accountant sits in an office all day. He meets very few people throughout the day and those that he does are in a situation that is dictated by western office and business culture.\n\nAmhed the restaurant owner invites people into his culture all day long, as a living. His business is to get as many people as possible into his representation of his culture and make them happy.\n\nIf you visit and get to know your local immigrant restaurant you are less likely to be alienated by them. It's a great way to get people introduced to other cultures.\n\nThe majority of predice is just a fear of the unknown or unfamiliar. Offering food to people is a way to get people to know these cultures and people.", "edited": 1493593646.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But it&amp;#39;s not just based upon the food itself, I&amp;#39;m talking about the social interaction that occurs because of it.&lt;/p&gt;\n\n&lt;p&gt;Amhed the accountant sits in an office all day. He meets very few people throughout the day and those that he does are in a situation that is dictated by western office and business culture.&lt;/p&gt;\n\n&lt;p&gt;Amhed the restaurant owner invites people into his culture all day long, as a living. His business is to get as many people as possible into his representation of his culture and make them happy.&lt;/p&gt;\n\n&lt;p&gt;If you visit and get to know your local immigrant restaurant you are less likely to be alienated by them. It&amp;#39;s a great way to get people introduced to other cultures.&lt;/p&gt;\n\n&lt;p&gt;The majority of predice is just a fear of the unknown or unfamiliar. Offering food to people is a way to get people to know these cultures and people.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgypblp", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgypblp/", "num_reports": null, "stickied": false, "created": 1493622078.0, "author_flair_text": "17∆", "created_utc": 1493593278.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dh0aez2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Saphazure", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyofxe", "score": 1, "approved_by": null, "downs": 0, "body": "it's not just about the food (or how it tastes). eating is very personal and how other cultures do it, how they prepare it, how they feel eating it, etc is what \"puts you into their culture mindset\" so to speak. the Japanese kneel for example, but what about Americans? we have hot dog stands and wings engrained into our culture, eating standing up and such, or at a bar...but what does that say about us as a culture...? what makes us stand up? what makes the Japanese kneel? that's what's culture through food is all about.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;it&amp;#39;s not just about the food (or how it tastes). eating is very personal and how other cultures do it, how they prepare it, how they feel eating it, etc is what &amp;quot;puts you into their culture mindset&amp;quot; so to speak. the Japanese kneel for example, but what about Americans? we have hot dog stands and wings engrained into our culture, eating standing up and such, or at a bar...but what does that say about us as a culture...? what makes us stand up? what makes the Japanese kneel? that&amp;#39;s what&amp;#39;s culture through food is all about.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dh0aez2", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dh0aez2/", "num_reports": null, "stickied": false, "created": 1493711621.0, "author_flair_text": null, "created_utc": 1493682821.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyofxe", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FreeAsInFreedoooooom", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgynn3v", "score": 1, "approved_by": null, "downs": 0, "body": "All else being equal, I'd say it is nice to try new food. But you can't judge a group because of your opinion on their food. A positive, subconscious bias is something to be encouraged but it just seems so shallow and of little real benefit. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All else being equal, I&amp;#39;d say it is nice to try new food. But you can&amp;#39;t judge a group because of your opinion on their food. A positive, subconscious bias is something to be encouraged but it just seems so shallow and of little real benefit. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyofxe", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyofxe/", "num_reports": null, "stickied": false, "created": 1493620824.0, "author_flair_text": null, "created_utc": 1493592024.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgynn3v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gremy0", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 3, "approved_by": null, "downs": 0, "body": "Off the back of the phrase; don't bite the hand that feeds.\n\nWould you not see that people appreciate those that give them good food. And if a culture was introduced by way of a new restaurant/takeaway that served a really nice new type of food. The proprietors would be more disposed to seeing the culture in good light.\n\nI.e. those Indians are alright, they make a great curry.\n\n\nI'm not saying it's the be-all and end-all of integration, but it's certainly a good way of showcasing the benifits of of cultural diversity.", "edited": 1493591633.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Off the back of the phrase; don&amp;#39;t bite the hand that feeds.&lt;/p&gt;\n\n&lt;p&gt;Would you not see that people appreciate those that give them good food. And if a culture was introduced by way of a new restaurant/takeaway that served a really nice new type of food. The proprietors would be more disposed to seeing the culture in good light.&lt;/p&gt;\n\n&lt;p&gt;I.e. those Indians are alright, they make a great curry.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not saying it&amp;#39;s the be-all and end-all of integration, but it&amp;#39;s certainly a good way of showcasing the benifits of of cultural diversity.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgynn3v", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgynn3v/", "num_reports": null, "stickied": false, "created": 1493619695.0, "author_flair_text": "17∆", "created_utc": 1493590895.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyr6ij", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "allsfair86", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgypx3j", "score": 2, "approved_by": null, "downs": 0, "body": "I mean, all of those things are really just conversation starters.  You aren't going to truly understand a culture from only one of any of them - but you are gaining a little more knowledge from each.  Food is a type of culture just like any of the other things are a type of culture, none of them are the 'complete' picture of that culture, obviously.  But if you were to learn all about a culture but nothing about the food or cuisine you'd be missing a *lot* about how those people survive.  Food is a part of the work they do - farming, hunting, importing, etc, it's a part of the daily preparations, and it's a part of how they are interacting with each other.  Sure, you might not get all of that from a meal but it is a part of the culture, and it is gaining you some insight into the daily lives of those people.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean, all of those things are really just conversation starters.  You aren&amp;#39;t going to truly understand a culture from only one of any of them - but you are gaining a little more knowledge from each.  Food is a type of culture just like any of the other things are a type of culture, none of them are the &amp;#39;complete&amp;#39; picture of that culture, obviously.  But if you were to learn all about a culture but nothing about the food or cuisine you&amp;#39;d be missing a &lt;em&gt;lot&lt;/em&gt; about how those people survive.  Food is a part of the work they do - farming, hunting, importing, etc, it&amp;#39;s a part of the daily preparations, and it&amp;#39;s a part of how they are interacting with each other.  Sure, you might not get all of that from a meal but it is a part of the culture, and it is gaining you some insight into the daily lives of those people.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyr6ij", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyr6ij/", "num_reports": null, "stickied": false, "created": 1493624672.0, "author_flair_text": "55∆", "created_utc": 1493595872.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgypx3j", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FreeAsInFreedoooooom", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyp3ot", "score": 1, "approved_by": null, "downs": 0, "body": "Paintings are just one kind of art, I feel like a decent book can give me much more empathy and understanding of circumstances. Then there's movies and TV but of course these have the potential to be misleading also. \n\nFood seems to be a conversation starter rather than the actual conversation. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Paintings are just one kind of art, I feel like a decent book can give me much more empathy and understanding of circumstances. Then there&amp;#39;s movies and TV but of course these have the potential to be misleading also. &lt;/p&gt;\n\n&lt;p&gt;Food seems to be a conversation starter rather than the actual conversation. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgypx3j", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgypx3j/", "num_reports": null, "stickied": false, "created": 1493622909.0, "author_flair_text": null, "created_utc": 1493594109.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyp3ot", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "allsfair86", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyosc8", "score": 2, "approved_by": null, "downs": 0, "body": "I mean you can say the same thing about art though, without much knowledge or background of a painting from a certain culture, what you get out of that painting isn't all that enlightening.  But that doesn't mean that the painting isn't an important part of that culture, or that someone who is looking more critically and taking a more well rounded approach isn't learning something about that culture.  Food can easily have that effect to. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I mean you can say the same thing about art though, without much knowledge or background of a painting from a certain culture, what you get out of that painting isn&amp;#39;t all that enlightening.  But that doesn&amp;#39;t mean that the painting isn&amp;#39;t an important part of that culture, or that someone who is looking more critically and taking a more well rounded approach isn&amp;#39;t learning something about that culture.  Food can easily have that effect to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyp3ot", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyp3ot/", "num_reports": null, "stickied": false, "created": 1493621767.0, "author_flair_text": "55∆", "created_utc": 1493592967.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyosc8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "FreeAsInFreedoooooom", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dgyo10d", "score": 1, "approved_by": null, "downs": 0, "body": "I'd discount the experience in terms of the physical sensations you experience but I suppose you have a point if you look at it in terms of shared experience. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d discount the experience in terms of the physical sensations you experience but I suppose you have a point if you look at it in terms of shared experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyosc8", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyosc8/", "num_reports": null, "stickied": false, "created": 1493621315.0, "author_flair_text": null, "created_utc": 1493592515.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dgyo10d", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "allsfair86", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 3, "approved_by": null, "downs": 0, "body": "I don't claim to have a great deal of knowledge of cuisine or food, but I think you are undervaluing the significance food has as art and as an experience of that culture. \n\nI mean we eat food three times a day, in most places a significant amount of time is devoted to making and enjoying that food. Often times it is done ritually.  So when we enjoy the food and dining experience of another culture we are literally learning a what kinds of experiences people from that culture have on the daily basis when they sit down for meals.  It's certainly not the end all be all of understanding other cultures, but that's a pretty significant part of most peoples lives, and if eating a multiethnic places sheds light on it then I'd say it definitely is teaching you something about the cultures they come from.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t claim to have a great deal of knowledge of cuisine or food, but I think you are undervaluing the significance food has as art and as an experience of that culture. &lt;/p&gt;\n\n&lt;p&gt;I mean we eat food three times a day, in most places a significant amount of time is devoted to making and enjoying that food. Often times it is done ritually.  So when we enjoy the food and dining experience of another culture we are literally learning a what kinds of experiences people from that culture have on the daily basis when they sit down for meals.  It&amp;#39;s certainly not the end all be all of understanding other cultures, but that&amp;#39;s a pretty significant part of most peoples lives, and if eating a multiethnic places sheds light on it then I&amp;#39;d say it definitely is teaching you something about the cultures they come from.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyo10d", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyo10d/", "num_reports": null, "stickied": false, "created": 1493620232.0, "author_flair_text": "55∆", "created_utc": 1493591432.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyo2uo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "bguy74", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 2, "approved_by": null, "downs": 0, "body": "It absolutely does something. \"Culture\" is a combination of a variety of things, and food is one of them.  Why would you diminish the value of one dimension of culture in favor of another?  Even moreso, why would you want to _read about_, or even _talk about_ something as experiential as food?  When it comes to understanding the dimension of culture _that is food_, eating is the singular best way to learn about it!\n\nThis is not to say that a deeper knowledge of culture can't be had with a multi-faceted approach.  Indeed it makes sense that as many facets as make up culture should be experienced to understand a culture.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It absolutely does something. &amp;quot;Culture&amp;quot; is a combination of a variety of things, and food is one of them.  Why would you diminish the value of one dimension of culture in favor of another?  Even moreso, why would you want to &lt;em&gt;read about&lt;/em&gt;, or even &lt;em&gt;talk about&lt;/em&gt; something as experiential as food?  When it comes to understanding the dimension of culture &lt;em&gt;that is food&lt;/em&gt;, eating is the singular best way to learn about it!&lt;/p&gt;\n\n&lt;p&gt;This is not to say that a deeper knowledge of culture can&amp;#39;t be had with a multi-faceted approach.  Indeed it makes sense that as many facets as make up culture should be experienced to understand a culture.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyo2uo", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyo2uo/", "num_reports": null, "stickied": false, "created": 1493620303.0, "author_flair_text": "143∆", "created_utc": 1493591503.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzpy7l", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "nessfalco", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; Dropping a lot of foreign-style restaurants into your city does practically zero in adding any real understanding or appreciation of a culture.\n\nIn and of itself, simply having restaurants that serve food from another cultural is probably not very culturally edifying, I agree. \n\n&gt; Food is just food.\n\nThis, however, I strongly disagree with. Food is central to many cultures. Other posters have mentioned Jewish Seder, which is a pretty extraordinary example, but it is certainly indicative of the role food can play in a culture. In this case, symbolizing important events in its history.\n\nEven ignoring holidays, how, where, when, and why people make and eat their food can teach one a great deal about said people. Consider the differences between a Chinese Hot Pot and an American Barbecue, or a sushi bar and a shawarma joint. I took my parents to a hot pot restaurant, and the very idea that eating a non-holiday meal could be communal beyond conversation around the table was completely new to them. Do they suddenly know everything about those who eat hot pot? Absolutely not. But there's a seed of curiosity.\n\nAsk a New Jerseyan about Pork Roll or a good Jewish deli sandwich and they'll probably tell you about how often they go to the place they get it from, how it's the best ever, and you now suddenly wonder why NJ/NY have such awesome breakfast and deli sandwiches while Pennsylvanians get theirs from Wawa (I kid!). Transplant one of those delis to another place (say, Florida, which happens due to the influx of retirees from the Northeast) and you suddenly have a whole new group of people being exposed to foods with stories about the immigrants who made them. Do they get that from just eating there? Probably not. They are, however, one conversation with the owner, or one Wikipedia search away from understanding how and why these foods were made and the values of the people that made them.\n\nI won't claim that eating at a transplanted foreign restaurant is anywhere near as illuminating  as actual travel, conversations with people of those cultures, books, etc, but I think saying \"food is just food\" is massively underselling it. Preparing and eating food makes up a huge portion of our socialization. Maybe less so now for a lot of people, but historically food brought people together. It's the context through which many stories are told.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Dropping a lot of foreign-style restaurants into your city does practically zero in adding any real understanding or appreciation of a culture.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;In and of itself, simply having restaurants that serve food from another cultural is probably not very culturally edifying, I agree. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Food is just food.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This, however, I strongly disagree with. Food is central to many cultures. Other posters have mentioned Jewish Seder, which is a pretty extraordinary example, but it is certainly indicative of the role food can play in a culture. In this case, symbolizing important events in its history.&lt;/p&gt;\n\n&lt;p&gt;Even ignoring holidays, how, where, when, and why people make and eat their food can teach one a great deal about said people. Consider the differences between a Chinese Hot Pot and an American Barbecue, or a sushi bar and a shawarma joint. I took my parents to a hot pot restaurant, and the very idea that eating a non-holiday meal could be communal beyond conversation around the table was completely new to them. Do they suddenly know everything about those who eat hot pot? Absolutely not. But there&amp;#39;s a seed of curiosity.&lt;/p&gt;\n\n&lt;p&gt;Ask a New Jerseyan about Pork Roll or a good Jewish deli sandwich and they&amp;#39;ll probably tell you about how often they go to the place they get it from, how it&amp;#39;s the best ever, and you now suddenly wonder why NJ/NY have such awesome breakfast and deli sandwiches while Pennsylvanians get theirs from Wawa (I kid!). Transplant one of those delis to another place (say, Florida, which happens due to the influx of retirees from the Northeast) and you suddenly have a whole new group of people being exposed to foods with stories about the immigrants who made them. Do they get that from just eating there? Probably not. They are, however, one conversation with the owner, or one Wikipedia search away from understanding how and why these foods were made and the values of the people that made them.&lt;/p&gt;\n\n&lt;p&gt;I won&amp;#39;t claim that eating at a transplanted foreign restaurant is anywhere near as illuminating  as actual travel, conversations with people of those cultures, books, etc, but I think saying &amp;quot;food is just food&amp;quot; is massively underselling it. Preparing and eating food makes up a huge portion of our socialization. Maybe less so now for a lot of people, but historically food brought people together. It&amp;#39;s the context through which many stories are told.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgzpy7l", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgzpy7l/", "num_reports": null, "stickied": false, "created": 1493687399.0, "author_flair_text": null, "created_utc": 1493658599.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyrnzf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 2, "approved_by": null, "downs": 0, "body": "I think you're arguing against a bit of a strawman. I don't believe that anyone worth listening to actually believes that they are gaining some incredible insight into Indian culture because they get chicken masala for take out occasionally.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think you&amp;#39;re arguing against a bit of a strawman. I don&amp;#39;t believe that anyone worth listening to actually believes that they are gaining some incredible insight into Indian culture because they get chicken masala for take out occasionally.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_dgyrnzf", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyrnzf/", "num_reports": null, "stickied": false, "created": 1493625354.0, "author_flair_text": null, "created_utc": 1493596554.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyw7mw", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "galacticsuperkelp", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "I can't recommend Bee Wilson's Consider the Fork enough. There's a lot of culture in food. The way foods are prepared can tell a lot about a culture, its history, and its identity. Different cuisines tell different stories and express different values. Like art, architecture, or music, there's a ton about cultures that are hidden in their cuisines and tools. Ingredients tell histories of agriculture, trade, and exploration. The potato plays an enormous role in Irish history. Dairying is a critical part of early human history. Cheeses are histories to each. What would French culture be without wine? Cultures breads tell stories of their oven designs and fuel accesses. The kinds of preserves native to a cuisine are often insights on their climate and lifestyles. A lot of this culture is accessible at a restaurant and it come so with food. Moreover, you're likely to meet someone from a particular culture at that culture's restaurant--if only because they work there. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can&amp;#39;t recommend Bee Wilson&amp;#39;s Consider the Fork enough. There&amp;#39;s a lot of culture in food. The way foods are prepared can tell a lot about a culture, its history, and its identity. Different cuisines tell different stories and express different values. Like art, architecture, or music, there&amp;#39;s a ton about cultures that are hidden in their cuisines and tools. Ingredients tell histories of agriculture, trade, and exploration. The potato plays an enormous role in Irish history. Dairying is a critical part of early human history. Cheeses are histories to each. What would French culture be without wine? Cultures breads tell stories of their oven designs and fuel accesses. The kinds of preserves native to a cuisine are often insights on their climate and lifestyles. A lot of this culture is accessible at a restaurant and it come so with food. Moreover, you&amp;#39;re likely to meet someone from a particular culture at that culture&amp;#39;s restaurant--if only because they work there. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyw7mw", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyw7mw/", "num_reports": null, "stickied": false, "created": 1493631572.0, "author_flair_text": "13∆", "created_utc": 1493602772.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzpgql", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "electronics12345", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "Food is pretty central to life. In modern America - we tend to only spend 70 minutes a day preparing and eating food, but the world average is closer to 3 hours. Of waking hours the average denizen of the world spends 1/6th of their entire day on food. It is this difference which might be why you don't see food as important, since America tends to undervalue preparing and eating food as an activity in and of itself rather than something to get through. \n\nThink of every major event in your life (Wedding, Funeral, parties, birthdays, graduations). I bet there was food at all of them (or shortly thereafter depending on your exact traditions). Food is central to what humans do. \n\nFinally, Food allows you to viscerally experience a culture. Talking to a human engages your ears. Eating food engages your senses of sight, smell, taste and touch, which is a more engrossing experience. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Food is pretty central to life. In modern America - we tend to only spend 70 minutes a day preparing and eating food, but the world average is closer to 3 hours. Of waking hours the average denizen of the world spends 1/6th of their entire day on food. It is this difference which might be why you don&amp;#39;t see food as important, since America tends to undervalue preparing and eating food as an activity in and of itself rather than something to get through. &lt;/p&gt;\n\n&lt;p&gt;Think of every major event in your life (Wedding, Funeral, parties, birthdays, graduations). I bet there was food at all of them (or shortly thereafter depending on your exact traditions). Food is central to what humans do. &lt;/p&gt;\n\n&lt;p&gt;Finally, Food allows you to viscerally experience a culture. Talking to a human engages your ears. Eating food engages your senses of sight, smell, taste and touch, which is a more engrossing experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgzpgql", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgzpgql/", "num_reports": null, "stickied": false, "created": 1493686835.0, "author_flair_text": "77∆", "created_utc": 1493658035.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzoxx8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "BistuaNova", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "If you have common sense it does. Learn about Indian food and you'll notice that cow is not usually on the menu you can conclude that 1) they don't have cows or 2) they don't eat cow. The latter being a better answer. Now that you figured they don't eat cow you can go and find out why. Now let's take China for example. Rice is very, very popular. Why? Well they probably have lots of it. You can use this to assume that a lot of Chinese people farm rice. Farms would be spread out across the rice-bearing climates. They are probably farmers very far from big cities. \n\nYou can begin to understand a lot about a place through its food if you think about it.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If you have common sense it does. Learn about Indian food and you&amp;#39;ll notice that cow is not usually on the menu you can conclude that 1) they don&amp;#39;t have cows or 2) they don&amp;#39;t eat cow. The latter being a better answer. Now that you figured they don&amp;#39;t eat cow you can go and find out why. Now let&amp;#39;s take China for example. Rice is very, very popular. Why? Well they probably have lots of it. You can use this to assume that a lot of Chinese people farm rice. Farms would be spread out across the rice-bearing climates. They are probably farmers very far from big cities. &lt;/p&gt;\n\n&lt;p&gt;You can begin to understand a lot about a place through its food if you think about it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgzoxx8", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgzoxx8/", "num_reports": null, "stickied": false, "created": 1493686238.0, "author_flair_text": null, "created_utc": 1493657438.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyq4q2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MegasusPegasus", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "A lot of 'American' cuisine, like Pizza, is what happens when cultures start to use the products now readily available to them. Do I think that means it educates people on how to be tolerant and accepting? No.\n\nI do, however, think it gives people the ability to share their culture while turning a profit. And that people will always be more welcoming of a nicely cooked meal that political art, and it will reach far more people. And at the end of the day something doesn't need to be educational to be valuable. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;A lot of &amp;#39;American&amp;#39; cuisine, like Pizza, is what happens when cultures start to use the products now readily available to them. Do I think that means it educates people on how to be tolerant and accepting? No.&lt;/p&gt;\n\n&lt;p&gt;I do, however, think it gives people the ability to share their culture while turning a profit. And that people will always be more welcoming of a nicely cooked meal that political art, and it will reach far more people. And at the end of the day something doesn&amp;#39;t need to be educational to be valuable. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyq4q2", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyq4q2/", "num_reports": null, "stickied": false, "created": 1493623202.0, "author_flair_text": null, "created_utc": 1493594402.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgyyjzd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "BrandonMarlowe", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "Food is just food, but cuisine is Art.  Like other art it offers a nuanced, complex but often non-verbalizable expression of the person(s) that made it.  \n\nAt the risk of being simplistic, I'd say Japanese food has a precision and understatement to it, while Mexican food seems more extraverted and \"cheerful\".  I definitely see the personality of the culture in the cuisine, though admittedly in hindsight.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Food is just food, but cuisine is Art.  Like other art it offers a nuanced, complex but often non-verbalizable expression of the person(s) that made it.  &lt;/p&gt;\n\n&lt;p&gt;At the risk of being simplistic, I&amp;#39;d say Japanese food has a precision and understatement to it, while Mexican food seems more extraverted and &amp;quot;cheerful&amp;quot;.  I definitely see the personality of the culture in the cuisine, though admittedly in hindsight.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgyyjzd", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgyyjzd/", "num_reports": null, "stickied": false, "created": 1493634783.0, "author_flair_text": null, "created_utc": 1493605983.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgzqf31", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "lobsterharmonica1667", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "Food is a very important, but superficial part of a culture. I agree that eating or learning about food isn't beneficial in and of itself, but you can say the same thing about learning  a new language, it reading history books. The only way to really understand culture is to actually experience it, and eating the food enhances that experience. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Food is a very important, but superficial part of a culture. I agree that eating or learning about food isn&amp;#39;t beneficial in and of itself, but you can say the same thing about learning  a new language, it reading history books. The only way to really understand culture is to actually experience it, and eating the food enhances that experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgzqf31", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgzqf31/", "num_reports": null, "stickied": false, "created": 1493687945.0, "author_flair_text": "4∆", "created_utc": 1493659145.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgza3sm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "acreset", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "Don't you think the food is influenced by the culture, availability, ethos, aesthetics, weather and what is grown in the region?\n\nWhy does art tell a story but food doesn't?\n\nI mean - not all food is fine dining, but plating and ambiance is as much a work of art (although fleeting) as any \"art\" is, no?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Don&amp;#39;t you think the food is influenced by the culture, availability, ethos, aesthetics, weather and what is grown in the region?&lt;/p&gt;\n\n&lt;p&gt;Why does art tell a story but food doesn&amp;#39;t?&lt;/p&gt;\n\n&lt;p&gt;I mean - not all food is fine dining, but plating and ambiance is as much a work of art (although fleeting) as any &amp;quot;art&amp;quot; is, no?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgza3sm", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgza3sm/", "num_reports": null, "stickied": false, "created": 1493661852.0, "author_flair_text": null, "created_utc": 1493633052.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_68i6u1", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dgz4d3q", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "forerunner398", "can_mod_post": false, "send_replies": true, "parent_id": "t3_68i6u1", "score": 1, "approved_by": null, "downs": 0, "body": "I don't really understand why you're separating the historical anthropological aspects from the cultural aspects. Those attributes tend to show \"what people value\" and \"reveal facts.\" \n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t really understand why you&amp;#39;re separating the historical anthropological aspects from the cultural aspects. Those attributes tend to show &amp;quot;what people value&amp;quot; and &amp;quot;reveal facts.&amp;quot; &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_dgz4d3q", "score_hidden": false, "permalink": "/r/changemyview/comments/68i6u1/cmv_eating_and_generally_learning_about_food_from/dgz4d3q/", "num_reports": null, "stickied": false, "created": 1493644716.0, "author_flair_text": "1∆", "created_utc": 1493615916.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]