[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Why am I alive?! For what purpose?! Why does any human being have the right to lock me up if I try to do myself in? The way I see it, human beings have a natural instinct to keep living because animals don&amp;#39;t want to go extinct. We want our kind to keep progressing. So I understand why, at the primal level, human beings feel a need to keep other human beings alive. &lt;/p&gt;\n\n&lt;p&gt;However, generally speaking, the human beings that want to out themselves are afflicted with some kind of disease. A disease that will probably afflict their offspring, should they procreate. Wouldn&amp;#39;t others want to let the diseased humans kill themselves off before they keep afflicting others? These genes shouldn&amp;#39;t be passed on- for the good of humanity. &lt;/p&gt;\n\n&lt;p&gt;And if the reason to force another human being to stay alive isn&amp;#39;t the primal don&amp;#39;t-go-extinct gut reaction, then I can only see it as being selfishness- them not wanting us to die because they&amp;#39;ll miss us- because it certainly can&amp;#39;t be out of compassion or sympathy. If it were, if they had any idea how much living hurts, they&amp;#39;d kill us themselves. So why in the world are they allowed to be so selfish and then try to point fingers at us and call us selfish when we beg to be let go?! &lt;/p&gt;\n\n&lt;p&gt;And who is God anyway?! My Creator? So WHAT?! Being created HURTS!!! Why&amp;#39;d He have to go &amp;amp; do that?! &lt;/p&gt;\n\n&lt;p&gt;I think that at the base of all of it, I&amp;#39;m just furious that God let me be molested. &lt;/p&gt;\n\n&lt;p&gt;That He lets anyone be molested. As soon as someone starts to touch a kid like that, boom- strike &amp;#39;em dead. Then you&amp;#39;d play the agency card. &amp;quot;Now sweetie, that wouldn&amp;#39;t work, because if people knew for a fact that they&amp;#39;d fall dead the minute they&amp;#39;d start molesting someone, no one would get molested, and that wouldn&amp;#39;t be a real test of faith or of character.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Well SCREW TESTS!!! We&amp;#39;ll all screw up one way or another- no one can be perfect like His precious Jesus. Is letting thousands- maybe even millions- of His children be molested less important than testing out if people will become child molesters? &lt;/p&gt;\n\n&lt;p&gt;I know. I&amp;#39;m looking for someone to blame and I picked God. I&amp;#39;m just a 2-year-old throwing a tantrum. &lt;/p&gt;\n\n&lt;p&gt;Why am I alive? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Why am I alive?! For what purpose?! Why does any human being have the right to lock me up if I try to do myself in? The way I see it, human beings have a natural instinct to keep living because animals don't want to go extinct. We want our kind to keep progressing. So I understand why, at the primal level, human beings feel a need to keep other human beings alive. \n\nHowever, generally speaking, the human beings that want to out themselves are afflicted with some kind of disease. A disease that will probably afflict their offspring, should they procreate. Wouldn't others want to let the diseased humans kill themselves off before they keep afflicting others? These genes shouldn't be passed on- for the good of humanity. \n\nAnd if the reason to force another human being to stay alive isn't the primal don't-go-extinct gut reaction, then I can only see it as being selfishness- them not wanting us to die because they'll miss us- because it certainly can't be out of compassion or sympathy. If it were, if they had any idea how much living hurts, they'd kill us themselves. So why in the world are they allowed to be so selfish and then try to point fingers at us and call us selfish when we beg to be let go?! \n\nAnd who is God anyway?! My Creator? So WHAT?! Being created HURTS!!! Why'd He have to go &amp; do that?! \n\nI think that at the base of all of it, I'm just furious that God let me be molested. \n\nThat He lets anyone be molested. As soon as someone starts to touch a kid like that, boom- strike 'em dead. Then you'd play the agency card. \"Now sweetie, that wouldn't work, because if people knew for a fact that they'd fall dead the minute they'd start molesting someone, no one would get molested, and that wouldn't be a real test of faith or of character.\" \n\nWell SCREW TESTS!!! We'll all screw up one way or another- no one can be perfect like His precious Jesus. Is letting thousands- maybe even millions- of His children be molested less important than testing out if people will become child molesters? \n\nI know. I'm looking for someone to blame and I picked God. I'm just a 2-year-old throwing a tantrum. \n\nWhy am I alive? ", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "34hslb", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "1badgrandpa", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 2, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": "modmsg", "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83421, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_34hslb", "spoiler": false, "permalink": "/r/SuicideWatch/comments/34hslb/let_me_die/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1430493038.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/34hslb/let_me_die/", "author_flair_text": "", "quarantine": false, "title": "LET ME DIE!!!", "created_utc": 1430464238.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 0.67, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [], "before": null}}]