[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have lived a very privileged life. I have had every opportunity to succeed. I grew up wanting to do things on my own terms and not what my family expected of me. But secretly I have always been afraid to take the leap and really try at something i&amp;#39;ve wanted to do for fear of failure. I have struggled with trying to comprise living my own life while also living up to my families expectations. I&amp;#39;ve been on and off SSRIs, gone to therapy, but they only seem like bandaids. I can go for a few months where I am alright but if the slightest bump in the road happens (in this most recent case, loss of a job and failed relationship) i spiral back into depression. Now I&amp;#39;ve moved back into my dad&amp;#39;s house after hitting rock bottom. And the thing is I don&amp;#39;t even really care anymore. I&amp;#39;ve stopped taking care of myself, i spend all my time sleeping or drinking beer, and bullshitting on the internet. I go to sleep wishing everynight that I&amp;#39;ll wake up and I&amp;#39;ll be six years in the past (when I started college). I used to have goals to go to grad school and get a successful career. Now I&amp;#39;m just another unemployed college graduate. I know i don&amp;#39;t have any real problems but I&amp;#39;ve always had this depression since I was little kid. I hate myself for it, and I hate that my family and friends have to deal with  it. I&amp;#39;ve just been trying to shut myself out so that I don&amp;#39;t expose them to it. I&amp;#39;ve had suicidal thoughts in the past, but they have grown intensely in the past few months. But I&amp;#39;m too much of a pussy to even take my own life, as much as I want to. So now I&amp;#39;m just sitting here in my dad&amp;#39;s spare bedroom wasting away.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have lived a very privileged life. I have had every opportunity to succeed. I grew up wanting to do things on my own terms and not what my family expected of me. But secretly I have always been afraid to take the leap and really try at something i've wanted to do for fear of failure. I have struggled with trying to comprise living my own life while also living up to my families expectations. I've been on and off SSRIs, gone to therapy, but they only seem like bandaids. I can go for a few months where I am alright but if the slightest bump in the road happens (in this most recent case, loss of a job and failed relationship) i spiral back into depression. Now I've moved back into my dad's house after hitting rock bottom. And the thing is I don't even really care anymore. I've stopped taking care of myself, i spend all my time sleeping or drinking beer, and bullshitting on the internet. I go to sleep wishing everynight that I'll wake up and I'll be six years in the past (when I started college). I used to have goals to go to grad school and get a successful career. Now I'm just another unemployed college graduate. I know i don't have any real problems but I've always had this depression since I was little kid. I hate myself for it, and I hate that my family and friends have to deal with  it. I've just been trying to shut myself out so that I don't expose them to it. I've had suicidal thoughts in the past, but they have grown intensely in the past few months. But I'm too much of a pussy to even take my own life, as much as I want to. So now I'm just sitting here in my dad's spare bedroom wasting away.", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "34g654", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "Rocky_Gashouse", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 4, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83419, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_34g654", "spoiler": false, "permalink": "/r/SuicideWatch/comments/34g654/23m_who_has_squandered_all_opportunities_in_life/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1430458812.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/34g654/23m_who_has_squandered_all_opportunities_in_life/", "author_flair_text": null, "quarantine": false, "title": "23m who has squandered all opportunities in life (first post ever on reddit)", "created_utc": 1430430012.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 0.67, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_34g654", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_34g654", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_34g654", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_34g654", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cqueiu2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Rocky_Gashouse", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cqudihz", "score": 1, "approved_by": null, "downs": 0, "body": "I've just never hated myself so much. I hate living with regret. I've tried to change but I just can't get out of bed sometimes. My friends have to force me out of the house. I know eventually they'll stop calling and the sad thing is that I'm kind of indifferent to it right now.I hate the fact that I don't even care about anything. I'm just jerking off, drinking beer, and watching netflix/playing videos games.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve just never hated myself so much. I hate living with regret. I&amp;#39;ve tried to change but I just can&amp;#39;t get out of bed sometimes. My friends have to force me out of the house. I know eventually they&amp;#39;ll stop calling and the sad thing is that I&amp;#39;m kind of indifferent to it right now.I hate the fact that I don&amp;#39;t even care about anything. I&amp;#39;m just jerking off, drinking beer, and watching netflix/playing videos games.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_cqueiu2", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/34g654/23m_who_has_squandered_all_opportunities_in_life/cqueiu2/", "num_reports": null, "stickied": false, "created": 1430464119.0, "author_flair_text": null, "created_utc": 1430435319.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cqudihz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "obscuroaborae", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cqud0dx", "score": 1, "approved_by": null, "downs": 0, "body": "You can't compare yourself to your friends, you are not them. You are on a different path. I didn't even last one semester in college, btw.\n\n I am 26 and I have had the same thoughts before... I have noticed that when I am living in the past, in nostalgia, I become swallowed by depression. When I am living in the future, anxiety and worry visit me.\n\nCome back to right now. Come back to who you are, what you know about yourself, what did you used to be excited about? When was the last time you really had fun? What did you do? It's not too late, it's never too fucking late. I remember reading an article from a man who survived jumping off the golden gate bridge, and he said that as soon as his feet left the ledge, he suddenly realized that all his problems were solvable... and that thought helps me at times when I feel like giving up.\n\nlast but not least, it's totally fine to cry dude. And there was a good goddamn reason why, it's because you're really fucking sad. But it's okay, because just like your sadness, nothing is permanent.\n\nI can't tell you what you need to do, because you're your own person, but do believe that this is only temporary, and that you will find the job that's perfect for you when the time is perfectly ripe. I swear to god dude, it can change, it can get better, believe me.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t compare yourself to your friends, you are not them. You are on a different path. I didn&amp;#39;t even last one semester in college, btw.&lt;/p&gt;\n\n&lt;p&gt;I am 26 and I have had the same thoughts before... I have noticed that when I am living in the past, in nostalgia, I become swallowed by depression. When I am living in the future, anxiety and worry visit me.&lt;/p&gt;\n\n&lt;p&gt;Come back to right now. Come back to who you are, what you know about yourself, what did you used to be excited about? When was the last time you really had fun? What did you do? It&amp;#39;s not too late, it&amp;#39;s never too fucking late. I remember reading an article from a man who survived jumping off the golden gate bridge, and he said that as soon as his feet left the ledge, he suddenly realized that all his problems were solvable... and that thought helps me at times when I feel like giving up.&lt;/p&gt;\n\n&lt;p&gt;last but not least, it&amp;#39;s totally fine to cry dude. And there was a good goddamn reason why, it&amp;#39;s because you&amp;#39;re really fucking sad. But it&amp;#39;s okay, because just like your sadness, nothing is permanent.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t tell you what you need to do, because you&amp;#39;re your own person, but do believe that this is only temporary, and that you will find the job that&amp;#39;s perfect for you when the time is perfectly ripe. I swear to god dude, it can change, it can get better, believe me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_cqudihz", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/34g654/23m_who_has_squandered_all_opportunities_in_life/cqudihz/", "num_reports": null, "stickied": false, "created": 1430462301.0, "author_flair_text": null, "created_utc": 1430433501.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cqud0dx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Rocky_Gashouse", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cquc8j3", "score": 1, "approved_by": null, "downs": 0, "body": "Thanks, the thing is I kind of just scraped by in college. I wasn't really involved in anything besides my fraternity, and I didn't do many internships until the last year. But honestly, I feel like its just too late for me. I know that sounds ridiculous but I see all my friends succeeding at what they do, and I cant even get past my anxiety to do a fucking interview for an entry level sales job. I've been so worried about trying to avoid being unhappy with my life, but I'm already there. I actually broke down and started crying yesterday in the shower for no goddamn reason.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thanks, the thing is I kind of just scraped by in college. I wasn&amp;#39;t really involved in anything besides my fraternity, and I didn&amp;#39;t do many internships until the last year. But honestly, I feel like its just too late for me. I know that sounds ridiculous but I see all my friends succeeding at what they do, and I cant even get past my anxiety to do a fucking interview for an entry level sales job. I&amp;#39;ve been so worried about trying to avoid being unhappy with my life, but I&amp;#39;m already there. I actually broke down and started crying yesterday in the shower for no goddamn reason.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_cqud0dx", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/34g654/23m_who_has_squandered_all_opportunities_in_life/cqud0dx/", "num_reports": null, "stickied": false, "created": 1430461405.0, "author_flair_text": null, "created_utc": 1430432605.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cquc8j3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "obscuroaborae", "can_mod_post": false, "send_replies": true, "parent_id": "t3_34g654", "score": 2, "approved_by": null, "downs": 0, "body": "I have been there man. After college I came back to the house I grew up in and it turned into a crazy party house (my parents moved out.) I had a lot of people that I thought were friends screw me over, and I took it out on myself and on my house.\n\nI ended up living with my grandparents for a while after that, and bless her heart, my grandma would be me Shiner and Marlboros and I'd sit at home all day on my laptop playing emulator games or watching Lost.\n\nWhat I learned is that depression, for me, is deeply seated in nostalgia. I know that right now, things seem so dark and gloomy, but you can't imagine what could possibly be just around the corner for you. Stop dwelling in the past my friend, your entire future is ahead of you...\n\nIf you ever need to talk I'm here, and I really do care about what you're going through. It reminds me so much of my own struggle.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have been there man. After college I came back to the house I grew up in and it turned into a crazy party house (my parents moved out.) I had a lot of people that I thought were friends screw me over, and I took it out on myself and on my house.&lt;/p&gt;\n\n&lt;p&gt;I ended up living with my grandparents for a while after that, and bless her heart, my grandma would be me Shiner and Marlboros and I&amp;#39;d sit at home all day on my laptop playing emulator games or watching Lost.&lt;/p&gt;\n\n&lt;p&gt;What I learned is that depression, for me, is deeply seated in nostalgia. I know that right now, things seem so dark and gloomy, but you can&amp;#39;t imagine what could possibly be just around the corner for you. Stop dwelling in the past my friend, your entire future is ahead of you...&lt;/p&gt;\n\n&lt;p&gt;If you ever need to talk I&amp;#39;m here, and I really do care about what you&amp;#39;re going through. It reminds me so much of my own struggle.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_cquc8j3", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/34g654/23m_who_has_squandered_all_opportunities_in_life/cquc8j3/", "num_reports": null, "stickied": false, "created": 1430460062.0, "author_flair_text": null, "created_utc": 1430431262.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]