[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello all. &lt;/p&gt;\n\n&lt;p&gt;i have been through multiple things, which may not be much to many, but to me have built up. The single largest thing is my relationship ended with my partner 6 months ago and I still feel the same way I did in the first week. I Don&amp;#39;t even want to move on, every day is a struggle and I&amp;#39;m constantly tired. Furthermore, I just get thrown to the sidelines by everyone &lt;/p&gt;\n\n&lt;p&gt;I have good prospects in terms of my job (I am hitting 20 soon, so pretty young I guess) but no one to share this with. I have no real friends, if I called the two &amp;quot;friends&amp;quot; I have and needed help they wouldn&amp;#39;t be there. I love my &amp;quot;ex&amp;quot; and every day I feel immeasurable pain. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve always believed there is good in the world, and (to me) I&amp;#39;ve been through a lot of shit. I&amp;#39;ve still always believed this. However my break up has pushed me over the edge. I also get this random happiness for like half an hour then it goes and I&amp;#39;m back to this. It&amp;#39;s like torture. I don&amp;#39;t have the bollocks to kill myself because I know what this would do to my family. I feel like writing that it seems good I have family who care, but it feels like more a burden. That sounds awf, please do not think of me as a bad person. &lt;/p&gt;\n\n&lt;p&gt;I understand life isn&amp;#39;t fair. I understand the world owes me nothing, and I do try to work hard for what I want. But what is there without the one you love? I know I&amp;#39;m young, I know people will say there are others, but I do not want others. I want him. He loves me too but says we can&amp;#39;t be together because of our past. He also has many issues that messed him up. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s all a mess. My fucking head is killing me. A good analogy I guess is that I&amp;#39;m rotting.. Rotting inside. And it&amp;#39;s starting to show. I constantly look pale, tired... Worn down.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m gay by the way, just so you don&amp;#39;t assume I&amp;#39;m female. &lt;/p&gt;\n\n&lt;p&gt;I want to be strong. I want more than anything for all this to leave me alone. I don&amp;#39;t know what to achieve by posting this. I&amp;#39;m so sorry. I love the world, but feel like it is covered by a dark cloud. &lt;/p&gt;\n\n&lt;p&gt;I hope you are well. &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;despair&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hello all. \n\ni have been through multiple things, which may not be much to many, but to me have built up. The single largest thing is my relationship ended with my partner 6 months ago and I still feel the same way I did in the first week. I Don't even want to move on, every day is a struggle and I'm constantly tired. Furthermore, I just get thrown to the sidelines by everyone \n\nI have good prospects in terms of my job (I am hitting 20 soon, so pretty young I guess) but no one to share this with. I have no real friends, if I called the two \"friends\" I have and needed help they wouldn't be there. I love my \"ex\" and every day I feel immeasurable pain. \n\nI've always believed there is good in the world, and (to me) I've been through a lot of shit. I've still always believed this. However my break up has pushed me over the edge. I also get this random happiness for like half an hour then it goes and I'm back to this. It's like torture. I don't have the bollocks to kill myself because I know what this would do to my family. I feel like writing that it seems good I have family who care, but it feels like more a burden. That sounds awf, please do not think of me as a bad person. \n\nI understand life isn't fair. I understand the world owes me nothing, and I do try to work hard for what I want. But what is there without the one you love? I know I'm young, I know people will say there are others, but I do not want others. I want him. He loves me too but says we can't be together because of our past. He also has many issues that messed him up. \n\nIt's all a mess. My fucking head is killing me. A good analogy I guess is that I'm rotting.. Rotting inside. And it's starting to show. I constantly look pale, tired... Worn down.\n\nI'm gay by the way, just so you don't assume I'm female. \n\nI want to be strong. I want more than anything for all this to leave me alone. I don't know what to achieve by posting this. I'm so sorry. I love the world, but feel like it is covered by a dark cloud. \n\nI hope you are well. \n\n- despair", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "34g3mw", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "somuchdespair", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 3, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 2, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83419, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_34g3mw", "spoiler": false, "permalink": "/r/SuicideWatch/comments/34g3mw/i_have_no_strength_left/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1430457602.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/34g3mw/i_have_no_strength_left/", "author_flair_text": null, "quarantine": false, "title": "I have no strength left", "created_utc": 1430428802.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 0.81, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 3}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_34g3mw", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_34g3mw", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cqussir", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "somuchdespair", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cquh3d5", "score": 1, "approved_by": null, "downs": 0, "body": "Hi John, thank you for taking the time to write to me. It's so strange going through heartbreak for the first time, especially when lots of other problems are always piled up and the relationship was the only place I felt somewhat \"safe\". I am really glad you met someone else and are now happy -- may I ask if you still miss the person who broke your heart? Does the pain ease? I totally understand when you say you just \"want to sleep for a few years and not wake up\". That would be heaven! It feels like it would be so refreshing. I just don't really know how to proceed, I've read lots of things that say look after yourself, follow your hobbies - but it all takes so much effort. I also feel like I won't be able to open up my heart to another again; how did you manage to do so? Although we are all different, thus tackle things differently, but I just have no idea how to approach this. And it's been months. I'm now at the stage where I should \"just be over it\" as people in my life have said, but it just doesn't happen. Again, John, thank you for your kind words. I guess sometimes we all just need someone to lean on. Have a brilliant day mate. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi John, thank you for taking the time to write to me. It&amp;#39;s so strange going through heartbreak for the first time, especially when lots of other problems are always piled up and the relationship was the only place I felt somewhat &amp;quot;safe&amp;quot;. I am really glad you met someone else and are now happy -- may I ask if you still miss the person who broke your heart? Does the pain ease? I totally understand when you say you just &amp;quot;want to sleep for a few years and not wake up&amp;quot;. That would be heaven! It feels like it would be so refreshing. I just don&amp;#39;t really know how to proceed, I&amp;#39;ve read lots of things that say look after yourself, follow your hobbies - but it all takes so much effort. I also feel like I won&amp;#39;t be able to open up my heart to another again; how did you manage to do so? Although we are all different, thus tackle things differently, but I just have no idea how to approach this. And it&amp;#39;s been months. I&amp;#39;m now at the stage where I should &amp;quot;just be over it&amp;quot; as people in my life have said, but it just doesn&amp;#39;t happen. Again, John, thank you for your kind words. I guess sometimes we all just need someone to lean on. Have a brilliant day mate. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_cqussir", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/34g3mw/i_have_no_strength_left/cqussir/", "num_reports": null, "stickied": false, "created": 1430492771.0, "author_flair_text": null, "created_utc": 1430463971.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cquh3d5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "JohnMalkovitchLover", "can_mod_post": false, "send_replies": true, "parent_id": "t3_34g3mw", "score": 1, "approved_by": null, "downs": 0, "body": "Even though you are going through all of this pain you still care for others, and that's very admirable. I am truly sorry that you went through such a tough time with your breakup and I know you don't want to hear speeches about how \"it gets better\" or \"you'll feel better with time\" because no one can guarantee that and life is hard. Sometimes I'm so exhausted with the whole thing I just want to sleep for a few years and not wake up. I hear you, trust me. All I can say is that I went through a terrible breakup when I was your age, and later I actually met someone who was much MUCH better for me, so although I can't guarantee that will be the case for you, I would be willing to bet on it because time is on your side. My mom left my dad after 35 years of marriage and he's single at almost 60... Now when he says he's lonely I don't know what to say, you know? My mom was it for him. Maybe this person you lost was it for you. I hope not. I hope you stick it out a bit longer and see what happens next; I know you're hurting and you're lonely but you can survive this. Just be yourself, you are kind and intelligent... Someone even better might just come along and recognize that. In any case, I wish you the very best. You deserve better than heartbreak.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even though you are going through all of this pain you still care for others, and that&amp;#39;s very admirable. I am truly sorry that you went through such a tough time with your breakup and I know you don&amp;#39;t want to hear speeches about how &amp;quot;it gets better&amp;quot; or &amp;quot;you&amp;#39;ll feel better with time&amp;quot; because no one can guarantee that and life is hard. Sometimes I&amp;#39;m so exhausted with the whole thing I just want to sleep for a few years and not wake up. I hear you, trust me. All I can say is that I went through a terrible breakup when I was your age, and later I actually met someone who was much MUCH better for me, so although I can&amp;#39;t guarantee that will be the case for you, I would be willing to bet on it because time is on your side. My mom left my dad after 35 years of marriage and he&amp;#39;s single at almost 60... Now when he says he&amp;#39;s lonely I don&amp;#39;t know what to say, you know? My mom was it for him. Maybe this person you lost was it for you. I hope not. I hope you stick it out a bit longer and see what happens next; I know you&amp;#39;re hurting and you&amp;#39;re lonely but you can survive this. Just be yourself, you are kind and intelligent... Someone even better might just come along and recognize that. In any case, I wish you the very best. You deserve better than heartbreak.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_cquh3d5", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/34g3mw/i_have_no_strength_left/cquh3d5/", "num_reports": null, "stickied": false, "created": 1430468585.0, "author_flair_text": null, "created_utc": 1430439785.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]