[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I moved from my home town to pursue a relationship and in the interim my girlfriend went on a long vacation a week before the move and did a bunch of drugs and whatever was left of our relationship was too weak to withstand the natural stressors of moving 500 miles. She read my diary the day I moved from the first time from my home town and destroyed any trust we had, held things against me I wrote, then came over to my apartment to get the rest of her things when I wasn&amp;#39;t there without my consent.\nI wish I knew why things have to be so hard, when I had such high hopes dashed. I try to take the best care of myself I am able to, I eat well and exercise almost every day, but it doesn&amp;#39;t seem to make a dent into my depression. I wake up with anxiety attacks often and I feel more lost and confused about the whole nature of my entire life. I just wanted to come here and stand on my own two feet and make someone I love proud of me, but I guess I can&amp;#39;t have that now. I have to start from literally nothing, no support system, no shoulder to cry on. I&amp;#39;m aghast and it seems I will be for some time.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I moved from my home town to pursue a relationship and in the interim my girlfriend went on a long vacation a week before the move and did a bunch of drugs and whatever was left of our relationship was too weak to withstand the natural stressors of moving 500 miles. She read my diary the day I moved from the first time from my home town and destroyed any trust we had, held things against me I wrote, then came over to my apartment to get the rest of her things when I wasn't there without my consent.\nI wish I knew why things have to be so hard, when I had such high hopes dashed. I try to take the best care of myself I am able to, I eat well and exercise almost every day, but it doesn't seem to make a dent into my depression. I wake up with anxiety attacks often and I feel more lost and confused about the whole nature of my entire life. I just wanted to come here and stand on my own two feet and make someone I love proud of me, but I guess I can't have that now. I have to start from literally nothing, no support system, no shoulder to cry on. I'm aghast and it seems I will be for some time.", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4h6bun", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "ImpureJelly", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 0, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338991, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_4h6bun", "spoiler": false, "permalink": "/r/depression/comments/4h6bun/moved_to_a_new_city_lost_the_love_of_my_life/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1462081092.0, "url": "https://www.reddit.com/r/depression/comments/4h6bun/moved_to_a_new_city_lost_the_love_of_my_life/", "author_flair_text": null, "quarantine": false, "title": "Moved to a new city lost the love of my life, feeling alone and majorly depresesd", "created_utc": 1462052292.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [], "before": null}}]