[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Wife is divorcing me. Since losing my high paying job she&amp;#39;s been unhappy with life and asked me to leave her alone and wouldn&amp;#39;t talk to me for the last couple months. She told me the other day she is moving and divorcing me. We moved to another state away from everyone we know a couple months ago for this job. &lt;/p&gt;\n\n&lt;p&gt;I layed in bed thinking of just sitting in the tub and cutting my wrists and ending it, it was a very real thought at this point. I decided to fall a sleep instead because I have a daughter that still needs her father. In the last three months I&amp;#39;ve gotten in to the best shape I have been in years. I&amp;#39;m fit, decently muscular, not bad looking and still young. I&amp;#39;m going to move back before the wife has the chance to leave me here alone. I&amp;#39;m going to move in with a friend of mine and be able to see my family and my daughter again. Going to be social again, get back in to bodybuilding like the good days. I have job offers back home. It&amp;#39;s just a matter of time now before I make the move. &lt;/p&gt;\n\n&lt;p&gt;I decided it&amp;#39;s not worth living with a woman that won&amp;#39;t speak to me, wear her ring, deletes me off Facebook and doesn&amp;#39;t acknowledge our marriage. She doesn&amp;#39;t trust me because I broke the promise of having this high paying job I brought her out here for (they layed me off because of lack of business, not something I did). &lt;/p&gt;\n\n&lt;p&gt;I said things I shouldn&amp;#39;t have. I told her she was evil for being emotionally abusive towards me, sketchy and downright unmotivated to try and make this marriage work any longer. &lt;/p&gt;\n\n&lt;p&gt;I still have my depressed moments these last few days but realizing that I&amp;#39;m not a terrible person and she isn&amp;#39;t the kind of person anyone should be with has made me feel a little better and get through this. I&amp;#39;m not saying I&amp;#39;m a great person, but I&amp;#39;ve done everything I can do make it work-surprises, I love you notes, paying all the bills myself so she can enjoy herself while I&amp;#39;ve eaten only eggs and chicken the last few months (why I&amp;#39;ve gotten back in to shape). I&amp;#39;ve also cleaned the house on my days off, cooked foods I don&amp;#39;t eat because she likes it and worked a butt load of overtime. I think it&amp;#39;s time to take a step back and evaluate things and better myself and take care of me and my daughter. &lt;/p&gt;\n\n&lt;p&gt;Basically I&amp;#39;m going to make the first move before she has the chance to screw me over even more than I already feel screwed over. I have been through a lot in life already at this point. Time for things to get better. I love you guys. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Wife is divorcing me. Since losing my high paying job she's been unhappy with life and asked me to leave her alone and wouldn't talk to me for the last couple months. She told me the other day she is moving and divorcing me. We moved to another state away from everyone we know a couple months ago for this job. \n\nI layed in bed thinking of just sitting in the tub and cutting my wrists and ending it, it was a very real thought at this point. I decided to fall a sleep instead because I have a daughter that still needs her father. In the last three months I've gotten in to the best shape I have been in years. I'm fit, decently muscular, not bad looking and still young. I'm going to move back before the wife has the chance to leave me here alone. I'm going to move in with a friend of mine and be able to see my family and my daughter again. Going to be social again, get back in to bodybuilding like the good days. I have job offers back home. It's just a matter of time now before I make the move. \n\nI decided it's not worth living with a woman that won't speak to me, wear her ring, deletes me off Facebook and doesn't acknowledge our marriage. She doesn't trust me because I broke the promise of having this high paying job I brought her out here for (they layed me off because of lack of business, not something I did). \n\nI said things I shouldn't have. I told her she was evil for being emotionally abusive towards me, sketchy and downright unmotivated to try and make this marriage work any longer. \n\nI still have my depressed moments these last few days but realizing that I'm not a terrible person and she isn't the kind of person anyone should be with has made me feel a little better and get through this. I'm not saying I'm a great person, but I've done everything I can do make it work-surprises, I love you notes, paying all the bills myself so she can enjoy herself while I've eaten only eggs and chicken the last few months (why I've gotten back in to shape). I've also cleaned the house on my days off, cooked foods I don't eat because she likes it and worked a butt load of overtime. I think it's time to take a step back and evaluate things and better myself and take care of me and my daughter. \n\nBasically I'm going to make the first move before she has the chance to screw me over even more than I already feel screwed over. I have been through a lot in life already at this point. Time for things to get better. I love you guys. ", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4h6adx", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "Bearded_kat", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 2, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338991, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_4h6adx", "spoiler": false, "permalink": "/r/depression/comments/4h6adx/layed_in_bed_thinking_of_ending_it_the_other/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1462080449.0, "url": "https://www.reddit.com/r/depression/comments/4h6adx/layed_in_bed_thinking_of_ending_it_the_other/", "author_flair_text": null, "quarantine": false, "title": "Layed in bed thinking of ending it the other night but then the next day I felt different", "created_utc": 1462051649.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6adx", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6adx", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oytef", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Bearded_kat", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nrlsf", "score": 1, "approved_by": null, "downs": 0, "body": "I'm really sorry about your treatment resistance. I really am. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really sorry about your treatment resistance. I really am. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d2oytef", "score_hidden": false, "permalink": "/r/depression/comments/4h6adx/layed_in_bed_thinking_of_ending_it_the_other/d2oytef/", "num_reports": null, "stickied": false, "created": 1462173646.0, "author_flair_text": null, "created_utc": 1462144846.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nrlsf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "depressed_Mommy", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6adx", "score": 1, "approved_by": null, "downs": 0, "body": "I'm sorry to hear that things have been so rough for you. I understand from years of personal experience how devastating mental illness (in my case treatment resistant Major Depressive Disorder) can be. I have just completed my first session of ECT and am hopeful this will jump start my recovery. I hope the best for you too!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m sorry to hear that things have been so rough for you. I understand from years of personal experience how devastating mental illness (in my case treatment resistant Major Depressive Disorder) can be. I have just completed my first session of ECT and am hopeful this will jump start my recovery. I hope the best for you too!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d2nrlsf", "score_hidden": false, "permalink": "/r/depression/comments/4h6adx/layed_in_bed_thinking_of_ending_it_the_other/d2nrlsf/", "num_reports": null, "stickied": false, "created": 1462082399.0, "author_flair_text": null, "created_utc": 1462053599.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]