[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have PTSD because I was sexualy, physically, emotionally, and mentally abused by my father every day for the first 5 years of my life. I remember things from ages 2 and up. I literally do not know what life is like without PTSD and the constant struggles that come along with it. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been dating my boyfriend for four and a half years. The night I met him was the closest I ever felt to &amp;quot;normal&amp;quot;. I wasn&amp;#39;t scared or shy. I felt so comfortable with him. It was the most amazing feeling ever. That feeling has only grown over the years. He knows everything about my childhood and I feel completely comfortable telling him everything and anything. It&amp;#39;s absolutely amazing. I know that no relationship is perfect, but ours is as close as it gets. He treats me like a princess, he loves me unconditionally, we trust each other, we have great communication, he&amp;#39;s willing to help me battle this shitty disorder. So, this paragraph probably makes the title confusing. &lt;/p&gt;\n\n&lt;p&gt;There are certain family members (mostly his sister and aunt but a few others as well) who don&amp;#39;t understand PTSD. They think I should just &amp;quot;let it go&amp;quot; and &amp;quot;stop worrying&amp;quot; about what my father did to me. They don&amp;#39;t understand how things not related to my father can trigger me. They&amp;#39;ve told Michael they &amp;quot;won&amp;#39;t let him marry me&amp;quot; and that he &amp;quot;needs to leave me&amp;quot; because I&amp;#39;m a &amp;quot;lunatic who pulls baby shit all the time&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;The &amp;quot;baby shit&amp;quot; they&amp;#39;re referring to is when I get triggered. He has a lot of relatives and friends that say a lot of crude things, get really loud and in your face, etc. Holidays at his house get very overwhelming for me. They&amp;#39;re only trying to enjoy themselves and they don&amp;#39;t mean any harm, but my broken brain doesn&amp;#39;t understand that. So sometimes I need a minute. Usually I&amp;#39;ll freak out and run to my car and cry. My boyfriend comes out to try and calm me down, which would work fine (we have a plan in place!) if it weren&amp;#39;t for his family. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ll call him and text him and even come outside yelling and screaming and calling me names and making fun of me. They&amp;#39;ll rant about how he needs to &amp;quot;just forget&amp;quot; me and again insist that I&amp;#39;m a &amp;quot;bitch&amp;quot;, &amp;quot;lunatic&amp;quot;, and &amp;quot;a baby&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;He tries to get them to stop and go away, but there&amp;#39;s only so much he can do. He&amp;#39;s not going to lay a hand on them and they don&amp;#39;t care what he says to them. We&amp;#39;re only 22 and 24 so he still lives at home, he can&amp;#39;t just leave. Plus, we&amp;#39;d both prefer to let my meltdown pass and go back inside to enjoy ourselves with the good relatives! And if they just leave us a lone and let him help me it would be fine. &lt;/p&gt;\n\n&lt;p&gt;But instead they pull their crap and I get worse and what could have taken 5-10 minutes ends up lasting hours. Because than I feel like crap. They&amp;#39;re making me feel like I don&amp;#39;t deserve to be alive because I&amp;#39;m all fucked up because of a childhood from hell. They make me feel like the world is better off without me becasue I&amp;#39;m the biggest fucked up piece of shit that ever had the audacity to think they deserve to breathe.  &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;re not the type that is compassionate or understanding. So having my boyfriend try to explain to them what PTSD is won&amp;#39;t work. They&amp;#39;ve called it an excuse before the last time he tried. &lt;/p&gt;\n\n&lt;p&gt;They&amp;#39;ve started texted me saying horrible things as well. &lt;/p&gt;\n\n&lt;p&gt;I love my boyfriend more than anything. He&amp;#39;s an amazing person and has helped me so much. I can&amp;#39;t imagine life without him. But I&amp;#39;m constantly stressed out because of his family. &lt;/p&gt;\n\n&lt;p&gt;Do I have to break up with him? I know I don&amp;#39;t want to, but do I have to? &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I have PTSD because I was sexualy, physically, emotionally, and mentally abused by my father every day for the first 5 years of my life. I remember things from ages 2 and up. I literally do not know what life is like without PTSD and the constant struggles that come along with it. \n\nI've been dating my boyfriend for four and a half years. The night I met him was the closest I ever felt to \"normal\". I wasn't scared or shy. I felt so comfortable with him. It was the most amazing feeling ever. That feeling has only grown over the years. He knows everything about my childhood and I feel completely comfortable telling him everything and anything. It's absolutely amazing. I know that no relationship is perfect, but ours is as close as it gets. He treats me like a princess, he loves me unconditionally, we trust each other, we have great communication, he's willing to help me battle this shitty disorder. So, this paragraph probably makes the title confusing. \n\nThere are certain family members (mostly his sister and aunt but a few others as well) who don't understand PTSD. They think I should just \"let it go\" and \"stop worrying\" about what my father did to me. They don't understand how things not related to my father can trigger me. They've told Michael they \"won't let him marry me\" and that he \"needs to leave me\" because I'm a \"lunatic who pulls baby shit all the time\". \n\nThe \"baby shit\" they're referring to is when I get triggered. He has a lot of relatives and friends that say a lot of crude things, get really loud and in your face, etc. Holidays at his house get very overwhelming for me. They're only trying to enjoy themselves and they don't mean any harm, but my broken brain doesn't understand that. So sometimes I need a minute. Usually I'll freak out and run to my car and cry. My boyfriend comes out to try and calm me down, which would work fine (we have a plan in place!) if it weren't for his family. \n\nThey'll call him and text him and even come outside yelling and screaming and calling me names and making fun of me. They'll rant about how he needs to \"just forget\" me and again insist that I'm a \"bitch\", \"lunatic\", and \"a baby\". \n\nHe tries to get them to stop and go away, but there's only so much he can do. He's not going to lay a hand on them and they don't care what he says to them. We're only 22 and 24 so he still lives at home, he can't just leave. Plus, we'd both prefer to let my meltdown pass and go back inside to enjoy ourselves with the good relatives! And if they just leave us a lone and let him help me it would be fine. \n\nBut instead they pull their crap and I get worse and what could have taken 5-10 minutes ends up lasting hours. Because than I feel like crap. They're making me feel like I don't deserve to be alive because I'm all fucked up because of a childhood from hell. They make me feel like the world is better off without me becasue I'm the biggest fucked up piece of shit that ever had the audacity to think they deserve to breathe.  \n\nThey're not the type that is compassionate or understanding. So having my boyfriend try to explain to them what PTSD is won't work. They've called it an excuse before the last time he tried. \n\nThey've started texted me saying horrible things as well. \n\nI love my boyfriend more than anything. He's an amazing person and has helped me so much. I can't imagine life without him. But I'm constantly stressed out because of his family. \n\nDo I have to break up with him? I know I don't want to, but do I have to? ", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "5g0s12", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "caviabella", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 4, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 4, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_5g0s12", "spoiler": false, "permalink": "/r/ptsd/comments/5g0s12/do_i_have_to_break_up_with_my_boyfriend/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1480674658.0, "url": "https://www.reddit.com/r/ptsd/comments/5g0s12/do_i_have_to_break_up_with_my_boyfriend/", "author_flair_text": null, "quarantine": false, "title": "Do I have to break up with my boyfriend?", "created_utc": 1480645858.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.83, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 4}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5g0s12", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5g0s12", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "db7rft1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_db7nadb", "score": 1, "approved_by": null, "downs": 0, "body": "Wow! Thank you!! I don't really know what else to say! This made me cry!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow! Thank you!! I don&amp;#39;t really know what else to say! This made me cry!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_db7rft1", "score_hidden": false, "permalink": "/r/ptsd/comments/5g0s12/do_i_have_to_break_up_with_my_boyfriend/db7rft1/", "num_reports": null, "stickied": false, "created": 1481803758.0, "author_flair_text": null, "created_utc": 1481774958.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "db7nadb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "2ndChoiceName", "can_mod_post": false, "send_replies": true, "parent_id": "t3_5g0s12", "score": 1, "approved_by": null, "downs": 0, "body": "I don't know if I'm allowed to post here or not (I don't have PTSD), but I may have something to say.\n\nI recently got out of a relationship with a girl who had PTSD (as well as some other comorbid disorders). She ended it because of very similar reasons. She hated herself for exposing me to all her problems, and that only made things worse for her. She ended it not only to save me from that stress, but also to save herself from the second order stress that she experienced.\n\nWhat I tried to tell her, and what she didn't understand, was that I made the choice to date her, and I made the choice every day. The fact that I was still there every day was my own way of showing that she was worth it. \n\nShe should never have felt guilty for putting me through something that I actively chose to be a part of, and neither should you. I made the choice to be with her, knowing all about her emotional baggage, and it leaves a bad taste in my mouth knowing that she ended it for my well being, when that should have been my choice. It wasn't that simple with my relationship because it also had a negative affect on her, but if you feel as though the only reason you're ending the relationship is to save him from pain then I think that's the wrong reason. The fact that he's still there shows that he thinks you're worth it.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t know if I&amp;#39;m allowed to post here or not (I don&amp;#39;t have PTSD), but I may have something to say.&lt;/p&gt;\n\n&lt;p&gt;I recently got out of a relationship with a girl who had PTSD (as well as some other comorbid disorders). She ended it because of very similar reasons. She hated herself for exposing me to all her problems, and that only made things worse for her. She ended it not only to save me from that stress, but also to save herself from the second order stress that she experienced.&lt;/p&gt;\n\n&lt;p&gt;What I tried to tell her, and what she didn&amp;#39;t understand, was that I made the choice to date her, and I made the choice every day. The fact that I was still there every day was my own way of showing that she was worth it. &lt;/p&gt;\n\n&lt;p&gt;She should never have felt guilty for putting me through something that I actively chose to be a part of, and neither should you. I made the choice to be with her, knowing all about her emotional baggage, and it leaves a bad taste in my mouth knowing that she ended it for my well being, when that should have been my choice. It wasn&amp;#39;t that simple with my relationship because it also had a negative affect on her, but if you feel as though the only reason you&amp;#39;re ending the relationship is to save him from pain then I think that&amp;#39;s the wrong reason. The fact that he&amp;#39;s still there shows that he thinks you&amp;#39;re worth it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_db7nadb", "score_hidden": false, "permalink": "/r/ptsd/comments/5g0s12/do_i_have_to_break_up_with_my_boyfriend/db7nadb/", "num_reports": null, "stickied": false, "created": 1481797908.0, "author_flair_text": null, "created_utc": 1481769108.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5g0s12", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5g0s12", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "daoqfkr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_daop6lt", "score": 2, "approved_by": null, "downs": 0, "body": "I have spilled my guts to him! He knows absolutely everything that happened, every little detail about how it made me feel and how I feel now, he knows how I feel about those certain members of his family, and he's trying to learn everything he possibly can about PTSD! HE isn't the problem, it's his family. And he's had calm talks with them and he's had screaming matches with them. Nothing stops them. We are trying our hardest to move in together but we live in a very expensive state and he doesn't have a very good job and I'm still in school. I can't balance school and work. I tried working a few semesters ago and I couldn't handle it. \n\nI am so anxious and stressed because of these people. But I do not want to lose him. When I cry in my sleep at night he calmly wakes me up, pulls me closer, and tells me he's got me and I'm safe and everything is okay. Even when he has to get up super early. He loves me. I actually found a guy who loves me and won't hurt me. I never thought that would happen. My father, in court, said I'd be an emotionally \"fucked up animal\" and that I'd \"never be able to have any type of relationship\". I believed him until I met Michael. Except now Michael's family seems to be agreeing with the monster. \n\n\nI was in therapy from ages 4-15, but I stopped because my mother said she couldn't afford it any more. Fast forward to now, and I found out it's because my mom doesn't want to \"hurt her image by having a crazy daughter\". (She's a politician.) She's....difficult. I try not to blame her becasue I know my dad mentally screwed her up. But I also kind of blame her...She said she *might* allow me to go when my youngest sister turns 18, which will be in two years. I can't sneak it because I don't know my insurance information or social security number. In the meantime, I try to remember the techniques I learned when I was a kid. I fill in the blanks with Google. One of my friends is a therapist so she helps me sometimes and sends me articles and activities and stuff for free. \n\nMy life has been difficult, to say the least. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have spilled my guts to him! He knows absolutely everything that happened, every little detail about how it made me feel and how I feel now, he knows how I feel about those certain members of his family, and he&amp;#39;s trying to learn everything he possibly can about PTSD! HE isn&amp;#39;t the problem, it&amp;#39;s his family. And he&amp;#39;s had calm talks with them and he&amp;#39;s had screaming matches with them. Nothing stops them. We are trying our hardest to move in together but we live in a very expensive state and he doesn&amp;#39;t have a very good job and I&amp;#39;m still in school. I can&amp;#39;t balance school and work. I tried working a few semesters ago and I couldn&amp;#39;t handle it. &lt;/p&gt;\n\n&lt;p&gt;I am so anxious and stressed because of these people. But I do not want to lose him. When I cry in my sleep at night he calmly wakes me up, pulls me closer, and tells me he&amp;#39;s got me and I&amp;#39;m safe and everything is okay. Even when he has to get up super early. He loves me. I actually found a guy who loves me and won&amp;#39;t hurt me. I never thought that would happen. My father, in court, said I&amp;#39;d be an emotionally &amp;quot;fucked up animal&amp;quot; and that I&amp;#39;d &amp;quot;never be able to have any type of relationship&amp;quot;. I believed him until I met Michael. Except now Michael&amp;#39;s family seems to be agreeing with the monster. &lt;/p&gt;\n\n&lt;p&gt;I was in therapy from ages 4-15, but I stopped because my mother said she couldn&amp;#39;t afford it any more. Fast forward to now, and I found out it&amp;#39;s because my mom doesn&amp;#39;t want to &amp;quot;hurt her image by having a crazy daughter&amp;quot;. (She&amp;#39;s a politician.) She&amp;#39;s....difficult. I try not to blame her becasue I know my dad mentally screwed her up. But I also kind of blame her...She said she &lt;em&gt;might&lt;/em&gt; allow me to go when my youngest sister turns 18, which will be in two years. I can&amp;#39;t sneak it because I don&amp;#39;t know my insurance information or social security number. In the meantime, I try to remember the techniques I learned when I was a kid. I fill in the blanks with Google. One of my friends is a therapist so she helps me sometimes and sends me articles and activities and stuff for free. &lt;/p&gt;\n\n&lt;p&gt;My life has been difficult, to say the least. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_daoqfkr", "score_hidden": false, "permalink": "/r/ptsd/comments/5g0s12/do_i_have_to_break_up_with_my_boyfriend/daoqfkr/", "num_reports": null, "stickied": false, "created": 1480684439.0, "author_flair_text": null, "created_utc": 1480655639.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "daop6lt", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "jordash25", "can_mod_post": false, "send_replies": true, "parent_id": "t3_5g0s12", "score": 3, "approved_by": null, "downs": 0, "body": "Just let it go...hearing those words makes me want to murder someone.  First off don't let outsiders influence your relationship.  Block everyone of there non empathetic asses. If you love him enough you will sit him down and spill your guts to him.  Lay everything out on the table, even if you break down...let it ALL out.  Second we don't have a mental illness, our central nervous system is the cause of our issues.  \nIts a learned behavior that we have accepted as children and seems impossible to overcome.  What ever you do do not blame yourself you may say or do something you will regret moments later. Are you seeing a therapist?  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just let it go...hearing those words makes me want to murder someone.  First off don&amp;#39;t let outsiders influence your relationship.  Block everyone of there non empathetic asses. If you love him enough you will sit him down and spill your guts to him.  Lay everything out on the table, even if you break down...let it ALL out.  Second we don&amp;#39;t have a mental illness, our central nervous system is the cause of our issues.&lt;br/&gt;\nIts a learned behavior that we have accepted as children and seems impossible to overcome.  What ever you do do not blame yourself you may say or do something you will regret moments later. Are you seeing a therapist?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_daop6lt", "score_hidden": false, "permalink": "/r/ptsd/comments/5g0s12/do_i_have_to_break_up_with_my_boyfriend/daop6lt/", "num_reports": null, "stickied": false, "created": 1480682524.0, "author_flair_text": null, "created_utc": 1480653724.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]