[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;First of all, I&amp;#39;m sorry for the horrible organization/writing because I&amp;#39;m not myself anymore and can&amp;#39;t think straight. This post may feel biased at times and I might even contradict myself but I&amp;#39;ll try to give the most accurate picture of the situation as possible. I do realize that many people have it worse than me from lurking in this subreddit but I just want to get out everything what&amp;#39;s in my head. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an 18 year old guy from Canada who&amp;#39;s in my last year of high school. About 2 years ago, I locked myself in my room for 4 months (April-July) and stopped going to school. I only went downstairs when my mom&amp;#39;s not around so I wouldn&amp;#39;t starve myself to death. During this time, I made no social interactions and browsed meaningless things on the internet like a mindless zombie. I didn&amp;#39;t make much progress being inside even though I spent a lot of the time daydreaming. With the help of my school counselor, I was convinced to come back and forced myself maintain a normal life after the summer break. My school also decided to let me stay for an extra year to catch up on my courses. Things sailed relatively smooth since then, that is until now.&lt;/p&gt;\n\n&lt;p&gt;My depression has been coming back and forth but currently it&amp;#39;s worse than anything I&amp;#39;ve experienced. I already skipped a quarter of my classes since the semester began and am barely keeping up with the course load. When it comes to my priorities, I either procrastinate until the last second or give up on it altogether. I am indecisive and feel like I have no common instinct on certain things in daily life. For the past couple of months, I&amp;#39;ve been sleeping around 3 am (even on weekdays) and going straight back to bed until late at night when I get home from school. I only eat 2 meals a day since I&amp;#39;m used to the emptiness of my stomach and can&amp;#39;t even tell if I&amp;#39;m hungry or not. Whenever it comes to homework and tests, I can&amp;#39;t start moving my pen and even if I do, I seem to make no progress with my work at all. I always find myself watching pointless videos, reading boring articles, sleeping 10 or more hours a day, and longing for the past when everything was better as a way to escape reality. To put into perspective, I&amp;#39;ve probably wasted my life watching tens of thousands of YouTube videos over the past few years. &lt;/p&gt;\n\n&lt;p&gt;Being born into an Asian family, my parents aren&amp;#39;t really supportive and goes about things in their traditional way. I am an only child and my family is separated with my father working in his own company in China. He started cheating on my mother when I was grade 4 and it&amp;#39;s still going on with different women. During that time, my mom put her resentment towards me as she has no one else to turn to. But what could I do at that young age? Even I knew back then that I can&amp;#39;t do anything to fix my parents&amp;#39; relationship. The only reason why my parents haven&amp;#39;t divorced is because my mom depends on my father. She can&amp;#39;t sustain herself because of her English despite taking English classes for many years. For the past decade, she&amp;#39;s been the lonely housewife that watches Korean drama and reality shows at home. As for my dad, he&amp;#39;s a heavy drinker and when business doesn&amp;#39;t go well he vents out his anger at me. I am the punching bag in my family, whenever something goes wrong, I am responsible for all the blame. I guess the only thing that I can be thankful for is not being raised in an abusive family.&lt;/p&gt;\n\n&lt;p&gt;The main problem I have now is that I&amp;#39;m afraid of not getting in to any of the universities I&amp;#39;ve applied. Many years ago, I&amp;#39;ve already planned on getting into some really prestigious universities (UBC and UoT if that matters) for my future. Now the only universities I&amp;#39;m interested going into (SFU and Waterloo) wouldn&amp;#39;t even accept me from how things are looking right now. I just want a free ticket to the universities I desire so I&amp;#39;m guaranteed to still have a path to walk on. I do know that this doesn&amp;#39;t solve everything, I&amp;#39;ll probably continue to do horribly in my studies and depression might haunt me forever. But I believe that going to university will be a new chapter in my life, by going to a new environment and meeting new people, it might change my mental state for the better. I&amp;#39;m also using this chance to start anew and to try forgetting everything that has happened in the past.&lt;/p&gt;\n\n&lt;p&gt;Before any of this happened, I was always a student who got close to straight As and had a decent social life despite being introverted. People used to come up to me by themselves but now even if I tried to initiate a conversation, the other person most likely won&amp;#39;t show any interest. I feel like that I&amp;#39;ve disappointed the &amp;quot;old me&amp;quot; by screwing up in every possible way by going down this unexpected fate. No matter what I try, I don&amp;#39;t think I can recover back to where I was before, a child that was kind, athletic, and diligent. I feel so miserable for studying hard for the past 12 years, all to be wasted at this last key moment. I am stuck because I understand that I&amp;#39;m the only one who can get myself out of this mess as nobody can replace my position. But I can&amp;#39;t do anything worthwhile as I no longer have interest in life with no one to live for, nothing to fight for.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m considering suicide as an option if I can&amp;#39;t make it to any of the universities I&amp;#39;ve applied. I know what some of you are thinking, &amp;quot;You&amp;#39;re only 18, you still have a long life ahead of you&amp;quot; or &amp;quot;Not getting into university isn&amp;#39;t the end of the world, you can go to a community college&amp;quot; but it&amp;#39;s not like that for me. Many of my friends are extremely talented and have 90%+ average for their courses (not to mention that there&amp;#39;s 2 kids from my school who got accepted to Harvard and Yale last year). And if I take my cousin for example, he&amp;#39;s currently studying engineering at UBC while being top 600 (master division) in North America for League of Legends. I know this is just peer pressure but I can&amp;#39;t lower my standards anymore since my old expectations have already been shattered. I just can&amp;#39;t accept myself living a life working on minimum wage and worrying about whether or not I&amp;#39;ll be able to pay next month&amp;#39;s rent. Furthermore, the cost of living in Canada is growing exponentially (80% of houses in Vancouver are over $1,000,000 now) and things are bound to be more competitive in the future. I just don&amp;#39;t understand how everyone around me can simply be so successful in academics and fully enjoy their interests while I can&amp;#39;t do either of them.&lt;/p&gt;\n\n&lt;p&gt;If I fail this time I don&amp;#39;t know what I would do anymore. I&amp;#39;ve already wasted a year of my life and right now I&amp;#39;m still doing nothing about it even though I know it&amp;#39;s my last chance. My school wouldn&amp;#39;t let me stay because I&amp;#39;ve already taken an extra year and I think it would be considered as taking more of the government&amp;#39;s funding. My old counselor left recently so I have no one who knows about my situation which I can talk to. I&amp;#39;ve tried calling crisis hotlines but it takes forever for them to understand my situation and all they can do is give me advice. Even if I have a good psychiatrist right now it&amp;#39;ll be too late because I&amp;#39;m on a time limit to do the best in my courses for the next 2 months before I send in my transcripts. On the possibility that my parents decide to support me, I don&amp;#39;t think I would be able keep my own dignity. I&amp;#39;d rather die in the state I&amp;#39;m in now than to be a useless coward with no job, education, and girlfriend down the road. The only thing that&amp;#39;s holding me back are regrets of the hobbies I don&amp;#39;t care anymore. Anime that I&amp;#39;ll never watch, games that I&amp;#39;ll never play, innovations in technology, and the future of my beautiful country.&lt;/p&gt;\n\n&lt;p&gt;If you made it this far, thanks for putting up with my long, inferior level essay. There are many things I could&amp;#39;ve gone in more detail but it would just drag on forever. By no means am I complaining because I know my personality is full of flaws. I understand that I&amp;#39;m arrogant, narcissistic, sensitive, and maybe even passive-aggressive sometimes. I do realize I&amp;#39;m forcing myself into a dead end but I think this is the only direction I can take to possibly make myself happy again. I&amp;#39;m not doing this because I&amp;#39;m &amp;quot;Asian&amp;quot; but from what I learned in my family relationship, money truly can&amp;#39;t buy happiness. All I want is warm home, a lovely wife, and 2 cheerful children when I&amp;#39;m an adult. But maybe I&amp;#39;m still being optimistic, dreaming about the impossible while taking no action. Perhaps my mom is right, &amp;quot;I&amp;#39;m just using depression as an excuse to avoid doing my work&amp;quot; or that I&amp;#39;m just a person who&amp;#39;s jealous of other people&amp;#39;s achievements. My parents are probably tired of dealing with all the crap I&amp;#39;ve done. Now that I think back, I haven&amp;#39;t done anything to be proud of in the past 2 years since I&amp;#39;ve shut myself in. Thinking of suiciding is just my cowardly way of avoiding all the responsibilities I have and taking the easy way out. But I can&amp;#39;t take it anymore, it just hurts so damn much... I just want to be a normal person again, is that too much of me to ask? I wish mental health can be taken seriously and be as important as physical health.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "First of all, I'm sorry for the horrible organization/writing because I'm not myself anymore and can't think straight. This post may feel biased at times and I might even contradict myself but I'll try to give the most accurate picture of the situation as possible. I do realize that many people have it worse than me from lurking in this subreddit but I just want to get out everything what's in my head. \n\nI'm an 18 year old guy from Canada who's in my last year of high school. About 2 years ago, I locked myself in my room for 4 months (April-July) and stopped going to school. I only went downstairs when my mom's not around so I wouldn't starve myself to death. During this time, I made no social interactions and browsed meaningless things on the internet like a mindless zombie. I didn't make much progress being inside even though I spent a lot of the time daydreaming. With the help of my school counselor, I was convinced to come back and forced myself maintain a normal life after the summer break. My school also decided to let me stay for an extra year to catch up on my courses. Things sailed relatively smooth since then, that is until now.\n\nMy depression has been coming back and forth but currently it's worse than anything I've experienced. I already skipped a quarter of my classes since the semester began and am barely keeping up with the course load. When it comes to my priorities, I either procrastinate until the last second or give up on it altogether. I am indecisive and feel like I have no common instinct on certain things in daily life. For the past couple of months, I've been sleeping around 3 am (even on weekdays) and going straight back to bed until late at night when I get home from school. I only eat 2 meals a day since I'm used to the emptiness of my stomach and can't even tell if I'm hungry or not. Whenever it comes to homework and tests, I can't start moving my pen and even if I do, I seem to make no progress with my work at all. I always find myself watching pointless videos, reading boring articles, sleeping 10 or more hours a day, and longing for the past when everything was better as a way to escape reality. To put into perspective, I've probably wasted my life watching tens of thousands of YouTube videos over the past few years. \n\nBeing born into an Asian family, my parents aren't really supportive and goes about things in their traditional way. I am an only child and my family is separated with my father working in his own company in China. He started cheating on my mother when I was grade 4 and it's still going on with different women. During that time, my mom put her resentment towards me as she has no one else to turn to. But what could I do at that young age? Even I knew back then that I can't do anything to fix my parents' relationship. The only reason why my parents haven't divorced is because my mom depends on my father. She can't sustain herself because of her English despite taking English classes for many years. For the past decade, she's been the lonely housewife that watches Korean drama and reality shows at home. As for my dad, he's a heavy drinker and when business doesn't go well he vents out his anger at me. I am the punching bag in my family, whenever something goes wrong, I am responsible for all the blame. I guess the only thing that I can be thankful for is not being raised in an abusive family.\n\nThe main problem I have now is that I'm afraid of not getting in to any of the universities I've applied. Many years ago, I've already planned on getting into some really prestigious universities (UBC and UoT if that matters) for my future. Now the only universities I'm interested going into (SFU and Waterloo) wouldn't even accept me from how things are looking right now. I just want a free ticket to the universities I desire so I'm guaranteed to still have a path to walk on. I do know that this doesn't solve everything, I'll probably continue to do horribly in my studies and depression might haunt me forever. But I believe that going to university will be a new chapter in my life, by going to a new environment and meeting new people, it might change my mental state for the better. I'm also using this chance to start anew and to try forgetting everything that has happened in the past.\n\nBefore any of this happened, I was always a student who got close to straight As and had a decent social life despite being introverted. People used to come up to me by themselves but now even if I tried to initiate a conversation, the other person most likely won't show any interest. I feel like that I've disappointed the \"old me\" by screwing up in every possible way by going down this unexpected fate. No matter what I try, I don't think I can recover back to where I was before, a child that was kind, athletic, and diligent. I feel so miserable for studying hard for the past 12 years, all to be wasted at this last key moment. I am stuck because I understand that I'm the only one who can get myself out of this mess as nobody can replace my position. But I can't do anything worthwhile as I no longer have interest in life with no one to live for, nothing to fight for.\n\nI'm considering suicide as an option if I can't make it to any of the universities I've applied. I know what some of you are thinking, \"You're only 18, you still have a long life ahead of you\" or \"Not getting into university isn't the end of the world, you can go to a community college\" but it's not like that for me. Many of my friends are extremely talented and have 90%+ average for their courses (not to mention that there's 2 kids from my school who got accepted to Harvard and Yale last year). And if I take my cousin for example, he's currently studying engineering at UBC while being top 600 (master division) in North America for League of Legends. I know this is just peer pressure but I can't lower my standards anymore since my old expectations have already been shattered. I just can't accept myself living a life working on minimum wage and worrying about whether or not I'll be able to pay next month's rent. Furthermore, the cost of living in Canada is growing exponentially (80% of houses in Vancouver are over $1,000,000 now) and things are bound to be more competitive in the future. I just don't understand how everyone around me can simply be so successful in academics and fully enjoy their interests while I can't do either of them.\n\nIf I fail this time I don't know what I would do anymore. I've already wasted a year of my life and right now I'm still doing nothing about it even though I know it's my last chance. My school wouldn't let me stay because I've already taken an extra year and I think it would be considered as taking more of the government's funding. My old counselor left recently so I have no one who knows about my situation which I can talk to. I've tried calling crisis hotlines but it takes forever for them to understand my situation and all they can do is give me advice. Even if I have a good psychiatrist right now it'll be too late because I'm on a time limit to do the best in my courses for the next 2 months before I send in my transcripts. On the possibility that my parents decide to support me, I don't think I would be able keep my own dignity. I'd rather die in the state I'm in now than to be a useless coward with no job, education, and girlfriend down the road. The only thing that's holding me back are regrets of the hobbies I don't care anymore. Anime that I'll never watch, games that I'll never play, innovations in technology, and the future of my beautiful country.\n\nIf you made it this far, thanks for putting up with my long, inferior level essay. There are many things I could've gone in more detail but it would just drag on forever. By no means am I complaining because I know my personality is full of flaws. I understand that I'm arrogant, narcissistic, sensitive, and maybe even passive-aggressive sometimes. I do realize I'm forcing myself into a dead end but I think this is the only direction I can take to possibly make myself happy again. I'm not doing this because I'm \"Asian\" but from what I learned in my family relationship, money truly can't buy happiness. All I want is warm home, a lovely wife, and 2 cheerful children when I'm an adult. But maybe I'm still being optimistic, dreaming about the impossible while taking no action. Perhaps my mom is right, \"I'm just using depression as an excuse to avoid doing my work\" or that I'm just a person who's jealous of other people's achievements. My parents are probably tired of dealing with all the crap I've done. Now that I think back, I haven't done anything to be proud of in the past 2 years since I've shut myself in. Thinking of suiciding is just my cowardly way of avoiding all the responsibilities I have and taking the easy way out. But I can't take it anymore, it just hurts so damn much... I just want to be a normal person again, is that too much of me to ask? I wish mental health can be taken seriously and be as important as physical health.", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "48cyqn", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "throwaway-1997", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 20, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 22, "thumbnail": "", "hide_score": false, "edited": 1457678408.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338991, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_48cyqn", "spoiler": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1456813853.0, "url": "https://www.reddit.com/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/", "author_flair_text": null, "quarantine": false, "title": "18 and thinking of killing myself", "created_utc": 1456785053.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 0.93, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 20}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0ip07d", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Alfredoman77", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0iorz0", "score": 1, "approved_by": null, "downs": 0, "body": "I've no joke heard anyone say that about freshman year lmao. I've heard my mother tell me she hasn't spoken to her friends form early in college but the people she met after are still her good friends to this day. I know exactly how you feel about not wanting to go to community college but it's not the end of the world just trust me ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve no joke heard anyone say that about freshman year lmao. I&amp;#39;ve heard my mother tell me she hasn&amp;#39;t spoken to her friends form early in college but the people she met after are still her good friends to this day. I know exactly how you feel about not wanting to go to community college but it&amp;#39;s not the end of the world just trust me &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ip07d", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ip07d/", "num_reports": null, "stickied": false, "created": 1456817906.0, "author_flair_text": null, "created_utc": 1456789106.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0iqa27", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "abovethecurve", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0iorz0", "score": 1, "approved_by": null, "downs": 0, "body": "I think a lot of people actually really enjoy coming in as a junior transfer. A ton of people do it so its not too hard to make friends, wouldn't let that deter you from pursuing a college education", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think a lot of people actually really enjoy coming in as a junior transfer. A ton of people do it so its not too hard to make friends, wouldn&amp;#39;t let that deter you from pursuing a college education&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0iqa27", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0iqa27/", "num_reports": null, "stickied": false, "created": 1456820040.0, "author_flair_text": null, "created_utc": 1456791240.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0iorz0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0injut", "score": 2, "approved_by": null, "downs": 0, "body": "I know I'm being a stuck up for forcing myself onto one path. But even if I were to go to a community college, I would have to go through the pain of transferring to a different school afterwards. As they say, the freshman year is the best time to make friends. Being an introvert, it will be hard for me to make friends as I can't even keep a conversation going in this state.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I know I&amp;#39;m being a stuck up for forcing myself onto one path. But even if I were to go to a community college, I would have to go through the pain of transferring to a different school afterwards. As they say, the freshman year is the best time to make friends. Being an introvert, it will be hard for me to make friends as I can&amp;#39;t even keep a conversation going in this state.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0iorz0", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0iorz0/", "num_reports": null, "stickied": false, "created": 1456817556.0, "author_flair_text": null, "created_utc": 1456788756.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0injut", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Alfredoman77", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 2, "approved_by": null, "downs": 0, "body": "Not getting into some colleges doesn't mean you can't get a good job. I know a guy who fucked around in highschool and ended up at a community college. He got his shit together there and put in a ton of work so he was able\nTo get into a top engineering program and is doing great now. Maybe highschool didn't go how you wanted but there's nothing stopping your from\nImproving after. I hope this helped best of luck! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not getting into some colleges doesn&amp;#39;t mean you can&amp;#39;t get a good job. I know a guy who fucked around in highschool and ended up at a community college. He got his shit together there and put in a ton of work so he was able\nTo get into a top engineering program and is doing great now. Maybe highschool didn&amp;#39;t go how you wanted but there&amp;#39;s nothing stopping your from\nImproving after. I hope this helped best of luck! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0injut", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0injut/", "num_reports": null, "stickied": false, "created": 1456815708.0, "author_flair_text": null, "created_utc": 1456786908.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0j60zr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0izk6a", "score": 1, "approved_by": null, "downs": 0, "body": "Glad to know there's someone in the exact situation same as me. You basically backed up my point of how I got held back while everyone else I know is going to be successful and live the life they wanted. From skimming through your profile I can really relate to stuff like only doing a half-ass job in everything. In the past I could actually get away with things just by putting in a little effort. But now it's like I'm brain dead since I don't think I've ever tried to really think or problem solve in the past 2 years. Taking my last English project for example, I spent 8 hours on it the last day and barely made any progress. Nowadays I just dream of the impossible like pressing a rewind button to go back in time to when things were much simpler, even though it'll never happen.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Glad to know there&amp;#39;s someone in the exact situation same as me. You basically backed up my point of how I got held back while everyone else I know is going to be successful and live the life they wanted. From skimming through your profile I can really relate to stuff like only doing a half-ass job in everything. In the past I could actually get away with things just by putting in a little effort. But now it&amp;#39;s like I&amp;#39;m brain dead since I don&amp;#39;t think I&amp;#39;ve ever tried to really think or problem solve in the past 2 years. Taking my last English project for example, I spent 8 hours on it the last day and barely made any progress. Nowadays I just dream of the impossible like pressing a rewind button to go back in time to when things were much simpler, even though it&amp;#39;ll never happen.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0j60zr", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0j60zr/", "num_reports": null, "stickied": false, "created": 1456850917.0, "author_flair_text": null, "created_utc": 1456822117.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0izk6a", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 3, "approved_by": null, "downs": 0, "body": "Holy shit, you sound a lot like me.  Chinese, 18 years old, senior in high school, I'm in the US and a girl though. I also became a shut-in for a while, I only left the house around every 3-4 months for a year. Obviously I didn't go to school, so I got held-back a year and basically had to transfer. Started school up again, only to fall back into old habits. Have dumb high-standards for myself that, for some inexplicable reason, I still hold myself to despite not being achievable in the foreseeable future. Missed college application deadlines, so no college for me unless I go to community college. And with my dumb shit sense of elitism for myself, it pains me to think of that as my only option. Seeing all my former peers go on to achieve great things . . . I mean fucking shit, a former childhood friend got accepted to both Harvard and MIT! Others got accepted into honors colleges, full rides, etc. It's honestly so fucking painful. Especially with being a former smart kid with a promising future.\n\nI wish I had something to say that could help you, or advice, but I honestly don't. But I think I know the pain you're feeling, seeing as our situations are similar. I really, truly hope the best for you. You need to find what makes you happy, even remotely so. You can't define your happiness and success with the standards your former self had. It's going to be a struggle, and hopefully it's one you'll be able to get through.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Holy shit, you sound a lot like me.  Chinese, 18 years old, senior in high school, I&amp;#39;m in the US and a girl though. I also became a shut-in for a while, I only left the house around every 3-4 months for a year. Obviously I didn&amp;#39;t go to school, so I got held-back a year and basically had to transfer. Started school up again, only to fall back into old habits. Have dumb high-standards for myself that, for some inexplicable reason, I still hold myself to despite not being achievable in the foreseeable future. Missed college application deadlines, so no college for me unless I go to community college. And with my dumb shit sense of elitism for myself, it pains me to think of that as my only option. Seeing all my former peers go on to achieve great things . . . I mean fucking shit, a former childhood friend got accepted to both Harvard and MIT! Others got accepted into honors colleges, full rides, etc. It&amp;#39;s honestly so fucking painful. Especially with being a former smart kid with a promising future.&lt;/p&gt;\n\n&lt;p&gt;I wish I had something to say that could help you, or advice, but I honestly don&amp;#39;t. But I think I know the pain you&amp;#39;re feeling, seeing as our situations are similar. I really, truly hope the best for you. You need to find what makes you happy, even remotely so. You can&amp;#39;t define your happiness and success with the standards your former self had. It&amp;#39;s going to be a struggle, and hopefully it&amp;#39;s one you&amp;#39;ll be able to get through.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "depression", "name": "t1_d0izk6a", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0izk6a/", "num_reports": null, "stickied": false, "created": 1456834550.0, "author_flair_text": null, "created_utc": 1456805750.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0j2nmn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "cmonstaaahp", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0ip4ie", "score": 2, "approved_by": null, "downs": 0, "body": "you're very young (i know it never seems like it,) and you've probably been sheltered psychologically because of your chinese mom. you seem very intelligent, that's not the problem with chinese people, they just don't apply their intelligence in useful ways, spend their time thinking paranoid and other close minded thoughts. even if you don't get accepted or whatever to that university, there are other options that neither you nor i have thought about. if you can find some personal motivation, not to try as hard as you can, but just to keep thinking about it. we live in the west, if homeless people get to live and eat and die of old age, certainly you should be able to move away from your parents. and as far as possibly missing freshman year and all the \"socializing\" you would do, i gotta say, i came out of my parent's house with the social maturity of like a 6 year old, even though i had friends all my life, especially these western kids develop fast and healthy. it took me way long to develop my own personality and such, all of college was wasted for me anyway. my social life is fine now, remember being chinese you age well, and women like older guys anyway.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re very young (i know it never seems like it,) and you&amp;#39;ve probably been sheltered psychologically because of your chinese mom. you seem very intelligent, that&amp;#39;s not the problem with chinese people, they just don&amp;#39;t apply their intelligence in useful ways, spend their time thinking paranoid and other close minded thoughts. even if you don&amp;#39;t get accepted or whatever to that university, there are other options that neither you nor i have thought about. if you can find some personal motivation, not to try as hard as you can, but just to keep thinking about it. we live in the west, if homeless people get to live and eat and die of old age, certainly you should be able to move away from your parents. and as far as possibly missing freshman year and all the &amp;quot;socializing&amp;quot; you would do, i gotta say, i came out of my parent&amp;#39;s house with the social maturity of like a 6 year old, even though i had friends all my life, especially these western kids develop fast and healthy. it took me way long to develop my own personality and such, all of college was wasted for me anyway. my social life is fine now, remember being chinese you age well, and women like older guys anyway.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0j2nmn", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0j2nmn/", "num_reports": null, "stickied": false, "created": 1456840791.0, "author_flair_text": null, "created_utc": 1456811991.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0ip4ie", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0ioo9f", "score": 1, "approved_by": null, "downs": 0, "body": "I've applied to a few universities like SFU and Waterloo and currently waiting until I can submit my marks for term 2 in April. The reason I'm putting going to a university such a high priority is exactly because I want to escape my parents and live in a new environment.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve applied to a few universities like SFU and Waterloo and currently waiting until I can submit my marks for term 2 in April. The reason I&amp;#39;m putting going to a university such a high priority is exactly because I want to escape my parents and live in a new environment.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ip4ie", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ip4ie/", "num_reports": null, "stickied": false, "created": 1456818090.0, "author_flair_text": null, "created_utc": 1456789290.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0ioo9f", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "cmonstaaahp", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0ioa5v", "score": 1, "approved_by": null, "downs": 0, "body": "you mean you didn't apply to any universities? or you applied to some and are waiting to hear back? i'm just saying once you get away from your parents, maybe even tell them to stop calling you as much, if that bothers you too when you're away, things will improve at the least, maybe even tremendously. just imagine, you'll have a job at some point and be with a pretty white girl, no more living with chinese women, am i right? lol", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you mean you didn&amp;#39;t apply to any universities? or you applied to some and are waiting to hear back? i&amp;#39;m just saying once you get away from your parents, maybe even tell them to stop calling you as much, if that bothers you too when you&amp;#39;re away, things will improve at the least, maybe even tremendously. just imagine, you&amp;#39;ll have a job at some point and be with a pretty white girl, no more living with chinese women, am i right? lol&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ioo9f", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ioo9f/", "num_reports": null, "stickied": false, "created": 1456817398.0, "author_flair_text": null, "created_utc": 1456788598.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0ioa5v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0innjn", "score": 1, "approved_by": null, "downs": 0, "body": "The thing is that it's already over the admission deadline for most universities in Canada so I'm stuck with what I have. If I don't get accepted anywhere I'm left with nothing. I totally agree on your opinion of how Western parents have a better method of raising their kids. I would never treat my kids the same way if I ever happen to make it through.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The thing is that it&amp;#39;s already over the admission deadline for most universities in Canada so I&amp;#39;m stuck with what I have. If I don&amp;#39;t get accepted anywhere I&amp;#39;m left with nothing. I totally agree on your opinion of how Western parents have a better method of raising their kids. I would never treat my kids the same way if I ever happen to make it through.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ioa5v", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ioa5v/", "num_reports": null, "stickied": false, "created": 1456816802.0, "author_flair_text": null, "created_utc": 1456788002.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0innjn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "cmonstaaahp", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 2, "approved_by": null, "downs": 0, "body": "hey man i'm a 30 year old chinese guy who grew up in america. i don't think there's anything wrong with you, more than what's wrong with anyone else, it's just your family life is horrible. your parents hate each other, maybe they hate themselves, and it spills over to you. my opinion is that you just need to get away from them, by going to college or something. my parents did a horrible job raising me too, and it might be worse because we live in western society, seems to me like western parents are much better overall. i tried to help and fix my parents, but i just gave up on it and decided to just be away from them, very little contact now, to be honest", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hey man i&amp;#39;m a 30 year old chinese guy who grew up in america. i don&amp;#39;t think there&amp;#39;s anything wrong with you, more than what&amp;#39;s wrong with anyone else, it&amp;#39;s just your family life is horrible. your parents hate each other, maybe they hate themselves, and it spills over to you. my opinion is that you just need to get away from them, by going to college or something. my parents did a horrible job raising me too, and it might be worse because we live in western society, seems to me like western parents are much better overall. i tried to help and fix my parents, but i just gave up on it and decided to just be away from them, very little contact now, to be honest&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0innjn", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0innjn/", "num_reports": null, "stickied": false, "created": 1456815859.0, "author_flair_text": null, "created_utc": 1456787059.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0ixz67", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Feeling-Worthless", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 2, "approved_by": null, "downs": 0, "body": "I'm Chinese-American (23). I know the feeling. I lied to my parents for 4 years with my poor academic performance. I am trying to turn it around this year. For me, it was coming to the realization that your life is what you make of it. No matter how much you mess up, you still have control of your future. You don't have to start off from a good college. I have seen people go from T3 schools into a T1 school or even community college into a T1 school. The key is putting in the effort. Depression is bad; it saps your energy. I do not know what will work for you. Mine was hitting my \"rock bottom.\" Now, I am slowly digging out of the hole, one small achievement at a time.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m Chinese-American (23). I know the feeling. I lied to my parents for 4 years with my poor academic performance. I am trying to turn it around this year. For me, it was coming to the realization that your life is what you make of it. No matter how much you mess up, you still have control of your future. You don&amp;#39;t have to start off from a good college. I have seen people go from T3 schools into a T1 school or even community college into a T1 school. The key is putting in the effort. Depression is bad; it saps your energy. I do not know what will work for you. Mine was hitting my &amp;quot;rock bottom.&amp;quot; Now, I am slowly digging out of the hole, one small achievement at a time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ixz67", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ixz67/", "num_reports": null, "stickied": false, "created": 1456831948.0, "author_flair_text": null, "created_utc": 1456803148.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0jsk68", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DepressedWoman", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 2, "approved_by": null, "downs": 0, "body": "You are your own person.  Whatever university you go to, you can still be successful in your life and you can build a new family and a new circle of friends for yourself.  Think of it this way - if you kill yourself, you will be abandoning your family - it's an option even if you don't kill yourself.  You don't have to be with people who mistreated you, even if they are family.\n\nAs for depression - do you think more light exposure might help?  I am in Canada as well and February / March are worst months for me.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You are your own person.  Whatever university you go to, you can still be successful in your life and you can build a new family and a new circle of friends for yourself.  Think of it this way - if you kill yourself, you will be abandoning your family - it&amp;#39;s an option even if you don&amp;#39;t kill yourself.  You don&amp;#39;t have to be with people who mistreated you, even if they are family.&lt;/p&gt;\n\n&lt;p&gt;As for depression - do you think more light exposure might help?  I am in Canada as well and February / March are worst months for me.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0jsk68", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0jsk68/", "num_reports": null, "stickied": false, "created": 1456893461.0, "author_flair_text": null, "created_utc": 1456864661.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0luqe3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0kjxnn", "score": 1, "approved_by": null, "downs": 0, "body": "Sorry for the late reply since this isn't my main account. Would love to hear your story since it might give us a better idea of what to do in our situation. If you don't feel like sharing it here you can PM me if you want :)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry for the late reply since this isn&amp;#39;t my main account. Would love to hear your story since it might give us a better idea of what to do in our situation. If you don&amp;#39;t feel like sharing it here you can PM me if you want :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0luqe3", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0luqe3/", "num_reports": null, "stickied": false, "created": 1457026818.0, "author_flair_text": null, "created_utc": 1456998018.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0kjxnn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "j5t5", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 2, "approved_by": null, "downs": 0, "body": "oddly in a similar position you are in, except im 19 and female. im also asian and from Vancouver, born and raised. everyone that commented basically said it all. but hey, you're definitely not alone on this. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;oddly in a similar position you are in, except im 19 and female. im also asian and from Vancouver, born and raised. everyone that commented basically said it all. but hey, you&amp;#39;re definitely not alone on this. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0kjxnn", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0kjxnn/", "num_reports": null, "stickied": false, "created": 1456942418.0, "author_flair_text": null, "created_utc": 1456913618.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0ipddv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0iojvf", "score": 1, "approved_by": null, "downs": 0, "body": "I wish I had the courage to go to therapy when I had the chance like you did. Right now I'm taking the courses that really counts (Biology, Calculus, and English) for my admission to university. If I screw up this time I wouldn't be able to retake them again. I'll try to see a new counselor at my school to see if there's anything that can be done. Here's to both of us getting well in time before university! :)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I wish I had the courage to go to therapy when I had the chance like you did. Right now I&amp;#39;m taking the courses that really counts (Biology, Calculus, and English) for my admission to university. If I screw up this time I wouldn&amp;#39;t be able to retake them again. I&amp;#39;ll try to see a new counselor at my school to see if there&amp;#39;s anything that can be done. Here&amp;#39;s to both of us getting well in time before university! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ipddv", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ipddv/", "num_reports": null, "stickied": false, "created": 1456818469.0, "author_flair_text": null, "created_utc": 1456789669.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0iojvf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "mhalo", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 1, "approved_by": null, "downs": 0, "body": "I relate to you in a lot of ways. I'm also on my last year of school before university and I'm struggling a lot too. My grades have recently dropped significantly. I too used to be a straight A student, and being depressed like this now is horrible. I just can't bring myself to do things. I'm in therapy now, and after being hospitalized for depression in December I'm definitely doing better, but things are still hard. As for university, I agree with the other commenter. You don't need to go to the perfect college to get a good job or have a good life. I'm glad you're still thinking of possibilities of a good future with a wife and kids. Please hold onto some amount of hope that next year will be different for you. And I would definitely, as hard as it will be to do, reach out to someone at your school for help. If you want to talk ever, message me anytime. I'd be happy to be a new friend that you can reach out to. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I relate to you in a lot of ways. I&amp;#39;m also on my last year of school before university and I&amp;#39;m struggling a lot too. My grades have recently dropped significantly. I too used to be a straight A student, and being depressed like this now is horrible. I just can&amp;#39;t bring myself to do things. I&amp;#39;m in therapy now, and after being hospitalized for depression in December I&amp;#39;m definitely doing better, but things are still hard. As for university, I agree with the other commenter. You don&amp;#39;t need to go to the perfect college to get a good job or have a good life. I&amp;#39;m glad you&amp;#39;re still thinking of possibilities of a good future with a wife and kids. Please hold onto some amount of hope that next year will be different for you. And I would definitely, as hard as it will be to do, reach out to someone at your school for help. If you want to talk ever, message me anytime. I&amp;#39;d be happy to be a new friend that you can reach out to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0iojvf", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0iojvf/", "num_reports": null, "stickied": false, "created": 1456817211.0, "author_flair_text": null, "created_utc": 1456788411.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_48cyqn", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d0ir8p5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "dreadpirateroberts07", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0iq0wu", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;but the only friends I talk to are always busy this time of the year and I don't want to go if I'm alone.\n\nHey man, you need to be able to do some stuff alone sometimes. Do it for yourself! Sometimes time you are alone doing stuff is way better than expected.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;but the only friends I talk to are always busy this time of the year and I don&amp;#39;t want to go if I&amp;#39;m alone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hey man, you need to be able to do some stuff alone sometimes. Do it for yourself! Sometimes time you are alone doing stuff is way better than expected.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0ir8p5", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0ir8p5/", "num_reports": null, "stickied": false, "created": 1456821604.0, "author_flair_text": null, "created_utc": 1456792804.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0iq0wu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "throwaway-1997", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d0iorbm", "score": 1, "approved_by": null, "downs": 0, "body": "I can see your method of dividing goals separately but right now I have no self-control and motivation to bring myself to do anything productive. I have a test tomorrow that I haven't studied for and a project that's supposed to be due today but I barely started on it. I've tried organizing my time to play sports or workout but the only friends I talk to are always busy this time of the year and I don't want to go if I'm alone. Now it just sounds like me making excuses again...", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I can see your method of dividing goals separately but right now I have no self-control and motivation to bring myself to do anything productive. I have a test tomorrow that I haven&amp;#39;t studied for and a project that&amp;#39;s supposed to be due today but I barely started on it. I&amp;#39;ve tried organizing my time to play sports or workout but the only friends I talk to are always busy this time of the year and I don&amp;#39;t want to go if I&amp;#39;m alone. Now it just sounds like me making excuses again...&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0iq0wu", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0iq0wu/", "num_reports": null, "stickied": false, "created": 1456819598.0, "author_flair_text": null, "created_utc": 1456790798.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d0iorbm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Wugo_Heaving", "can_mod_post": false, "send_replies": true, "parent_id": "t3_48cyqn", "score": 1, "approved_by": null, "downs": 0, "body": "It might help to start by breaking things down, and making \"to do\" lists. One for this week, one for the month, and maybe one for a longer term like next year. The weekly ones should be precise, the monthly ones, and the yearly goal are flexible.\nDon't overload your lists either. In the state of mind you are in, just two or three things per week would be enough, no matter how small. \"see if there is a new councellor\", \"look online for an exercise regime\" \"Limit time online to 30 mins at a time, take a 10 min walk between these times\" things like that.\n\nI was in a fairly similar position when I was your age, though I was a total dumb ass! I've come through a lot, and it takes time and persistence, but it can be done, and I think small steps are the best. Think ahead to the future, but realistically, and work on what you need to get there. Writing things down (again, maybe not even much) will be a great help. \n\nOther people, even your parents, have their own histories, and own problems to deal with. Ones that are obvious, others they might keep to themselves, that's the same the world over. Focus on yourself. Treat yourself well. Little things like drinking more water every day, exercising, even meditating (and again, even just a little) will start to take effect in a positive way. It will take time. Never be discouraged. If you make a daily \"to do\" list of three things, and only do one, that's one more than you would have done, so that's positive. If you do none, that's neutral. Carry it over to the next day, week, etc.\n\nI would say seek out a new Councillor or psychiatrist too. that support will be important regardless of deadlines for school work. It's YOU that this is happening to. You need to take time to recover from what has happened, and cope with what is happening. \n\nDo everything for your future self. Do everything you can for that person sooner rather than later, no matter how small the steps.\n\n\"The best time to plant a tree was a couple of years ago. The next best time is now\" sums it up I guess. Don't look at what others are doing, better, or worse. Give yourself permission to take the steps you need to do to achieve what you need to do, even just little daily and weekly things in order to get the longer term goals back on track.\n\nHope that makes sense and all the best.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It might help to start by breaking things down, and making &amp;quot;to do&amp;quot; lists. One for this week, one for the month, and maybe one for a longer term like next year. The weekly ones should be precise, the monthly ones, and the yearly goal are flexible.\nDon&amp;#39;t overload your lists either. In the state of mind you are in, just two or three things per week would be enough, no matter how small. &amp;quot;see if there is a new councellor&amp;quot;, &amp;quot;look online for an exercise regime&amp;quot; &amp;quot;Limit time online to 30 mins at a time, take a 10 min walk between these times&amp;quot; things like that.&lt;/p&gt;\n\n&lt;p&gt;I was in a fairly similar position when I was your age, though I was a total dumb ass! I&amp;#39;ve come through a lot, and it takes time and persistence, but it can be done, and I think small steps are the best. Think ahead to the future, but realistically, and work on what you need to get there. Writing things down (again, maybe not even much) will be a great help. &lt;/p&gt;\n\n&lt;p&gt;Other people, even your parents, have their own histories, and own problems to deal with. Ones that are obvious, others they might keep to themselves, that&amp;#39;s the same the world over. Focus on yourself. Treat yourself well. Little things like drinking more water every day, exercising, even meditating (and again, even just a little) will start to take effect in a positive way. It will take time. Never be discouraged. If you make a daily &amp;quot;to do&amp;quot; list of three things, and only do one, that&amp;#39;s one more than you would have done, so that&amp;#39;s positive. If you do none, that&amp;#39;s neutral. Carry it over to the next day, week, etc.&lt;/p&gt;\n\n&lt;p&gt;I would say seek out a new Councillor or psychiatrist too. that support will be important regardless of deadlines for school work. It&amp;#39;s YOU that this is happening to. You need to take time to recover from what has happened, and cope with what is happening. &lt;/p&gt;\n\n&lt;p&gt;Do everything for your future self. Do everything you can for that person sooner rather than later, no matter how small the steps.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The best time to plant a tree was a couple of years ago. The next best time is now&amp;quot; sums it up I guess. Don&amp;#39;t look at what others are doing, better, or worse. Give yourself permission to take the steps you need to do to achieve what you need to do, even just little daily and weekly things in order to get the longer term goals back on track.&lt;/p&gt;\n\n&lt;p&gt;Hope that makes sense and all the best.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d0iorbm", "score_hidden": false, "permalink": "/r/depression/comments/48cyqn/18_and_thinking_of_killing_myself/d0iorbm/", "num_reports": null, "stickied": false, "created": 1456817529.0, "author_flair_text": null, "created_utc": 1456788729.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]