[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was going to post from my alternate account, but fuck it. A little background, I had suicidal depression a few years ago. I was so close to killing myself. I thought it would be a noble act. I was a burden. I was a mistake. I was a failure. I am nothing but a a negative influence on other people. But I got better, until the last three weeks. I started dating a girl in November. In the beginning, it was great, as it typically is. But recently I&amp;#39;ve noticed an ugly truth. She doesn&amp;#39;t care about this relationship. She doesn&amp;#39;t really care about me, or at least not enough. She doesn&amp;#39;t laugh any more. She doesn&amp;#39;t want to talk. I&amp;#39;ve talked with her a total of 13 minutes the past week and a half. Last night my depression was really bad. It was probably mentally the worst day of my life. Last time, I never confided in anyone. I let myself stew for three years until it just kind of faded away. I&amp;#39;ve been trying to avoid that this time. I confided in a few friends in a groupchat which had her in it, and she did say a couple things. She gave the equivalent of a pat on the head. Then after that, nothing. The person she said she loved went through the worst experience a human being can have. It didn&amp;#39;t cross her mind once to even call. She didn&amp;#39;t even call. She said she saw that I needed to &amp;quot;vent.&amp;quot; Today, she went on about her usual, trivial things. I&amp;#39;m giving up a bit. I feel like shes actively doing everything in her power to prove that she doesn&amp;#39;t love me. I don&amp;#39;t know if she even cares anymore. I feel like I was coping so much better alone. I just want the pain to stop, and I don&amp;#39;t know what to do anymore. Thanks for listening to me vent, I&amp;#39;m sure the writing is super scrambled and I apologize.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was going to post from my alternate account, but fuck it. A little background, I had suicidal depression a few years ago. I was so close to killing myself. I thought it would be a noble act. I was a burden. I was a mistake. I was a failure. I am nothing but a a negative influence on other people. But I got better, until the last three weeks. I started dating a girl in November. In the beginning, it was great, as it typically is. But recently I've noticed an ugly truth. She doesn't care about this relationship. She doesn't really care about me, or at least not enough. She doesn't laugh any more. She doesn't want to talk. I've talked with her a total of 13 minutes the past week and a half. Last night my depression was really bad. It was probably mentally the worst day of my life. Last time, I never confided in anyone. I let myself stew for three years until it just kind of faded away. I've been trying to avoid that this time. I confided in a few friends in a groupchat which had her in it, and she did say a couple things. She gave the equivalent of a pat on the head. Then after that, nothing. The person she said she loved went through the worst experience a human being can have. It didn't cross her mind once to even call. She didn't even call. She said she saw that I needed to \"vent.\" Today, she went on about her usual, trivial things. I'm giving up a bit. I feel like shes actively doing everything in her power to prove that she doesn't love me. I don't know if she even cares anymore. I feel like I was coping so much better alone. I just want the pain to stop, and I don't know what to do anymore. Thanks for listening to me vent, I'm sure the writing is super scrambled and I apologize.", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "5rblz8", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "wingnut5k", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 7, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 5, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338993, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_5rblz8", "spoiler": false, "permalink": "/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1485931586.0, "url": "https://www.reddit.com/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/", "author_flair_text": null, "quarantine": false, "title": "My relationship is a joke, my depression is back, and I don't know what to do.", "created_utc": 1485902786.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 7}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5rblz8", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dd5yacc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "space_turnarounde", "can_mod_post": false, "send_replies": true, "parent_id": "t3_5rblz8", "score": 2, "approved_by": null, "downs": 0, "body": "i found love being a lie or \"excuse\" to feelings like emptiness. what worked out for me was trying to understand what my emptiness was and filling it with the right thing, just like a puzzle you may say. \n\nworking out (gym) = physical pain = no more stress/less stress\n\nstudying = more stress + satisfaction, but you have to melt the stress away, so working out and studying is the perfect combination.\n\ngot spare time? hmm i draw/music and play with friends at the pc or alone. if you're sad just put some hip hop with the speakers you bought time ago :)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;i found love being a lie or &amp;quot;excuse&amp;quot; to feelings like emptiness. what worked out for me was trying to understand what my emptiness was and filling it with the right thing, just like a puzzle you may say. &lt;/p&gt;\n\n&lt;p&gt;working out (gym) = physical pain = no more stress/less stress&lt;/p&gt;\n\n&lt;p&gt;studying = more stress + satisfaction, but you have to melt the stress away, so working out and studying is the perfect combination.&lt;/p&gt;\n\n&lt;p&gt;got spare time? hmm i draw/music and play with friends at the pc or alone. if you&amp;#39;re sad just put some hip hop with the speakers you bought time ago :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_dd5yacc", "score_hidden": false, "permalink": "/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/dd5yacc/", "num_reports": null, "stickied": false, "created": 1485932067.0, "author_flair_text": null, "created_utc": 1485903267.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5rblz8", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5rblz8", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dd6a7c2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MrTumbleweed", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dd5yz0c", "score": 1, "approved_by": null, "downs": 0, "body": "Please read this op. There is no better advice.. I will also be heeding this advice. Thank you, btw ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Please read this op. There is no better advice.. I will also be heeding this advice. Thank you, btw &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_dd6a7c2", "score_hidden": false, "permalink": "/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/dd6a7c2/", "num_reports": null, "stickied": false, "created": 1485946755.0, "author_flair_text": null, "created_utc": 1485917955.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5rblz8", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_5rblz8", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dd6ki1b", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Afegddu", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dd6hmll", "score": 1, "approved_by": null, "downs": 0, "body": "Even if not therapy, there may be opportunities to talk to someone - I once did a one-off session with a counselor just to talk about some relationship issues that were making depression harder to handle than usual. It was helpful. It didn't fix anything, but it was useful to have an outside opinion from someone better equipped to be objective and question whether some of my perceptions were being distorted. It was also reassuring to hear that she had the impression I had a realistic grasp of just how bad things were inside my head - I often worry that the distortion effect and habituation might be leading me to think I'm better than I really am. I'm pretty bad right now (most days - I'm actually doing OK today for some reason) and I was pretty awful when I went to see that counselor, but you get numb after a while - it seems to me it would be really easy to think I was dealing with things OK when in reality I was just in a slower death spiral than I thought.\n\n&amp;nbsp;\n\nAnyway, good luck. I hope it turns out she was having difficulty figure out how to talk to you, and I hope she can give you the support you need as you figure your way through this episode. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Even if not therapy, there may be opportunities to talk to someone - I once did a one-off session with a counselor just to talk about some relationship issues that were making depression harder to handle than usual. It was helpful. It didn&amp;#39;t fix anything, but it was useful to have an outside opinion from someone better equipped to be objective and question whether some of my perceptions were being distorted. It was also reassuring to hear that she had the impression I had a realistic grasp of just how bad things were inside my head - I often worry that the distortion effect and habituation might be leading me to think I&amp;#39;m better than I really am. I&amp;#39;m pretty bad right now (most days - I&amp;#39;m actually doing OK today for some reason) and I was pretty awful when I went to see that counselor, but you get numb after a while - it seems to me it would be really easy to think I was dealing with things OK when in reality I was just in a slower death spiral than I thought.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Anyway, good luck. I hope it turns out she was having difficulty figure out how to talk to you, and I hope she can give you the support you need as you figure your way through this episode. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_dd6ki1b", "score_hidden": false, "permalink": "/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/dd6ki1b/", "num_reports": null, "stickied": false, "created": 1485964258.0, "author_flair_text": null, "created_utc": 1485935458.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dd6hmll", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wingnut5k", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dd5yz0c", "score": 1, "approved_by": null, "downs": 0, "body": "You're right, thanks. I've calmed down a bit. No, I have not received therapy or  medication. I don't know if I'm comfortable with that just yet. I am almost completely opposed to medication, and if it gets to what it was before than I will definitely seek therapy.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re right, thanks. I&amp;#39;ve calmed down a bit. No, I have not received therapy or  medication. I don&amp;#39;t know if I&amp;#39;m comfortable with that just yet. I am almost completely opposed to medication, and if it gets to what it was before than I will definitely seek therapy.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_dd6hmll", "score_hidden": false, "permalink": "/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/dd6hmll/", "num_reports": null, "stickied": false, "created": 1485957817.0, "author_flair_text": null, "created_utc": 1485929017.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dd5yz0c", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Afegddu", "can_mod_post": false, "send_replies": true, "parent_id": "t3_5rblz8", "score": 2, "approved_by": null, "downs": 0, "body": "That's rough. I feel for you. It's terrible when someone you were counting on to care for you does something that makes you believe it was a lie. I'm going to play devil's advocate for you for a moment though:\n\n&amp;nbsp;\n\nDepression in someone you care about - especially if it got bad enough for suicide to be on the table - can be overwhelming to some people. It seems impossible to know what to say. You don't know what the right thing is, you definitely don't want to do the wrong thing. It can be paralysing, and that can make it seem like you aren't affected at all. Are you *sure* depression isn't tricking you into giving her reaction the most negative possible spin?\n\n&amp;nbsp;\n\nYou know better of course. You know far better than I can just how the disease distorts your view of things - and it's different for all of us. On top of that, it sounds like this has been building for a while, not something that happened suddenly after you came out about it, right?\n\n&amp;nbsp;\n\nIt sucks to learn that a relationship wasn't what you thought it was. But it also sucks to let a potential source of support go when it wasn't necessary.\n\n&amp;nbsp;\n\nMaybe you could help her, and yourself, by bringing it up yourself instead of waiting for her? She could be paralysed like I said, and afraid to mention it. She may think the reason you brought it up in groupchat rather than one on one with her first is because you feel too sensitive about it to handle the intensity of one on one (that's one thing that has kept me from talking to my wife - I'm not sure I could handle it, let alone her).\n\n&amp;nbsp;\n\nSo, is having a talk with her about it an option? It may help her understand better what you need from her and give her a chance to help you see whether your impressions have been clouded by depression. It may also confirm your worry that things are not as good as you thought of course, but maybe that's for the good too - it would let you gently extract yourself from a relationship that might otherwise be hard for you to deal with as the disease takes its course.\n\n&amp;nbsp;\n\nFinally, are you in treatment or trying to go it alone? It may help to consider talking to someone professional if you're not already. You can be more personal and explicit with them than online, and they may have more constructive advice. And of course there's the option of medication. Could you ask your girlfriend to take you to an appointment? Could go a long way toward both helping her understand what you're going through and letting her see that there are things you can do to get better. She doesn't need to be in the office with you, but just taking you to the clinic might be good.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s rough. I feel for you. It&amp;#39;s terrible when someone you were counting on to care for you does something that makes you believe it was a lie. I&amp;#39;m going to play devil&amp;#39;s advocate for you for a moment though:&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Depression in someone you care about - especially if it got bad enough for suicide to be on the table - can be overwhelming to some people. It seems impossible to know what to say. You don&amp;#39;t know what the right thing is, you definitely don&amp;#39;t want to do the wrong thing. It can be paralysing, and that can make it seem like you aren&amp;#39;t affected at all. Are you &lt;em&gt;sure&lt;/em&gt; depression isn&amp;#39;t tricking you into giving her reaction the most negative possible spin?&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;You know better of course. You know far better than I can just how the disease distorts your view of things - and it&amp;#39;s different for all of us. On top of that, it sounds like this has been building for a while, not something that happened suddenly after you came out about it, right?&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;It sucks to learn that a relationship wasn&amp;#39;t what you thought it was. But it also sucks to let a potential source of support go when it wasn&amp;#39;t necessary.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Maybe you could help her, and yourself, by bringing it up yourself instead of waiting for her? She could be paralysed like I said, and afraid to mention it. She may think the reason you brought it up in groupchat rather than one on one with her first is because you feel too sensitive about it to handle the intensity of one on one (that&amp;#39;s one thing that has kept me from talking to my wife - I&amp;#39;m not sure I could handle it, let alone her).&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;So, is having a talk with her about it an option? It may help her understand better what you need from her and give her a chance to help you see whether your impressions have been clouded by depression. It may also confirm your worry that things are not as good as you thought of course, but maybe that&amp;#39;s for the good too - it would let you gently extract yourself from a relationship that might otherwise be hard for you to deal with as the disease takes its course.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Finally, are you in treatment or trying to go it alone? It may help to consider talking to someone professional if you&amp;#39;re not already. You can be more personal and explicit with them than online, and they may have more constructive advice. And of course there&amp;#39;s the option of medication. Could you ask your girlfriend to take you to an appointment? Could go a long way toward both helping her understand what you&amp;#39;re going through and letting her see that there are things you can do to get better. She doesn&amp;#39;t need to be in the office with you, but just taking you to the clinic might be good.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_dd5yz0c", "score_hidden": false, "permalink": "/r/depression/comments/5rblz8/my_relationship_is_a_joke_my_depression_is_back/dd5yz0c/", "num_reports": null, "stickied": false, "created": 1485932896.0, "author_flair_text": null, "created_utc": 1485904096.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]