[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m so upset right now, I want to just cry for hours but have pretty much lost the ability to cry about anything. I wish I just popped out of existence right now, I know that there are people out there who care, but I just can&amp;#39;t cope with feeling depressed every day and people just telling me to &amp;#39;man up&amp;#39; and &amp;#39;get over it&amp;#39;. I tried to cut back on the self harming which just ended up with me feeling more terrible overall. I&amp;#39;m an 18 year old loser who had never even kissed a girl or had a girlfriend, I spend all my time playing computer games 6-12 hours daily as it&amp;#39;s the only thing that helps me to forget about life.. I&amp;#39;m failing college for the 2nd time round (UK) and I have no idea what I will do when I get kicked out for not getting the right grades. I wont cope working a dead end job for my whole life. The thing that has always held me back from suiciding is how it will affect those around me, for I care more about them than myself. I had to tell one of my best friends (Online) That I was never speaking to him again after he said to me &amp;#39;I hope your family dies of cancer&amp;#39; because we had an argument. I just can&amp;#39;t deal with life, Just because I don&amp;#39;t cry, Everyone thinks I&amp;#39;m just an attention seeking teenager making a big deal of his problems and over-reacting. Thanks for spending your time reading whatever shit I could muster up ..&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm so upset right now, I want to just cry for hours but have pretty much lost the ability to cry about anything. I wish I just popped out of existence right now, I know that there are people out there who care, but I just can't cope with feeling depressed every day and people just telling me to 'man up' and 'get over it'. I tried to cut back on the self harming which just ended up with me feeling more terrible overall. I'm an 18 year old loser who had never even kissed a girl or had a girlfriend, I spend all my time playing computer games 6-12 hours daily as it's the only thing that helps me to forget about life.. I'm failing college for the 2nd time round (UK) and I have no idea what I will do when I get kicked out for not getting the right grades. I wont cope working a dead end job for my whole life. The thing that has always held me back from suiciding is how it will affect those around me, for I care more about them than myself. I had to tell one of my best friends (Online) That I was never speaking to him again after he said to me 'I hope your family dies of cancer' because we had an argument. I just can't deal with life, Just because I don't cry, Everyone thinks I'm just an attention seeking teenager making a big deal of his problems and over-reacting. Thanks for spending your time reading whatever shit I could muster up ..", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "380smz", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "HoppingTheRocks", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 6, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 10, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83420, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_380smz", "spoiler": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1433147834.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/", "author_flair_text": null, "quarantine": false, "title": "I just want the hurting to stop.", "created_utc": 1433119034.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 0.81, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 6}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "crre4s4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ballast_nt", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrdt60", "score": 2, "approved_by": null, "downs": 0, "body": "You've got to try!!! You've got to try!!!\n\nYes to archery! \n\nTry to find an instrument that works for you! Just try!\n\nI have wanted to play drums, but my main instrument is guitar, I love guitar! I love being able to take guitar with me everywhere and I love to play all the complex melodies and stuff like that.\n\nIt is SO worth it, even if you don't end up choosing that instrument at least you TRIED, there are some really good youtube videos of people putting together music (not just professional musicians) and seeing some of these musicians has been incredibly important for me.\n\nI think music is a lot like cooking in some way, like being able to play your own music is extremely important, because sometimes there are things that only you can play/feel.\n\nMusic helps process your emotional connections to your life and world, even if you're not playing pieces or something written by people, just kinda spontaneously creating things, just being able to evoke that emotion can be of utter importance.\n\nAnd yes man! Try archery!! Get really involved in it! Find something like a sport that hooks your interest, you've just got to get your self involved in something, anything that may be of interest to you that's not just virtual! Because it helps, so much, to have something like that you can apply yourself towards every day. To have your own goals and build on them and to share your accomplishments with people. That's incredibly worthwhile, and you still have a lot of time to close that gap between your virtual reality life and your real life, you're lucky you're getting out of this place so early! Honestly! You really have the opportunity to change your life very quickly and something like that you've wanted to do could be incredibly important for you!\n\nBut I wouldn't limit it to just archery because it may be hard to find people who also do it, try any kind of sport that involves hand eye coordination, but just try! It'll be worth it, even if you're entirely alone on it (archery) and you'll find others over time as you grow up!!!\n\nIt might help to read about the subject, like research archery and things like that, anything that you really want to do. You may also like fencing or like martial arts etc, as I kinda think of them as being in a similar field of interest and can extremely important in building a sense of self that is capable of both working together, becoming an individual, and defending oneself in the world.!\n\nI think it was incredibly important for me to have access to a punching bag when I was going through growing up because I needed to get very good at having power in some part of my life where I had absolutely none, and that is an important thing for people who may feel like they don't have any control or means of being able to overcome problems. Being able to 1-2 punch a bag was a very significant thing for me, as well as beginning to learn how to kick (it's been a while since I've done martial arts, I had to focus on a career, but maybe I should get back into it. :) )\n\nMartial arts also got me involved in training up my body, running, pullups, all of that kind of thing, and really being able to see results.\n\nI also tried rock climbing which was rewarding, but it is less individual I think, I think it takes having fellow climbers to make it a worthwhile sport, but it really was important for me to have that as well.", "edited": 1433122287.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;ve got to try!!! You&amp;#39;ve got to try!!!&lt;/p&gt;\n\n&lt;p&gt;Yes to archery! &lt;/p&gt;\n\n&lt;p&gt;Try to find an instrument that works for you! Just try!&lt;/p&gt;\n\n&lt;p&gt;I have wanted to play drums, but my main instrument is guitar, I love guitar! I love being able to take guitar with me everywhere and I love to play all the complex melodies and stuff like that.&lt;/p&gt;\n\n&lt;p&gt;It is SO worth it, even if you don&amp;#39;t end up choosing that instrument at least you TRIED, there are some really good youtube videos of people putting together music (not just professional musicians) and seeing some of these musicians has been incredibly important for me.&lt;/p&gt;\n\n&lt;p&gt;I think music is a lot like cooking in some way, like being able to play your own music is extremely important, because sometimes there are things that only you can play/feel.&lt;/p&gt;\n\n&lt;p&gt;Music helps process your emotional connections to your life and world, even if you&amp;#39;re not playing pieces or something written by people, just kinda spontaneously creating things, just being able to evoke that emotion can be of utter importance.&lt;/p&gt;\n\n&lt;p&gt;And yes man! Try archery!! Get really involved in it! Find something like a sport that hooks your interest, you&amp;#39;ve just got to get your self involved in something, anything that may be of interest to you that&amp;#39;s not just virtual! Because it helps, so much, to have something like that you can apply yourself towards every day. To have your own goals and build on them and to share your accomplishments with people. That&amp;#39;s incredibly worthwhile, and you still have a lot of time to close that gap between your virtual reality life and your real life, you&amp;#39;re lucky you&amp;#39;re getting out of this place so early! Honestly! You really have the opportunity to change your life very quickly and something like that you&amp;#39;ve wanted to do could be incredibly important for you!&lt;/p&gt;\n\n&lt;p&gt;But I wouldn&amp;#39;t limit it to just archery because it may be hard to find people who also do it, try any kind of sport that involves hand eye coordination, but just try! It&amp;#39;ll be worth it, even if you&amp;#39;re entirely alone on it (archery) and you&amp;#39;ll find others over time as you grow up!!!&lt;/p&gt;\n\n&lt;p&gt;It might help to read about the subject, like research archery and things like that, anything that you really want to do. You may also like fencing or like martial arts etc, as I kinda think of them as being in a similar field of interest and can extremely important in building a sense of self that is capable of both working together, becoming an individual, and defending oneself in the world.!&lt;/p&gt;\n\n&lt;p&gt;I think it was incredibly important for me to have access to a punching bag when I was going through growing up because I needed to get very good at having power in some part of my life where I had absolutely none, and that is an important thing for people who may feel like they don&amp;#39;t have any control or means of being able to overcome problems. Being able to 1-2 punch a bag was a very significant thing for me, as well as beginning to learn how to kick (it&amp;#39;s been a while since I&amp;#39;ve done martial arts, I had to focus on a career, but maybe I should get back into it. :) )&lt;/p&gt;\n\n&lt;p&gt;Martial arts also got me involved in training up my body, running, pullups, all of that kind of thing, and really being able to see results.&lt;/p&gt;\n\n&lt;p&gt;I also tried rock climbing which was rewarding, but it is less individual I think, I think it takes having fellow climbers to make it a worthwhile sport, but it really was important for me to have that as well.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crre4s4", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crre4s4/", "num_reports": null, "stickied": false, "created": 1433150801.0, "author_flair_text": null, "created_utc": 1433122001.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrdt60", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HoppingTheRocks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrdgag", "score": 2, "approved_by": null, "downs": 0, "body": "I really appreciate your comment but unfortunately most other things I suck at, I have never been a sporty person and I seem to lack talent in most things. I started listening to music properly around a year ago but I'm not sure I would be good for playing an instrument. One thing I was finally hoping to try was archery thus summer, maybe that could give me another kind of release, thanks again", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I really appreciate your comment but unfortunately most other things I suck at, I have never been a sporty person and I seem to lack talent in most things. I started listening to music properly around a year ago but I&amp;#39;m not sure I would be good for playing an instrument. One thing I was finally hoping to try was archery thus summer, maybe that could give me another kind of release, thanks again&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrdt60", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrdt60/", "num_reports": null, "stickied": false, "created": 1433150217.0, "author_flair_text": null, "created_utc": 1433121417.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrdgag", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ballast_nt", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrd44z", "score": 2, "approved_by": null, "downs": 0, "body": "Try music man! And try martial arts, and try sports, like going to a batting cage, that kind of thing. Maybe join a soccer team!\n\n Basically you have to go be independent and seek an experience in the world that isn't so grounded in virtual reality!\n\nYou can absolutely do this. Try getting a part-time job if you can, it'll mean a whole hell of a lot.\n\nYou've got to save yourself from virtual reality man! I know how incredibly difficult that can be!\n\nTry visual art, try anything, dressing up, etc. It might not be the worst thing in the world to cosplay, but you want to get as far out of those worlds as you can..\n\nI really do recommend something like going to a metal show or something like that, it was music that really served as the most important piece.\n\nI also read a bunch of psychology and philiosophy, which was incredibly important for me. I think that taking martial arts was incredibly significant for me as well, you kinda need everything to grow up, you need all of these different physical skills.\n\nSeriously man, you can do this, you need to get out of these worlds and you'll absolutely see results from doing so, you'll feel like a whole new person and you'll be so thankful that you've managed to create a better life for yourself.\n\nI believed I would never ever get better and be able to piece myself together, but I have, and I feel like I have a future now, more than I ever did, and for me it's about all of these passions all of these experiences, you need everything. Except maybe videogames, haha.\n\nThere's a lot to actual life, even though things like depression can be really brutal regardless. You've got to find a way to communicate the thoughts and the darker emotions, and give them healing in a way, and that's why music can be so important. \n\nFind a way to connect to real life and find the things that interest you enough to get into them, for me I have to have all of the above, I needed music and I need an experience of nature and reading about nature and people who also felt as crazy as I had.\n\nIt's not easy to grow up or get out into the world, not at all, being able to deal with the anxieties may be the biggest problem, it can help to just have heavy music to help with that stuff, and form yourself, maybe through drawing or sports or something, \n\nyou can do it and you should try! It sounds like you have enough support to at least give it a shot, keep talking things through with other people, and yeah.! You can do this man. You always have the reddit community!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Try music man! And try martial arts, and try sports, like going to a batting cage, that kind of thing. Maybe join a soccer team!&lt;/p&gt;\n\n&lt;p&gt;Basically you have to go be independent and seek an experience in the world that isn&amp;#39;t so grounded in virtual reality!&lt;/p&gt;\n\n&lt;p&gt;You can absolutely do this. Try getting a part-time job if you can, it&amp;#39;ll mean a whole hell of a lot.&lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;ve got to save yourself from virtual reality man! I know how incredibly difficult that can be!&lt;/p&gt;\n\n&lt;p&gt;Try visual art, try anything, dressing up, etc. It might not be the worst thing in the world to cosplay, but you want to get as far out of those worlds as you can..&lt;/p&gt;\n\n&lt;p&gt;I really do recommend something like going to a metal show or something like that, it was music that really served as the most important piece.&lt;/p&gt;\n\n&lt;p&gt;I also read a bunch of psychology and philiosophy, which was incredibly important for me. I think that taking martial arts was incredibly significant for me as well, you kinda need everything to grow up, you need all of these different physical skills.&lt;/p&gt;\n\n&lt;p&gt;Seriously man, you can do this, you need to get out of these worlds and you&amp;#39;ll absolutely see results from doing so, you&amp;#39;ll feel like a whole new person and you&amp;#39;ll be so thankful that you&amp;#39;ve managed to create a better life for yourself.&lt;/p&gt;\n\n&lt;p&gt;I believed I would never ever get better and be able to piece myself together, but I have, and I feel like I have a future now, more than I ever did, and for me it&amp;#39;s about all of these passions all of these experiences, you need everything. Except maybe videogames, haha.&lt;/p&gt;\n\n&lt;p&gt;There&amp;#39;s a lot to actual life, even though things like depression can be really brutal regardless. You&amp;#39;ve got to find a way to communicate the thoughts and the darker emotions, and give them healing in a way, and that&amp;#39;s why music can be so important. &lt;/p&gt;\n\n&lt;p&gt;Find a way to connect to real life and find the things that interest you enough to get into them, for me I have to have all of the above, I needed music and I need an experience of nature and reading about nature and people who also felt as crazy as I had.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s not easy to grow up or get out into the world, not at all, being able to deal with the anxieties may be the biggest problem, it can help to just have heavy music to help with that stuff, and form yourself, maybe through drawing or sports or something, &lt;/p&gt;\n\n&lt;p&gt;you can do it and you should try! It sounds like you have enough support to at least give it a shot, keep talking things through with other people, and yeah.! You can do this man. You always have the reddit community!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrdgag", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrdgag/", "num_reports": null, "stickied": false, "created": 1433149509.0, "author_flair_text": null, "created_utc": 1433120709.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrd44z", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HoppingTheRocks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrctff", "score": 2, "approved_by": null, "downs": 0, "body": "I'm glad it all worked out for you bud. My parents try to involve me alot though and I tend to shut myself away from the world. Although I enjoy playing games frequently, It causes me to get angry and break things. I recently broke my £65 headset somewhat by accident after losing my temper. I'm broke right now so can't even afford a new one. I personally find the only passion I have is playing games, I wish there were other things I enjoyed which I could dedicate my time to. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m glad it all worked out for you bud. My parents try to involve me alot though and I tend to shut myself away from the world. Although I enjoy playing games frequently, It causes me to get angry and break things. I recently broke my £65 headset somewhat by accident after losing my temper. I&amp;#39;m broke right now so can&amp;#39;t even afford a new one. I personally find the only passion I have is playing games, I wish there were other things I enjoyed which I could dedicate my time to. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrd44z", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrd44z/", "num_reports": null, "stickied": false, "created": 1433148875.0, "author_flair_text": null, "created_utc": 1433120075.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrctff", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ballast_nt", "can_mod_post": false, "send_replies": true, "parent_id": "t3_380smz", "score": 2, "approved_by": null, "downs": 0, "body": "Hey, I had a very similar experience growing up, my parents weren't involved much at all, and I was hopelessly addicted to videogames, I couldn't find any ground in the world at all, and it really effected me on a deep level, I had no skills, I couldn't work, I had nothing.\n\nThe one thing which probably saved my life was music and playing music, because there was something about it that really made a huge difference in the people I met and the ability to dedicate myself to something that actually paid off.\n\nNow I'm moving towards sports like baseball, even though I'm out of school now, and I feel exponentially more optimistic about the future - yes, I have cut videogames entirely out of my life, although I don't necessarily see them as absolutely horrible - I think the problem is more that kids who don't have involved parents are getting trapped in them because their parents haven't got the ability to pull them out of the electronic worlds and put them back into reality.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hey, I had a very similar experience growing up, my parents weren&amp;#39;t involved much at all, and I was hopelessly addicted to videogames, I couldn&amp;#39;t find any ground in the world at all, and it really effected me on a deep level, I had no skills, I couldn&amp;#39;t work, I had nothing.&lt;/p&gt;\n\n&lt;p&gt;The one thing which probably saved my life was music and playing music, because there was something about it that really made a huge difference in the people I met and the ability to dedicate myself to something that actually paid off.&lt;/p&gt;\n\n&lt;p&gt;Now I&amp;#39;m moving towards sports like baseball, even though I&amp;#39;m out of school now, and I feel exponentially more optimistic about the future - yes, I have cut videogames entirely out of my life, although I don&amp;#39;t necessarily see them as absolutely horrible - I think the problem is more that kids who don&amp;#39;t have involved parents are getting trapped in them because their parents haven&amp;#39;t got the ability to pull them out of the electronic worlds and put them back into reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrctff", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrctff/", "num_reports": null, "stickied": false, "created": 1433148309.0, "author_flair_text": null, "created_utc": 1433119509.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "crrd0xh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HoppingTheRocks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrcrq8", "score": 1, "approved_by": null, "downs": 0, "body": "I've always struggled with thinking what I want to do or what I want to become, My dream would probably just to be a comedian of some form, But my anxieties hold me back from even cracking a joke around friends.. I've held back from saying things all my life because I'm too nervous to speak it even around those I'm most comfortable with :/. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve always struggled with thinking what I want to do or what I want to become, My dream would probably just to be a comedian of some form, But my anxieties hold me back from even cracking a joke around friends.. I&amp;#39;ve held back from saying things all my life because I&amp;#39;m too nervous to speak it even around those I&amp;#39;m most comfortable with :/. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrd0xh", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrd0xh/", "num_reports": null, "stickied": false, "created": 1433148710.0, "author_flair_text": null, "created_utc": 1433119910.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrcrq8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "bold_move_cotn", "can_mod_post": false, "send_replies": true, "parent_id": "t3_380smz", "score": 0, "approved_by": null, "downs": 0, "body": "hey stranger, do you have any dreams or aspirations?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;hey stranger, do you have any dreams or aspirations?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrcrq8", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrcrq8/", "num_reports": null, "stickied": false, "created": 1433148217.0, "author_flair_text": null, "created_utc": 1433119417.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_380smz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "crrdq5o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ButReallyBitch", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrd6h4", "score": 0, "approved_by": null, "downs": 0, "body": "Well, you aren't happy with your life. Instead of ending it, just start over.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well, you aren&amp;#39;t happy with your life. Instead of ending it, just start over.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrdq5o", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrdq5o/", "num_reports": null, "stickied": false, "created": 1433150051.0, "author_flair_text": null, "created_utc": 1433121251.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrd6h4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "HoppingTheRocks", "can_mod_post": false, "send_replies": true, "parent_id": "t1_crrd0r3", "score": 1, "approved_by": null, "downs": 0, "body": "What do you mean?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What do you mean?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrd6h4", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrd6h4/", "num_reports": null, "stickied": false, "created": 1433148999.0, "author_flair_text": null, "created_utc": 1433120199.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "crrd0r3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ButReallyBitch", "can_mod_post": false, "send_replies": true, "parent_id": "t3_380smz", "score": 0, "approved_by": null, "downs": 0, "body": "Save up some money and leave.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Save up some money and leave.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_crrd0r3", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/380smz/i_just_want_the_hurting_to_stop/crrd0r3/", "num_reports": null, "stickied": false, "created": 1433148701.0, "author_flair_text": null, "created_utc": 1433119901.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]