[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;So my parents (and to a lesser extent my maternal grandmother) abused me.  My father physically, psychologically, and emotionally abused me.  My mother psychologically and emotionally abused me.  I won&amp;#39;t get into details to prevent triggering anyone.  &lt;/p&gt;\n\n&lt;p&gt;My mother contacted me on Facebook the other day with a phone number to call (she sent me a friend request, and I knew that she probably sent a message which would go to Facebook&amp;#39;s second inbox for people who aren&amp;#39;t your friends, and sure enough, there it was).&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve spoken to them over the phone once now, and via online communication a few times.  They thought I wanted nothing to do with them, and I thought they wanted nothing to do with me.  Turns out, another party (a sibling) was intervening in the middle to prevent us from communicating.  &lt;/p&gt;\n\n&lt;p&gt;My therapist was out sick all last week, and he&amp;#39;s out sick this week too (don&amp;#39;t know for how long).  So I didn&amp;#39;t have a chance to run it by him before calling.  I chose to call, knowing that talking to my mother is like engaging in a complex game of Chess.  Much to my surprise, it was a pleasant conversation.  They were informing me that they were moving to Virginia, and they wondered why they hadn&amp;#39;t heard from me.  We put the pieces together about my Sibling&amp;#39;s interference.&lt;/p&gt;\n\n&lt;p&gt;I honestly feel like this is a good thing.  I no longer hold any animosity towards them.  They did the best they could with what they had (financially, they had plenty at the time.  Emotionally, not so much).  They&amp;#39;re sick in their way just like I am in mine.  That doesn&amp;#39;t mean I forget:  the flashbacks and nightmares make sure of that.  But some connection to them feels good.  I can&amp;#39;t explain it.  I&amp;#39;ve been disconnected from family for over a decade.  I created a new family with my friends.  But to have &lt;em&gt;my&lt;/em&gt; family back, even if it&amp;#39;s never face to face feels like I&amp;#39;ve made progress.  Talking to them didn&amp;#39;t trigger me.  &lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;m rambling, but the reason for the post:  has anyone had a similar experience, and if so, do you have any advice for me?  I&amp;#39;m proceeding carefully.  Baby steps.  &lt;/p&gt;\n\n&lt;p&gt;Also worried about my therapist.  He&amp;#39;s been out over a week now.  Not sure what he has, but it has to be pretty serious to last over a week and be so bad that he didn&amp;#39;t come to work.  &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "So my parents (and to a lesser extent my maternal grandmother) abused me.  My father physically, psychologically, and emotionally abused me.  My mother psychologically and emotionally abused me.  I won't get into details to prevent triggering anyone.  \n\nMy mother contacted me on Facebook the other day with a phone number to call (she sent me a friend request, and I knew that she probably sent a message which would go to Facebook's second inbox for people who aren't your friends, and sure enough, there it was).\n\nI've spoken to them over the phone once now, and via online communication a few times.  They thought I wanted nothing to do with them, and I thought they wanted nothing to do with me.  Turns out, another party (a sibling) was intervening in the middle to prevent us from communicating.  \n\nMy therapist was out sick all last week, and he's out sick this week too (don't know for how long).  So I didn't have a chance to run it by him before calling.  I chose to call, knowing that talking to my mother is like engaging in a complex game of Chess.  Much to my surprise, it was a pleasant conversation.  They were informing me that they were moving to Virginia, and they wondered why they hadn't heard from me.  We put the pieces together about my Sibling's interference.\n\nI honestly feel like this is a good thing.  I no longer hold any animosity towards them.  They did the best they could with what they had (financially, they had plenty at the time.  Emotionally, not so much).  They're sick in their way just like I am in mine.  That doesn't mean I forget:  the flashbacks and nightmares make sure of that.  But some connection to them feels good.  I can't explain it.  I've been disconnected from family for over a decade.  I created a new family with my friends.  But to have *my* family back, even if it's never face to face feels like I've made progress.  Talking to them didn't trigger me.  \n\nI guess I'm rambling, but the reason for the post:  has anyone had a similar experience, and if so, do you have any advice for me?  I'm proceeding carefully.  Baby steps.  \n\nAlso worried about my therapist.  He's been out over a week now.  Not sure what he has, but it has to be pretty serious to last over a week and be so bad that he didn't come to work.  ", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4vnysg", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "Trauma_sucks", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 13, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 1, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_4vnysg", "spoiler": false, "permalink": "/r/ptsd/comments/4vnysg/my_abusers_have_contacted_me_after_a_decade_of_no/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1470104764.0, "url": "https://www.reddit.com/r/ptsd/comments/4vnysg/my_abusers_have_contacted_me_after_a_decade_of_no/", "author_flair_text": null, "quarantine": false, "title": "My abusers have contacted me after a decade of no contact", "created_utc": 1470075964.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.83, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 13}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4vnysg", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d64ozty", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "jfcsuperstar", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4vnysg", "score": 2, "approved_by": null, "downs": 0, "body": "I haven't had this happen but I've always dreamed of losing contact with particular family members. I think I would feel the same way and have the same realizations, that they did the best with what they could. It's good that you see them as whole people and recognize your own emotions and needs. Be safe with whatever decisions you make.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I haven&amp;#39;t had this happen but I&amp;#39;ve always dreamed of losing contact with particular family members. I think I would feel the same way and have the same realizations, that they did the best with what they could. It&amp;#39;s good that you see them as whole people and recognize your own emotions and needs. Be safe with whatever decisions you make.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d64ozty", "score_hidden": false, "permalink": "/r/ptsd/comments/4vnysg/my_abusers_have_contacted_me_after_a_decade_of_no/d64ozty/", "num_reports": null, "stickied": false, "created": 1470384918.0, "author_flair_text": null, "created_utc": 1470356118.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]