[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve recently started seeing a psychiatrist.  Still in the testing phase, but he&amp;#39;s already pretty confident that I have a &amp;quot;severe case of PTSD.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Tonight I can&amp;#39;t sleep.  Everytime I drift off, I snap back awake.  And so I wanted to write a bit about my experience, and see if I can get some good advice to maybe see things I&amp;#39;m missing.&lt;/p&gt;\n\n&lt;p&gt;I can&amp;#39;t really remember feeling normal.  My experience with all this started at seven.  My baby brother died.  And although I certainly didn&amp;#39;t get bad overnight, things started to get funky right then.  I grieved over his passing in an abnormal way, seemingly naturally repressing my emotions, taking months to years to finally start to feel some closure.&lt;/p&gt;\n\n&lt;p&gt;Then my family uprooted and moved clean across the country right as I turned eleven.&lt;/p&gt;\n\n&lt;p&gt;I felt alone.  Completely alone.  The last time I can remember feeling real palpable emotions was prior to the move.  Ever since then, it&amp;#39;s as though my entire life has slowly been transforming into a waking nightmare.&lt;/p&gt;\n\n&lt;p&gt;I was homeschooled, and when I hit middle school I desperately wanted to fit in.  Wanted people to like me.  I had plenty of opportunities to make friends, but I never felt like I belonged, never felt like I could relate to other people.&lt;/p&gt;\n\n&lt;p&gt;And so I slowly started becoming more and more of a fundamentally angry person.  If I wouldn&amp;#39;t be loved and valued, I could be respected.  I started eating any emotion.  Treating any sign of weakness in myself as an unforgivable sin.  &lt;/p&gt;\n\n&lt;p&gt;I often felt left out of my peer group.  On more than one occasion, I felt as though my entire peer group had turned against me.  And so I trained my psyche to prepare to take them all on at once.  If they wouldn&amp;#39;t care for me as one of their own, I would make them submit.&lt;/p&gt;\n\n&lt;p&gt;Should probably mention that this all corresponds to when my grandfather traumatically died in front of me.  Under circumstances that would fuck anyone up.  With a hospital nurse who wanted him dead laughing at his bedside while he coded.&lt;/p&gt;\n\n&lt;p&gt;Suddenly my entire world felt insecure.  Strong healthy people that I loved could just up and die.  The authorities I trusted to protect me might actually try to kill me.&lt;/p&gt;\n\n&lt;p&gt;I became more and more defensive both socially and traditionally.  My emotions slipping away from me, like a snake peeling off its skin.&lt;/p&gt;\n\n&lt;p&gt;A few years pass.  I struggle to understand my peers.  I desperately want to feel accepted and loved.  To feel like I matter.  I seem to be incapable of genuine human emotion and connection.&lt;/p&gt;\n\n&lt;p&gt;I read how tos and rigorously study Drake and Josh in an attempt to understand how to relate to people on their terms.  I am apparently quite attractive.  Develop a simple outgoing personality that works well enough.  Am rewarded by actually having girls fight over me.  Cool.&lt;/p&gt;\n\n&lt;p&gt;I try dating one of them.  I feel incapable of it.  I cannot actually connect with this girl.  Being around her causes massive amounts of cognitive dissonance.  On one hand I want to.  On the other, something feels wrong.  She doesn&amp;#39;t live up to my idealized understanding of what I&amp;#39;m supposed to be doing.&lt;/p&gt;\n\n&lt;p&gt;We break up.&lt;/p&gt;\n\n&lt;p&gt;Around this time I discover that people weren&amp;#39;t just buttering me up when they told me I was smart as a child.&lt;/p&gt;\n\n&lt;p&gt;I begin to have panic attacks.&lt;/p&gt;\n\n&lt;p&gt;I start to become massively intellectually dominant over my peer group in every way possible.  I turn seventeen.  My father slumps over in my arms from a massive heart attack.&lt;/p&gt;\n\n&lt;p&gt;When you give someone cpr turns out that they often vomit.  I still remember the hours after he died.  Staring at my self in the mirror, not wanting to clean the vomit off because in a twisted way it felt like the last connection to him I would ever have.&lt;/p&gt;\n\n&lt;p&gt;The morning of his funeral I fly out to compete in a national cybersecurity competition.  I feel nothing.&lt;/p&gt;\n\n&lt;p&gt;I feel a heavy blanket of darkness envelop me.  I cry for him twice.  I&amp;#39;m back in school the day after.  It takes me months to cry again even one more time.&lt;/p&gt;\n\n&lt;p&gt;I hear stories of people who lose control.  I have the opposite problem.  I don&amp;#39;t spiral out of control, I spiral out of humanity.  I begin to feel more and more robotic.  Everything about me becomes more and more efficient, dangerous.  My fear growing inside makes me a massive control freak.  I become intensely dominating.  Jason Bourne &amp;quot;have a plan to kill everyone you meet&amp;quot; style.  &lt;/p&gt;\n\n&lt;p&gt;I can smile and talk on the surface; my formerly lacking social skills now perfected to create the perfect guise of normal humanity.  But on the inside I become a true android.&lt;/p&gt;\n\n&lt;p&gt;I lose the ability to eat.  My panic attacks become far worse.&lt;/p&gt;\n\n&lt;p&gt;I am the perfect picture of cool calm collectedness.  Until I&amp;#39;m not.  Until I break down in fear on a nearly daily basis.&lt;/p&gt;\n\n&lt;p&gt;I can feel only fear.  I don&amp;#39;t grieve, I don&amp;#39;t feel sad.  I feel no deep emotions ever.  Only fear punctuated by brief sections of anger.&lt;/p&gt;\n\n&lt;p&gt;Years go by.  I oscillate, up and down.  Better and worse.&lt;/p&gt;\n\n&lt;p&gt;I begin to fit the bill of &amp;quot;sociopath&amp;quot; quite nicely on my good days.  When I embrace a limited form of sadism, I don&amp;#39;t have panic attacks.  I can numb myself by being mean to people.  &lt;/p&gt;\n\n&lt;p&gt;I become a firefighter.  The lack of empathy and robotic nature of my psyche make it easy for me to handle danger.&lt;/p&gt;\n\n&lt;p&gt;But I still can&amp;#39;t eat.  Still can&amp;#39;t move on with my life.  Feel more comfortable in a burning building than with rice in my mouth.&lt;/p&gt;\n\n&lt;p&gt;I struggle through college.  Now at the tip end I sit, ready to launch myself into the world, into a life of my own.  I will be ready to graduate soon.  And I&amp;#39;m terrified.&lt;/p&gt;\n\n&lt;p&gt;Finally after extensive research start to question my previously held assumptions.  I&amp;#39;m not a &amp;quot;sociopath&amp;quot; I just don&amp;#39;t fit.  With a big sigh of relief come to the conclusion that I&amp;#39;m autistic.  Decide to shirk off the &amp;quot;sociopathic armor&amp;quot; I&amp;#39;ve built.&lt;/p&gt;\n\n&lt;p&gt;FUCKING BOOM.  Panic and fear hit me like a bus.  I start having all day panic attacks.  I completely stop eating.  Start to notice new fun psychosomatic symptoms constantly.&lt;/p&gt;\n\n&lt;p&gt;Start to notice sensory issues I had always mistaken for panic attacks.  Footsteps pounding in my head.  Bright lights cooking my brain.&lt;/p&gt;\n\n&lt;p&gt;Current status, feeling broken.  Not sure I can fix this.  Wanting to redo my childhood.  Not able to feel anything.&lt;/p&gt;\n\n&lt;p&gt;I cried today.  That&amp;#39;s rare.  I don&amp;#39;t emote.  I don&amp;#39;t feel sadness, or happiness.  I don&amp;#39;t get angry anymore.&lt;/p&gt;\n\n&lt;p&gt;All I do is have panic attacks.  They seem to correspond with emotional events too.  As if that&amp;#39;s the only way my body knows how to feel anymore.&lt;/p&gt;\n\n&lt;p&gt;I just want to feel again.  Like when I was a child.  I want to look up at the sunset and feel something deep in my bones.  I&amp;#39;m tired of the cold uninterrupted stream of logic.  I don&amp;#39;t know how I can ever heal if I can&amp;#39;t bring my emotions out into the light.  They&amp;#39;ll likely just keep trying to pull my mind in half in an attempt to escape.  But I&amp;#39;m sitting over here trying as hard as I can to let them out, and nothing is coming from it.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I've recently started seeing a psychiatrist.  Still in the testing phase, but he's already pretty confident that I have a \"severe case of PTSD.\"\n\nTonight I can't sleep.  Everytime I drift off, I snap back awake.  And so I wanted to write a bit about my experience, and see if I can get some good advice to maybe see things I'm missing.\n\nI can't really remember feeling normal.  My experience with all this started at seven.  My baby brother died.  And although I certainly didn't get bad overnight, things started to get funky right then.  I grieved over his passing in an abnormal way, seemingly naturally repressing my emotions, taking months to years to finally start to feel some closure.\n\nThen my family uprooted and moved clean across the country right as I turned eleven.\n\nI felt alone.  Completely alone.  The last time I can remember feeling real palpable emotions was prior to the move.  Ever since then, it's as though my entire life has slowly been transforming into a waking nightmare.\n\nI was homeschooled, and when I hit middle school I desperately wanted to fit in.  Wanted people to like me.  I had plenty of opportunities to make friends, but I never felt like I belonged, never felt like I could relate to other people.\n\nAnd so I slowly started becoming more and more of a fundamentally angry person.  If I wouldn't be loved and valued, I could be respected.  I started eating any emotion.  Treating any sign of weakness in myself as an unforgivable sin.  \n\nI often felt left out of my peer group.  On more than one occasion, I felt as though my entire peer group had turned against me.  And so I trained my psyche to prepare to take them all on at once.  If they wouldn't care for me as one of their own, I would make them submit.\n\nShould probably mention that this all corresponds to when my grandfather traumatically died in front of me.  Under circumstances that would fuck anyone up.  With a hospital nurse who wanted him dead laughing at his bedside while he coded.\n\nSuddenly my entire world felt insecure.  Strong healthy people that I loved could just up and die.  The authorities I trusted to protect me might actually try to kill me.\n\nI became more and more defensive both socially and traditionally.  My emotions slipping away from me, like a snake peeling off its skin.\n\nA few years pass.  I struggle to understand my peers.  I desperately want to feel accepted and loved.  To feel like I matter.  I seem to be incapable of genuine human emotion and connection.\n\nI read how tos and rigorously study Drake and Josh in an attempt to understand how to relate to people on their terms.  I am apparently quite attractive.  Develop a simple outgoing personality that works well enough.  Am rewarded by actually having girls fight over me.  Cool.\n\nI try dating one of them.  I feel incapable of it.  I cannot actually connect with this girl.  Being around her causes massive amounts of cognitive dissonance.  On one hand I want to.  On the other, something feels wrong.  She doesn't live up to my idealized understanding of what I'm supposed to be doing.\n\nWe break up.\n\nAround this time I discover that people weren't just buttering me up when they told me I was smart as a child.\n\nI begin to have panic attacks.\n\nI start to become massively intellectually dominant over my peer group in every way possible.  I turn seventeen.  My father slumps over in my arms from a massive heart attack.\n\nWhen you give someone cpr turns out that they often vomit.  I still remember the hours after he died.  Staring at my self in the mirror, not wanting to clean the vomit off because in a twisted way it felt like the last connection to him I would ever have.\n\nThe morning of his funeral I fly out to compete in a national cybersecurity competition.  I feel nothing.\n\nI feel a heavy blanket of darkness envelop me.  I cry for him twice.  I'm back in school the day after.  It takes me months to cry again even one more time.\n\nI hear stories of people who lose control.  I have the opposite problem.  I don't spiral out of control, I spiral out of humanity.  I begin to feel more and more robotic.  Everything about me becomes more and more efficient, dangerous.  My fear growing inside makes me a massive control freak.  I become intensely dominating.  Jason Bourne \"have a plan to kill everyone you meet\" style.  \n\nI can smile and talk on the surface; my formerly lacking social skills now perfected to create the perfect guise of normal humanity.  But on the inside I become a true android.\n\nI lose the ability to eat.  My panic attacks become far worse.\n\nI am the perfect picture of cool calm collectedness.  Until I'm not.  Until I break down in fear on a nearly daily basis.\n\nI can feel only fear.  I don't grieve, I don't feel sad.  I feel no deep emotions ever.  Only fear punctuated by brief sections of anger.\n\nYears go by.  I oscillate, up and down.  Better and worse.\n\nI begin to fit the bill of \"sociopath\" quite nicely on my good days.  When I embrace a limited form of sadism, I don't have panic attacks.  I can numb myself by being mean to people.  \n\nI become a firefighter.  The lack of empathy and robotic nature of my psyche make it easy for me to handle danger.\n\nBut I still can't eat.  Still can't move on with my life.  Feel more comfortable in a burning building than with rice in my mouth.\n\nI struggle through college.  Now at the tip end I sit, ready to launch myself into the world, into a life of my own.  I will be ready to graduate soon.  And I'm terrified.\n\nFinally after extensive research start to question my previously held assumptions.  I'm not a \"sociopath\" I just don't fit.  With a big sigh of relief come to the conclusion that I'm autistic.  Decide to shirk off the \"sociopathic armor\" I've built.\n\nFUCKING BOOM.  Panic and fear hit me like a bus.  I start having all day panic attacks.  I completely stop eating.  Start to notice new fun psychosomatic symptoms constantly.\n\nStart to notice sensory issues I had always mistaken for panic attacks.  Footsteps pounding in my head.  Bright lights cooking my brain.\n\nCurrent status, feeling broken.  Not sure I can fix this.  Wanting to redo my childhood.  Not able to feel anything.\n\nI cried today.  That's rare.  I don't emote.  I don't feel sadness, or happiness.  I don't get angry anymore.\n\nAll I do is have panic attacks.  They seem to correspond with emotional events too.  As if that's the only way my body knows how to feel anymore.\n\nI just want to feel again.  Like when I was a child.  I want to look up at the sunset and feel something deep in my bones.  I'm tired of the cold uninterrupted stream of logic.  I don't know how I can ever heal if I can't bring my emotions out into the light.  They'll likely just keep trying to pull my mind in half in an attempt to escape.  But I'm sitting over here trying as hard as I can to let them out, and nothing is coming from it.", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4vllq0", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "Threwaweyee10", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 7, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 2, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_4vllq0", "spoiler": false, "permalink": "/r/ptsd/comments/4vllq0/id_like_your_input/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1470071276.0, "url": "https://www.reddit.com/r/ptsd/comments/4vllq0/id_like_your_input/", "author_flair_text": null, "quarantine": false, "title": "I'd like your input.", "created_utc": 1470042476.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.9, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 7}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4vllq0", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d6179ho", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "argylepancake", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4vllq0", "score": 2, "approved_by": null, "downs": 0, "body": "Yup. This sounds like Complex PTSD with emotional regulation problems. \n\nYou ascribe repressing emotions at 7 as abnormal, this is inaccurate.  Numbing overwhelming emotions is a perfectly normal response for a child. Children aren't equipped with the capacity or awareness of emotional regulation, where as adults we grieve in stages or waves. We feel the horrible feels, then we take a break. We repeat this cycle over and over until we can normalize, can think of our trauma without being paralyzed by the pain of it. \n\nChildren don't have this capability to pause and process emotion like adults. They need help with emotional regulation. But not all parents, even well meaning, loving parents, are equipped with the skills to help a grieving child. And then you had another trauma, being wrenched out of your safe home where the good feelings came from. Then you had to socialize beyond your capacity. Then your grandfather and father die. \n\nYou have a lot of trauma and no one taught you how to process it. Of course you're numb and having emotional regulation problems. That seems like a perfectly normal response. I'm not discounting the autism but even without that added difficulty with processing your experiences, I would expect you to vascilate between numb and panic/freakouts/rage. That is a normal response to trauma. \n\nYou need more accurate data. I'd recommend reading Trauma and Recovery by Judith Lewis Herman, she came up with the criteria for Complex PTSD in the 70s working with vets. I'd also recommend you read Toxic Parents by Susan Forward, not because I'm suggesting your parents were toxic but because she very clearly explains what happens to children when their emotions are overwhelmed and how that can mess us up. \n\nIt also makes sense that when you shed the inaccurate sociopath label that you would have more emotional upheaval. What the numbess and alters or personas (sociopath) do, is lock away emotions that we don't feel safe feeling. When you shed the persona, the emotions it was guarding come out. Sometimes all at once. My main coping response to my traumatic childhood and teenage years was numbness and rage. \n\nI went thru a period of what I call frantic attacks. They were different than my \"regular\" panic attacks. I would get overwhelmed by emotional pain and would want to tear at my own skin, hit things and scream. Sometimes there would be crying but mostly I would just flip out and have to go be alone somewhere. \n\nYou can get through this. Trauma recovery isn't easy and it isn't fast but it is something you're capable of. You've already started. Does your doctor know about the panic attacks and how it's messing up your sleep cycle? If not please tell them. If you're adverse to taking sleep medication or benzos I recommend a beta blocker. I still use them for occasional panic flare ups. All it does is calm my heart rate and physical panic so my body isn't being attacked by my emotions. \n\nPM or ask me anything. \n\nEdit, a word", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yup. This sounds like Complex PTSD with emotional regulation problems. &lt;/p&gt;\n\n&lt;p&gt;You ascribe repressing emotions at 7 as abnormal, this is inaccurate.  Numbing overwhelming emotions is a perfectly normal response for a child. Children aren&amp;#39;t equipped with the capacity or awareness of emotional regulation, where as adults we grieve in stages or waves. We feel the horrible feels, then we take a break. We repeat this cycle over and over until we can normalize, can think of our trauma without being paralyzed by the pain of it. &lt;/p&gt;\n\n&lt;p&gt;Children don&amp;#39;t have this capability to pause and process emotion like adults. They need help with emotional regulation. But not all parents, even well meaning, loving parents, are equipped with the skills to help a grieving child. And then you had another trauma, being wrenched out of your safe home where the good feelings came from. Then you had to socialize beyond your capacity. Then your grandfather and father die. &lt;/p&gt;\n\n&lt;p&gt;You have a lot of trauma and no one taught you how to process it. Of course you&amp;#39;re numb and having emotional regulation problems. That seems like a perfectly normal response. I&amp;#39;m not discounting the autism but even without that added difficulty with processing your experiences, I would expect you to vascilate between numb and panic/freakouts/rage. That is a normal response to trauma. &lt;/p&gt;\n\n&lt;p&gt;You need more accurate data. I&amp;#39;d recommend reading Trauma and Recovery by Judith Lewis Herman, she came up with the criteria for Complex PTSD in the 70s working with vets. I&amp;#39;d also recommend you read Toxic Parents by Susan Forward, not because I&amp;#39;m suggesting your parents were toxic but because she very clearly explains what happens to children when their emotions are overwhelmed and how that can mess us up. &lt;/p&gt;\n\n&lt;p&gt;It also makes sense that when you shed the inaccurate sociopath label that you would have more emotional upheaval. What the numbess and alters or personas (sociopath) do, is lock away emotions that we don&amp;#39;t feel safe feeling. When you shed the persona, the emotions it was guarding come out. Sometimes all at once. My main coping response to my traumatic childhood and teenage years was numbness and rage. &lt;/p&gt;\n\n&lt;p&gt;I went thru a period of what I call frantic attacks. They were different than my &amp;quot;regular&amp;quot; panic attacks. I would get overwhelmed by emotional pain and would want to tear at my own skin, hit things and scream. Sometimes there would be crying but mostly I would just flip out and have to go be alone somewhere. &lt;/p&gt;\n\n&lt;p&gt;You can get through this. Trauma recovery isn&amp;#39;t easy and it isn&amp;#39;t fast but it is something you&amp;#39;re capable of. You&amp;#39;ve already started. Does your doctor know about the panic attacks and how it&amp;#39;s messing up your sleep cycle? If not please tell them. If you&amp;#39;re adverse to taking sleep medication or benzos I recommend a beta blocker. I still use them for occasional panic flare ups. All it does is calm my heart rate and physical panic so my body isn&amp;#39;t being attacked by my emotions. &lt;/p&gt;\n\n&lt;p&gt;PM or ask me anything. &lt;/p&gt;\n\n&lt;p&gt;Edit, a word&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d6179ho", "score_hidden": false, "permalink": "/r/ptsd/comments/4vllq0/id_like_your_input/d6179ho/", "num_reports": null, "stickied": false, "created": 1470184792.0, "author_flair_text": null, "created_utc": 1470155992.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4vllq0", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d606v90", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "wittyish", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4vllq0", "score": 1, "approved_by": null, "downs": 0, "body": "Wow. That was a lot to write out and a pretty cold assessment of your life so far. I think that you are looking at it through lenses tinted with the numbness you have cultivated, which is understandable but not as objective as you might think. \n\nI have mentioned on other posts that my mind was blown when I learned that you couldn't just stop feeling the \"bad\" emotions, but that numbing and avoidance cause you to avoid a wider and wider array of emotions, until only the major highs or lows hit you. It was at that point, desperately wanting to be happy with my objectively great life, but feeling nothing but anxiety and fear it would all be ripped away at any moment, that I decided I would take the bad, if it would get me the good.\n\nI wish I could tell you that the next day was easier, but it wasn't. Or the one after that. But 18 months later I AM better. I am happier, and sometimes sadder. I still numb occasionally, but I recognize it and try to process it with my therapist. Or I don't, and she point it out. :) \n\nWhile I would never diagnose someone, I agree, you don't sound like a sociopath. You sound like someone who learned how to appear functioning while pushing the terror of unregulated emotions as far away as possible. My therapist told me I never learned to process emotion (grief, anger, sadness, fear, joy, contentment (still the hardest in my book), disgust, love) in any real way. I never learned the language, the actions, or had my impulses validated by those around me, so I just shoved them down. But the best part about being an adult, we can decide to learn emotions, like anything else in the world. We can find ways to teach ourselves and shift towards a more natural, less \"pretending-to-be-human\" way.\n\nGood luck! It is a tough road, but ultimately worth every step. When I feel angry now, I let myself be angry. At a person. And sometimes tell them. Such a few simple strokes on a keyboard, but you know how terrifying it is, worrying that your rage will engulf everything. But now... I am just pissed and then I get over it. &lt;~~~ mindblown!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow. That was a lot to write out and a pretty cold assessment of your life so far. I think that you are looking at it through lenses tinted with the numbness you have cultivated, which is understandable but not as objective as you might think. &lt;/p&gt;\n\n&lt;p&gt;I have mentioned on other posts that my mind was blown when I learned that you couldn&amp;#39;t just stop feeling the &amp;quot;bad&amp;quot; emotions, but that numbing and avoidance cause you to avoid a wider and wider array of emotions, until only the major highs or lows hit you. It was at that point, desperately wanting to be happy with my objectively great life, but feeling nothing but anxiety and fear it would all be ripped away at any moment, that I decided I would take the bad, if it would get me the good.&lt;/p&gt;\n\n&lt;p&gt;I wish I could tell you that the next day was easier, but it wasn&amp;#39;t. Or the one after that. But 18 months later I AM better. I am happier, and sometimes sadder. I still numb occasionally, but I recognize it and try to process it with my therapist. Or I don&amp;#39;t, and she point it out. :) &lt;/p&gt;\n\n&lt;p&gt;While I would never diagnose someone, I agree, you don&amp;#39;t sound like a sociopath. You sound like someone who learned how to appear functioning while pushing the terror of unregulated emotions as far away as possible. My therapist told me I never learned to process emotion (grief, anger, sadness, fear, joy, contentment (still the hardest in my book), disgust, love) in any real way. I never learned the language, the actions, or had my impulses validated by those around me, so I just shoved them down. But the best part about being an adult, we can decide to learn emotions, like anything else in the world. We can find ways to teach ourselves and shift towards a more natural, less &amp;quot;pretending-to-be-human&amp;quot; way.&lt;/p&gt;\n\n&lt;p&gt;Good luck! It is a tough road, but ultimately worth every step. When I feel angry now, I let myself be angry. At a person. And sometimes tell them. Such a few simple strokes on a keyboard, but you know how terrifying it is, worrying that your rage will engulf everything. But now... I am just pissed and then I get over it. &amp;lt;~~~ mindblown!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d606v90", "score_hidden": false, "permalink": "/r/ptsd/comments/4vllq0/id_like_your_input/d606v90/", "num_reports": null, "stickied": false, "created": 1470117198.0, "author_flair_text": null, "created_utc": 1470088398.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]