[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My very first wall of text...&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t even know where to begin. I&amp;#39;m seeing a therapist and have just begun to try to actually feel things again for the first time in a few years. Now that I&amp;#39;m trying, the first and most dominant emotion that I feel is anxiety. I&amp;#39;ve never been and anxiety prone person before, and I feel like I&amp;#39;m going insane. I fucked up last weekend and broke something at work and had the second panic attack I&amp;#39;ve ever had as soon as I left. Now I can&amp;#39;t think straight. My boss is an evil girl who actively lets people make mistakes so that she can point them out to her bosses. When I ask how to do something(as I started two weeks ago) she will look at me like Im retarded and give me a one word condescending answer. She let me work an entire day doing things the wrong way and when I asked why she said that that&amp;#39;s how you learn. Not an hour or two , but eight hours of lost productivity. I&amp;#39;ve talked to a number of people in different depts and they all say the same thing. She does it to hold onto control. This company is really anal and old boys club if you know what I mean, and the chain of command is so rigid that I&amp;#39;m only allowed to ask her for advice. If I ask if X or Y person is a nice boss, or how do you like working here, every single person looks around out of fear and admonishes me for potentially saying something critical of the company. If I ask for help with something people refuse out of fear of stepping out of line. When I asked what I should do to improve my work quality was told to ask someone in private. Then I freaked out on Tuesday after I fucked up kinda bad and raced to my therapy appointment that I thought was that day. It wasn&amp;#39;t. Now I can&amp;#39;t think straight or remember simple directions. I&amp;#39;m trying to find a psychiatrist but they&amp;#39;re all full. I&amp;#39;ve been scoffed at and treated like a junkie when I&amp;#39;ve called about my ptsd and adhd. The other ones I&amp;#39;ve called won&amp;#39;t have any openings until at least April. On  Thursday I came home and cried and my girlfriend said that I&amp;#39;ve been like this for three days and I can&amp;#39;t keep coming home like this. She doesn&amp;#39;t mean to be harsh but she is. She spent an hour telling me that it&amp;#39;s in my head and that I&amp;#39;m blowing it out of proportion. This is the most important job I&amp;#39;ve ever landed and I&amp;#39;m running around like an idiot. No one will help me and I don&amp;#39;t know what to do. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My very first wall of text...\n\nI don't even know where to begin. I'm seeing a therapist and have just begun to try to actually feel things again for the first time in a few years. Now that I'm trying, the first and most dominant emotion that I feel is anxiety. I've never been and anxiety prone person before, and I feel like I'm going insane. I fucked up last weekend and broke something at work and had the second panic attack I've ever had as soon as I left. Now I can't think straight. My boss is an evil girl who actively lets people make mistakes so that she can point them out to her bosses. When I ask how to do something(as I started two weeks ago) she will look at me like Im retarded and give me a one word condescending answer. She let me work an entire day doing things the wrong way and when I asked why she said that that's how you learn. Not an hour or two , but eight hours of lost productivity. I've talked to a number of people in different depts and they all say the same thing. She does it to hold onto control. This company is really anal and old boys club if you know what I mean, and the chain of command is so rigid that I'm only allowed to ask her for advice. If I ask if X or Y person is a nice boss, or how do you like working here, every single person looks around out of fear and admonishes me for potentially saying something critical of the company. If I ask for help with something people refuse out of fear of stepping out of line. When I asked what I should do to improve my work quality was told to ask someone in private. Then I freaked out on Tuesday after I fucked up kinda bad and raced to my therapy appointment that I thought was that day. It wasn't. Now I can't think straight or remember simple directions. I'm trying to find a psychiatrist but they're all full. I've been scoffed at and treated like a junkie when I've called about my ptsd and adhd. The other ones I've called won't have any openings until at least April. On  Thursday I came home and cried and my girlfriend said that I've been like this for three days and I can't keep coming home like this. She doesn't mean to be harsh but she is. She spent an hour telling me that it's in my head and that I'm blowing it out of proportion. This is the most important job I've ever landed and I'm running around like an idiot. No one will help me and I don't know what to do. ", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "2ufidi", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "Internetopinionguy", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 5, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 3, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_2ufidi", "spoiler": false, "permalink": "/r/ptsd/comments/2ufidi/i_had_a_panic_attack_at_work_and_now_i_cant_think/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1422845278.0, "url": "https://www.reddit.com/r/ptsd/comments/2ufidi/i_had_a_panic_attack_at_work_and_now_i_cant_think/", "author_flair_text": null, "quarantine": false, "title": "I had a panic attack at work and now I cant think straight. I need help.", "created_utc": 1422816478.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.86, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 5}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2ufidi", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cogyoni", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "dustygrapes", "can_mod_post": false, "send_replies": true, "parent_id": "t3_2ufidi", "score": 1, "approved_by": null, "downs": 0, "body": "This actually sounds very similar to a situation I was in, with a shitty boss and work environment that was better suited to high school cliques. I even had an uncontrollable episode complete with sobbing and twitching while on the job and it was an inspection day. When it boiled down to it, as long as I did my job and well enough to the point that no one could point a finger at me with a dusty white glove then, that's all that really mattered. I couldn't help but be effected by my co-workers and bosses attitudes ( my boss and the assistant manager we're married and technically not supposed to have a monopoly on those roles as a couple) which I thought were fairly poor but that's when I found a handbook. As soon as I discovered one existed I had my nose in it ever chance I had. To me as long as I knew that I was doing all I could to do my job effectively then (after I was calm) I would rationalize that I was morally justified and that holds a lot of significance for me. Sorry don't know if it helps knowing someone has had similarities but figured I'd give it a shot-good luck ;)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This actually sounds very similar to a situation I was in, with a shitty boss and work environment that was better suited to high school cliques. I even had an uncontrollable episode complete with sobbing and twitching while on the job and it was an inspection day. When it boiled down to it, as long as I did my job and well enough to the point that no one could point a finger at me with a dusty white glove then, that&amp;#39;s all that really mattered. I couldn&amp;#39;t help but be effected by my co-workers and bosses attitudes ( my boss and the assistant manager we&amp;#39;re married and technically not supposed to have a monopoly on those roles as a couple) which I thought were fairly poor but that&amp;#39;s when I found a handbook. As soon as I discovered one existed I had my nose in it ever chance I had. To me as long as I knew that I was doing all I could to do my job effectively then (after I was calm) I would rationalize that I was morally justified and that holds a lot of significance for me. Sorry don&amp;#39;t know if it helps knowing someone has had similarities but figured I&amp;#39;d give it a shot-good luck ;)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cogyoni", "score_hidden": false, "permalink": "/r/ptsd/comments/2ufidi/i_had_a_panic_attack_at_work_and_now_i_cant_think/cogyoni/", "num_reports": null, "stickied": false, "created": 1423599559.0, "author_flair_text": null, "created_utc": 1423570759.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2ufidi", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2ufidi", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "co7zhxd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Internetopinionguy", "can_mod_post": false, "send_replies": true, "parent_id": "t1_co7xcv0", "score": 3, "approved_by": null, "downs": 0, "body": "Thank you. \nYou're good at this. My therapist said that all of the clinics psychiatrists are full and not taking anyone. I don't have a regular doctor but I do always go to the same clinic. This is new to me(ptsd) and now that I'm understanding it more my symptoms are creeping out. I didn't know what dissociation was and now when it keeps happening at work or home I start to panic. It's mentally crippling, and if I'm going to be honest, one of the biggest things with me is massive self loathing and not wanting to talk about it with my friends. It's not their problem. I know how stupid that sounds but it's true. If I even imagine telling them I cry. I hate sympathy. I've never had much patience for people who never pull their head out of their ass and so I can't expect anyone else to. Ron Swanson libertarian style. \nFuck this is long. I'll reread your advice and try to use it at work. I really appreciate it. \nSometimes the internet isn't so bad. ", "edited": 1422821999.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you. \nYou&amp;#39;re good at this. My therapist said that all of the clinics psychiatrists are full and not taking anyone. I don&amp;#39;t have a regular doctor but I do always go to the same clinic. This is new to me(ptsd) and now that I&amp;#39;m understanding it more my symptoms are creeping out. I didn&amp;#39;t know what dissociation was and now when it keeps happening at work or home I start to panic. It&amp;#39;s mentally crippling, and if I&amp;#39;m going to be honest, one of the biggest things with me is massive self loathing and not wanting to talk about it with my friends. It&amp;#39;s not their problem. I know how stupid that sounds but it&amp;#39;s true. If I even imagine telling them I cry. I hate sympathy. I&amp;#39;ve never had much patience for people who never pull their head out of their ass and so I can&amp;#39;t expect anyone else to. Ron Swanson libertarian style. \nFuck this is long. I&amp;#39;ll reread your advice and try to use it at work. I really appreciate it. \nSometimes the internet isn&amp;#39;t so bad. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_co7zhxd", "score_hidden": false, "permalink": "/r/ptsd/comments/2ufidi/i_had_a_panic_attack_at_work_and_now_i_cant_think/co7zhxd/", "num_reports": null, "stickied": false, "created": 1422850549.0, "author_flair_text": null, "created_utc": 1422821749.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "co7xcv0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "rewardiflost", "can_mod_post": false, "send_replies": true, "parent_id": "t3_2ufidi", "score": 3, "approved_by": null, "downs": 0, "body": "Take a breath and give yourself a chance.   \n\nYou have been diagnosed, and you are seeing a therapist for treatment.   That's good.    \n\nConfusion, missed appointments, memory issues and panic are all common stuff in PTSD and other conditions.   You aren't crazy or broken.   Stuff happens.   \n\nThis job sounds like it is a lot of pressure.   Is it really worth all that?    I'm not saying quit today - but look around.   There has to be another way you could make a living if this company went out of business.    Here, you only gave us the bad stuff about the job;  a bad boss, a tough environment,  nervous employees,  old boys club...   It really sounds shitty.   \n\nYour GF isn't being supportive.  Even if you did find help today, that doesn't mean your panic is magically going to disappear.   You don't just 'walk it off' like a cramp.     While she might care about you, she has no idea what you are going through.   Well-meaning people can still be ignorant.   Educate her, or re-evaluate your relationship.   If she treats you like this after only 3 bad days,  what kind of life will you have when life really gets ugly?     \n\nMedically, you seem to need more help than just the therapy you have now.   In my corner of the US, a lot depends on your insurance , and how you present to the docs.     If you have your regular general practice doc, or your therapist make a call to a colleague, and they say you need an appointment right away - you should get something within 2 weeks.    I'd get a couple of referrals, because Psychiatrists (and therapists) aren't one-size-fits-all.   You may need to shop around to find one you like.    \nAnd sure, basically cold-calling a bunch of docs can seem like drug-seeking behavior.   Getting referred from another doc,  or even going to a clinic/emergency room with your panic symptoms (rule out something else like asthma, bronchospasm, or heart trouble) establishes that you really have some medical need for more thorough treatment.   \n\nMy suggestions (TL;DR)-     \n\n  *  Call your therapist (and regular doc) for a psych referral, possibly an extra therapy appointment ASAP.     \n  *  If the symptoms of panic attacks keep recurring - go to a hospital or clinic to rule out other stuff.  We can't trust ourselves to self-diagnose, no matter how good our google skills are - nor what past diagnosis is.  (remember the confusion about simple stuff... medicine is complicated)  \n  *  Think about the reasons why you chose to take this job.   If you really want to work here, try to focus on the good things as you develop strategies to deal with the crap.      \n  *  Explain to your SO/GF that this is serious, and it isn't magically going to disappear.   Hopefully this won't happen often or again,  but it can.   If she can't handle this and support you now, both of you need to consider this in your future plans. \n  *  Look around for other support;  friends, religious groups, gaming clubs,  maker organizations,  family,  professional mentors...   all can help and offer advice.    \n\n\nEdited - added one point and (TL;DR) to the end. ", "edited": 1422818159.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Take a breath and give yourself a chance.   &lt;/p&gt;\n\n&lt;p&gt;You have been diagnosed, and you are seeing a therapist for treatment.   That&amp;#39;s good.    &lt;/p&gt;\n\n&lt;p&gt;Confusion, missed appointments, memory issues and panic are all common stuff in PTSD and other conditions.   You aren&amp;#39;t crazy or broken.   Stuff happens.   &lt;/p&gt;\n\n&lt;p&gt;This job sounds like it is a lot of pressure.   Is it really worth all that?    I&amp;#39;m not saying quit today - but look around.   There has to be another way you could make a living if this company went out of business.    Here, you only gave us the bad stuff about the job;  a bad boss, a tough environment,  nervous employees,  old boys club...   It really sounds shitty.   &lt;/p&gt;\n\n&lt;p&gt;Your GF isn&amp;#39;t being supportive.  Even if you did find help today, that doesn&amp;#39;t mean your panic is magically going to disappear.   You don&amp;#39;t just &amp;#39;walk it off&amp;#39; like a cramp.     While she might care about you, she has no idea what you are going through.   Well-meaning people can still be ignorant.   Educate her, or re-evaluate your relationship.   If she treats you like this after only 3 bad days,  what kind of life will you have when life really gets ugly?     &lt;/p&gt;\n\n&lt;p&gt;Medically, you seem to need more help than just the therapy you have now.   In my corner of the US, a lot depends on your insurance , and how you present to the docs.     If you have your regular general practice doc, or your therapist make a call to a colleague, and they say you need an appointment right away - you should get something within 2 weeks.    I&amp;#39;d get a couple of referrals, because Psychiatrists (and therapists) aren&amp;#39;t one-size-fits-all.   You may need to shop around to find one you like.&lt;br/&gt;\nAnd sure, basically cold-calling a bunch of docs can seem like drug-seeking behavior.   Getting referred from another doc,  or even going to a clinic/emergency room with your panic symptoms (rule out something else like asthma, bronchospasm, or heart trouble) establishes that you really have some medical need for more thorough treatment.   &lt;/p&gt;\n\n&lt;p&gt;My suggestions (TL;DR)-     &lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt; Call your therapist (and regular doc) for a psych referral, possibly an extra therapy appointment ASAP.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt; If the symptoms of panic attacks keep recurring - go to a hospital or clinic to rule out other stuff.  We can&amp;#39;t trust ourselves to self-diagnose, no matter how good our google skills are - nor what past diagnosis is.  (remember the confusion about simple stuff... medicine is complicated)&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt; Think about the reasons why you chose to take this job.   If you really want to work here, try to focus on the good things as you develop strategies to deal with the crap.&lt;br/&gt;&lt;/li&gt;\n&lt;li&gt; Explain to your SO/GF that this is serious, and it isn&amp;#39;t magically going to disappear.   Hopefully this won&amp;#39;t happen often or again,  but it can.   If she can&amp;#39;t handle this and support you now, both of you need to consider this in your future plans. &lt;/li&gt;\n&lt;li&gt; Look around for other support;  friends, religious groups, gaming clubs,  maker organizations,  family,  professional mentors...   all can help and offer advice.&lt;br/&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Edited - added one point and (TL;DR) to the end. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_co7xcv0", "score_hidden": false, "permalink": "/r/ptsd/comments/2ufidi/i_had_a_panic_attack_at_work_and_now_i_cant_think/co7xcv0/", "num_reports": null, "stickied": false, "created": 1422846640.0, "author_flair_text": null, "created_utc": 1422817840.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]