[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I was diagnosed with depression in eighth grade, but I kind of knew I had it a little before then. Middle school was tough - I went to small private school and I had barely any friends. I went to therapy, and saw a psychiatrist, and started taking medication.\nI&amp;#39;m in high school now. It&amp;#39;s much better. I have friends, and I feel comfortable. I thought my depression was pretty much gone. But I just feel terrible all the time. I&amp;#39;m not good enough at anything. Everything interests me, but NOTHING interests me, and I can&amp;#39;t think of anything I&amp;#39;d want to do after I graduate. I just feel so useless. EVERYTHING is useless. Nothing will ever make a difference - this is just a tiny goddamn planet in a tiny galaxy in a big fucking universe so why does it all even matter?! I don&amp;#39;t want to do anything. All I feel is a big gaping hole inside. I can&amp;#39;t even do the things I like. I can&amp;#39;t read, I can&amp;#39;t write, I can&amp;#39;t freaking sit on my computer and watch anime! All I ever want to do is sleep, but then I feel like crap for doing nothing. To be honest, around fifth grade I started reading more fantasy, and since then all I&amp;#39;ve ever wanted was to be a mage or a sorceress and live a life of adventure but it&amp;#39;s been so long, and by now I know deep inside that it will never happen. I&amp;#39;d like to be an actress, but I&amp;#39;m not talented enough to do it professionally. I don&amp;#39;t know if I&amp;#39;m actually depressed right now, or if I&amp;#39;m just upset because I didn&amp;#39;t get the part I wanted in a play. I don&amp;#39;t want to make any rash decisions about what to do next. I don&amp;#39;t mean suicide, but like totally changing the way I live. Does that make any sense?\nI can&amp;#39;t focus. I should be doing homework right now, but instead I&amp;#39;m seeking help on the fucking internet. It&amp;#39;s been a problem for a while now, that I can&amp;#39;t concentrate and just do my fucking homework. I don&amp;#39;t get enough sleep. That, or my serotonin level is too low so I don&amp;#39;t have any energy. \nMy parents brought me to see another psychiatrist a few weeks ago, and they doubled my medication. I still don&amp;#39;t think it&amp;#39;s working right. I can try something else, but they&amp;#39;ve mentioned that sometimes other kinds of antidepressants can cause people to gain weight, and I don&amp;#39;t want that. It&amp;#39;s pretty dumb. I&amp;#39;m skinny and all, but I&amp;#39;m always afraid of being ugly and fat.\nGeez, I don&amp;#39;t know why I thought this was a good idea. I guess it felt pretty good to get it all off my chest. It&amp;#39;s much harder to actually say these things out loud. Maybe someone will read this and give me some loving words of advice. That would be appreciated. I sound pretty bitchy here, but I&amp;#39;m actually a nice person.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I was diagnosed with depression in eighth grade, but I kind of knew I had it a little before then. Middle school was tough - I went to small private school and I had barely any friends. I went to therapy, and saw a psychiatrist, and started taking medication.\nI'm in high school now. It's much better. I have friends, and I feel comfortable. I thought my depression was pretty much gone. But I just feel terrible all the time. I'm not good enough at anything. Everything interests me, but NOTHING interests me, and I can't think of anything I'd want to do after I graduate. I just feel so useless. EVERYTHING is useless. Nothing will ever make a difference - this is just a tiny goddamn planet in a tiny galaxy in a big fucking universe so why does it all even matter?! I don't want to do anything. All I feel is a big gaping hole inside. I can't even do the things I like. I can't read, I can't write, I can't freaking sit on my computer and watch anime! All I ever want to do is sleep, but then I feel like crap for doing nothing. To be honest, around fifth grade I started reading more fantasy, and since then all I've ever wanted was to be a mage or a sorceress and live a life of adventure but it's been so long, and by now I know deep inside that it will never happen. I'd like to be an actress, but I'm not talented enough to do it professionally. I don't know if I'm actually depressed right now, or if I'm just upset because I didn't get the part I wanted in a play. I don't want to make any rash decisions about what to do next. I don't mean suicide, but like totally changing the way I live. Does that make any sense?\nI can't focus. I should be doing homework right now, but instead I'm seeking help on the fucking internet. It's been a problem for a while now, that I can't concentrate and just do my fucking homework. I don't get enough sleep. That, or my serotonin level is too low so I don't have any energy. \nMy parents brought me to see another psychiatrist a few weeks ago, and they doubled my medication. I still don't think it's working right. I can try something else, but they've mentioned that sometimes other kinds of antidepressants can cause people to gain weight, and I don't want that. It's pretty dumb. I'm skinny and all, but I'm always afraid of being ugly and fat.\nGeez, I don't know why I thought this was a good idea. I guess it felt pretty good to get it all off my chest. It's much harder to actually say these things out loud. Maybe someone will read this and give me some loving words of advice. That would be appreciated. I sound pretty bitchy here, but I'm actually a nice person.", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "3n0ngr", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "silverstreak24", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 1, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 3, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338991, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_3n0ngr", "spoiler": false, "permalink": "/r/depression/comments/3n0ngr/i_dont_even_know_please_read/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1443676210.0, "url": "https://www.reddit.com/r/depression/comments/3n0ngr/i_dont_even_know_please_read/", "author_flair_text": null, "quarantine": false, "title": "I don't even know. Please read", "created_utc": 1443647410.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 1}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3n0ngr", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cvjsb77", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DjFaze3", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3n0ngr", "score": 1, "approved_by": null, "downs": 0, "body": "Really sorry to hear about all you're going through.  IMHO, talk to someone you trust about how you're feeling.  Depression skews the way we look at things and getting a different perspective can bring clarity to what we're going through.  Just posting this is a step in the right direction.  Maybe talking to a therapist could help in addition to medication.  It takes time and patience to get better, which sucks when we feel like crap.  I'm not going to give you the whole \"you're young\" bullshit speech - just keep working towards your goals and we're all rooting for you.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Really sorry to hear about all you&amp;#39;re going through.  IMHO, talk to someone you trust about how you&amp;#39;re feeling.  Depression skews the way we look at things and getting a different perspective can bring clarity to what we&amp;#39;re going through.  Just posting this is a step in the right direction.  Maybe talking to a therapist could help in addition to medication.  It takes time and patience to get better, which sucks when we feel like crap.  I&amp;#39;m not going to give you the whole &amp;quot;you&amp;#39;re young&amp;quot; bullshit speech - just keep working towards your goals and we&amp;#39;re all rooting for you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_cvjsb77", "score_hidden": false, "permalink": "/r/depression/comments/3n0ngr/i_dont_even_know_please_read/cvjsb77/", "num_reports": null, "stickied": false, "created": 1443677590.0, "author_flair_text": null, "created_utc": 1443648790.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3n0ngr", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cvjsmce", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "nona_clare", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3n0ngr", "score": 1, "approved_by": null, "downs": 0, "body": "*big hugs* You're going to be OK and it's OK that you're not OK right now. If your meds have just changed it will take more than a few weeks to feel the difference and these might not be the right ones for you. Anti-depressants are all trial and error until you find the right fit for you, I went through 4 different meds and my most recent ones have only just hit on the magic dosage. For now focus on small victories, today I will: get out of bed before 9am, have a shower, eat something, spend time doing something I enjoy (watching videos or reading), achieve something towards my homework. Everything over and above that is a bonus. If you need someone to talk to who understands what you're going through feel free to message me (27-f bipolar &amp; major depression), I'm happy to listen to vents or offer advice on how to keep on keeping on", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;em&gt;big hugs&lt;/em&gt; You&amp;#39;re going to be OK and it&amp;#39;s OK that you&amp;#39;re not OK right now. If your meds have just changed it will take more than a few weeks to feel the difference and these might not be the right ones for you. Anti-depressants are all trial and error until you find the right fit for you, I went through 4 different meds and my most recent ones have only just hit on the magic dosage. For now focus on small victories, today I will: get out of bed before 9am, have a shower, eat something, spend time doing something I enjoy (watching videos or reading), achieve something towards my homework. Everything over and above that is a bonus. If you need someone to talk to who understands what you&amp;#39;re going through feel free to message me (27-f bipolar &amp;amp; major depression), I&amp;#39;m happy to listen to vents or offer advice on how to keep on keeping on&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_cvjsmce", "score_hidden": false, "permalink": "/r/depression/comments/3n0ngr/i_dont_even_know_please_read/cvjsmce/", "num_reports": null, "stickied": false, "created": 1443678069.0, "author_flair_text": null, "created_utc": 1443649269.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_3n0ngr", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cvjtadm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "AngeloMonharti", "can_mod_post": false, "send_replies": true, "parent_id": "t3_3n0ngr", "score": 1, "approved_by": null, "downs": 0, "body": "Its okay to feel like you don't have any goals, I've felt that way for a long time and still do. Something that helped me feel better about always doing nothing and never feeling motivated was going to the gym. I did it as just something to feel productive and its turned into something I hold on to dearly, I just set stupid meaningless gym goals and log everything i do and if nothing else I feel better looking at all the days Ive gone to the gym. It makes me feel like hey look I did something. It might be a guy thing but I go to my university gym and Id say the split is 60% guys 40% girls. If youre still in highschool things are probably not that easy, i hated highschool so much.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Its okay to feel like you don&amp;#39;t have any goals, I&amp;#39;ve felt that way for a long time and still do. Something that helped me feel better about always doing nothing and never feeling motivated was going to the gym. I did it as just something to feel productive and its turned into something I hold on to dearly, I just set stupid meaningless gym goals and log everything i do and if nothing else I feel better looking at all the days Ive gone to the gym. It makes me feel like hey look I did something. It might be a guy thing but I go to my university gym and Id say the split is 60% guys 40% girls. If youre still in highschool things are probably not that easy, i hated highschool so much.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_cvjtadm", "score_hidden": false, "permalink": "/r/depression/comments/3n0ngr/i_dont_even_know_please_read/cvjtadm/", "num_reports": null, "stickied": false, "created": 1443679119.0, "author_flair_text": null, "created_utc": 1443650319.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]