[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m (19F) doing Cognitive Processing Therapy right now and it&amp;#39;s making me more aware I suffered abuse earlier in my life than I thought. I can&amp;#39;t stop thinking about how my parents treatment towards me was abusive and how I&amp;#39;ve been molested by my family friends. I keep forgetting to bring it up with my therapist because I did mention possibly being abused by my dad when we first met, but we&amp;#39;re currently doing Cognitive Processing Therapy with my index trauma being sexually assaulted and abused by my ex so I guess that&amp;#39;s our first focus. But these things are still on my mind and I wanted to get it out there and get some affirmation that they did abuse me? I know these things are wrong but I still feel bad for feeling resentful and throwing myself a pity party.&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;Parents used fear to get me to do things right. Homework, for example. I remember I was terrified of the basement and they threatened to lock me in it if I didn&amp;#39;t finish my homework or if I did something wrong. There were instances in which they started to physically drag me towards the basement. &lt;/li&gt;\n&lt;li&gt;Calling me useless and a bitch (loose translations from the Chinese phrases, that&amp;#39;s how most people translate them and I don&amp;#39;t know how to convey them more accurately) &lt;/li&gt;\n&lt;li&gt;Dad would use me as a counselor basically? As early as 11 or 12 years old he would talk shit about my mom to me in car rides and told me he was only with her because of me and my siblings and he wanted to divorce her when we were out of college. Also used me to talk about my siblings&amp;#39; shortcomings (brother isn&amp;#39;t street-smart enough, sister is lazy or a baby) &lt;/li&gt;\n&lt;li&gt;Dad instilled in me that crying = weakness and I agreed so when I started having bouts of crying all the time in high school I felt like shit. &lt;/li&gt;\n&lt;li&gt;Whenever I didn&amp;#39;t want to go places, I still had to go because Dad &amp;quot;didn&amp;#39;t want to do some things but he has to and we all just have to do things we don&amp;#39;t want to do&amp;quot;. Mom said we had to go because she said so and &amp;quot;she&amp;#39;s the Mom&amp;quot;. &lt;/li&gt;\n&lt;li&gt;I recently started to challenge the way they speak to me and it&amp;#39;s been taken as disrespect, and I asked how I could be expected to treat them with respect when they&amp;#39;re going to call me names and yell at me all the time, and it&amp;#39;s because &amp;quot;they&amp;#39;re my parents&amp;quot;. I asked if I could treat people as indecently if I gave birth. Apparently I&amp;#39;ll &amp;quot;understand when I have kids&amp;quot;. &lt;/li&gt;\n&lt;li&gt;Dad thinks talking about kids&amp;#39; achievements is arrogant. So to counteract that, he&amp;#39;s &amp;quot;humble&amp;quot; about us. Basically he overshoots and says degrading things like &amp;quot;it&amp;#39;s not that special&amp;quot; or &amp;quot;she&amp;#39;s lucky&amp;quot;. I notice that their friends think he&amp;#39;s being harsh too. One time I tried to vouch for my brother&amp;#39;s hard work and I got lashed out at back at home for interrupting and being disrespectful. I really don&amp;#39;t think I was rude. I told him my dad he wasn&amp;#39;t being supportive and he said that he pays tuition and drives us places. I tried to make the point that emotional support is a thing too... And he broke my mirror out of anger. And then he punched the wall. &lt;/li&gt;\n&lt;li&gt;Mom yelled at us whenever we weren&amp;#39;t doing homework. Hobbies and extracurriculars were threatened to be taken away if our grades were bad. I remember being so scared that I got a B in 3rd grade, and I approached my parents and told them I was punishing myself for getting a B in 3rd grade. Now I&amp;#39;m stressed and not sleeping well in college because of my PTSD from being raped/abused by my ex-boyfriend. She has no concept of mental illness, she just thinks I&amp;#39;m stressed about school. She dares tell me to relax even though I&amp;#39;ve been groomed to think that I have to be studying every waking moment and I have to get straight As and go to medical school. &lt;/li&gt;\n&lt;li&gt;I was violated by multiple older male &amp;quot;cousins&amp;quot; (family friends) in my childhood. They range between 3 and 6 years older than me. One used to put my hand on his crotch when he was hard (I was probably around 9 years old, he was 14 or 15). He&amp;#39;d put my hand there and press it against his crotch. Another pulled the string on my swimsuit top two times when we were swimming (I held it up. Ages are foggy to me). Another literally tried to feel for my vagina through my pants in the basement of his house (I was in mid-late elementary school, he was in mid-late middle school).&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;I&amp;#39;m really messed up right now because I&amp;#39;m just resenting all these things that have happened in my personal life and I tell my suitemates glimpses of things that have happened to me (mostly the family stuff) and I know they have NO idea how to react and they just feel bad. My mind is going to explode and I&amp;#39;m supposed to be studying for an exam but these things are eating me up. &lt;/p&gt;\n\n&lt;p&gt;&lt;em&gt;TLDR: Therapy for sexual assault/abuse at the hands of my ex-boyfriend is making me aware of abuse and molestation that happened at earlier points in my life and I just keep thinking about it. I&amp;#39;m not super overwhelmed with emotions or anything. I just think about it a lot and think it&amp;#39;s really really messed up. I&amp;#39;m angry at my parents but also feel bad because I don&amp;#39;t like being angry at them? I just think of how bad they&amp;#39;d feel if they knew how much I hated what they did to me. (I think this is just another sign of manipulation because I&amp;#39;m not &amp;quot;supposed&amp;quot; to harbor negative feelings towards them since they&amp;#39;re my parents.) As for the molestation, I&amp;#39;m mostly in disbelief that it happened because those three guys are kind of normal now and are in long-term relationships with their girlfriends. It kind of uproots my image of them because I see them now and they&amp;#39;re all okay people.&lt;/em&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I'm (19F) doing Cognitive Processing Therapy right now and it's making me more aware I suffered abuse earlier in my life than I thought. I can't stop thinking about how my parents treatment towards me was abusive and how I've been molested by my family friends. I keep forgetting to bring it up with my therapist because I did mention possibly being abused by my dad when we first met, but we're currently doing Cognitive Processing Therapy with my index trauma being sexually assaulted and abused by my ex so I guess that's our first focus. But these things are still on my mind and I wanted to get it out there and get some affirmation that they did abuse me? I know these things are wrong but I still feel bad for feeling resentful and throwing myself a pity party.\n\n* Parents used fear to get me to do things right. Homework, for example. I remember I was terrified of the basement and they threatened to lock me in it if I didn't finish my homework or if I did something wrong. There were instances in which they started to physically drag me towards the basement. \n* Calling me useless and a bitch (loose translations from the Chinese phrases, that's how most people translate them and I don't know how to convey them more accurately) \n* Dad would use me as a counselor basically? As early as 11 or 12 years old he would talk shit about my mom to me in car rides and told me he was only with her because of me and my siblings and he wanted to divorce her when we were out of college. Also used me to talk about my siblings' shortcomings (brother isn't street-smart enough, sister is lazy or a baby) \n* Dad instilled in me that crying = weakness and I agreed so when I started having bouts of crying all the time in high school I felt like shit. \n* Whenever I didn't want to go places, I still had to go because Dad \"didn't want to do some things but he has to and we all just have to do things we don't want to do\". Mom said we had to go because she said so and \"she's the Mom\". \n* I recently started to challenge the way they speak to me and it's been taken as disrespect, and I asked how I could be expected to treat them with respect when they're going to call me names and yell at me all the time, and it's because \"they're my parents\". I asked if I could treat people as indecently if I gave birth. Apparently I'll \"understand when I have kids\". \n* Dad thinks talking about kids' achievements is arrogant. So to counteract that, he's \"humble\" about us. Basically he overshoots and says degrading things like \"it's not that special\" or \"she's lucky\". I notice that their friends think he's being harsh too. One time I tried to vouch for my brother's hard work and I got lashed out at back at home for interrupting and being disrespectful. I really don't think I was rude. I told him my dad he wasn't being supportive and he said that he pays tuition and drives us places. I tried to make the point that emotional support is a thing too... And he broke my mirror out of anger. And then he punched the wall. \n* Mom yelled at us whenever we weren't doing homework. Hobbies and extracurriculars were threatened to be taken away if our grades were bad. I remember being so scared that I got a B in 3rd grade, and I approached my parents and told them I was punishing myself for getting a B in 3rd grade. Now I'm stressed and not sleeping well in college because of my PTSD from being raped/abused by my ex-boyfriend. She has no concept of mental illness, she just thinks I'm stressed about school. She dares tell me to relax even though I've been groomed to think that I have to be studying every waking moment and I have to get straight As and go to medical school. \n* I was violated by multiple older male \"cousins\" (family friends) in my childhood. They range between 3 and 6 years older than me. One used to put my hand on his crotch when he was hard (I was probably around 9 years old, he was 14 or 15). He'd put my hand there and press it against his crotch. Another pulled the string on my swimsuit top two times when we were swimming (I held it up. Ages are foggy to me). Another literally tried to feel for my vagina through my pants in the basement of his house (I was in mid-late elementary school, he was in mid-late middle school).\n\n\nI'm really messed up right now because I'm just resenting all these things that have happened in my personal life and I tell my suitemates glimpses of things that have happened to me (mostly the family stuff) and I know they have NO idea how to react and they just feel bad. My mind is going to explode and I'm supposed to be studying for an exam but these things are eating me up. \n\n*TLDR: Therapy for sexual assault/abuse at the hands of my ex-boyfriend is making me aware of abuse and molestation that happened at earlier points in my life and I just keep thinking about it. I'm not super overwhelmed with emotions or anything. I just think about it a lot and think it's really really messed up. I'm angry at my parents but also feel bad because I don't like being angry at them? I just think of how bad they'd feel if they knew how much I hated what they did to me. (I think this is just another sign of manipulation because I'm not \"supposed\" to harbor negative feelings towards them since they're my parents.) As for the molestation, I'm mostly in disbelief that it happened because those three guys are kind of normal now and are in long-term relationships with their girlfriends. It kind of uproots my image of them because I see them now and they're all okay people.*\n", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "55k0qk", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "ariesaf", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 9, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 9, "thumbnail": "", "hide_score": false, "edited": 1475459776.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_55k0qk", "spoiler": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1475468156.0, "url": "https://www.reddit.com/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/", "author_flair_text": null, "quarantine": false, "title": "CPT has been making me more aware of other instances in my life when I was abused and molested.", "created_utc": 1475439356.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.86, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 9}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d9jq005", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NightOwl2687", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8c19ik", "score": 1, "approved_by": null, "downs": 0, "body": "The only thing besides saying to\n. . continue getting help\n. .being proactive about your thoughts (confronting your abusers)\n. . or finding a spiritual outlet (or metaphysical)\n\nis to get your sleep. It is more important than your studies. I find that I sleep a lot, whether I want to or not. The only time I wake up peacefully is if I'm exciting about something. It's taken me a long time to get to that. For me, it's video games. One step at a time.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only thing besides saying to\n. . continue getting help\n. .being proactive about your thoughts (confronting your abusers)\n. . or finding a spiritual outlet (or metaphysical)&lt;/p&gt;\n\n&lt;p&gt;is to get your sleep. It is more important than your studies. I find that I sleep a lot, whether I want to or not. The only time I wake up peacefully is if I&amp;#39;m exciting about something. It&amp;#39;s taken me a long time to get to that. For me, it&amp;#39;s video games. One step at a time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d9jq005", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d9jq005/", "num_reports": null, "stickied": false, "created": 1478191113.0, "author_flair_text": null, "created_utc": 1478162313.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d8c19ik", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ariesaf", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8bxifp", "score": 2, "approved_by": null, "downs": 0, "body": "That's the biggest problem I have. I can't focus on my studies. At all. This is consuming me. I don't actively think about it when I try to study, but I can't focus and my mind drifts off into just thinking about this stuff because I couldn't concentrate in the first place anyway. \"Reflecting\" on what happened keeps me up at night too. I'm laying in bed right now and my whole body hurts from being so poorly-rested so I want to go back to sleep, but I can't fall asleep because I feel guilty for not getting up to study for an exam I have today. And I'm not ready for this exam at all. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That&amp;#39;s the biggest problem I have. I can&amp;#39;t focus on my studies. At all. This is consuming me. I don&amp;#39;t actively think about it when I try to study, but I can&amp;#39;t focus and my mind drifts off into just thinking about this stuff because I couldn&amp;#39;t concentrate in the first place anyway. &amp;quot;Reflecting&amp;quot; on what happened keeps me up at night too. I&amp;#39;m laying in bed right now and my whole body hurts from being so poorly-rested so I want to go back to sleep, but I can&amp;#39;t fall asleep because I feel guilty for not getting up to study for an exam I have today. And I&amp;#39;m not ready for this exam at all. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8c19ik", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8c19ik/", "num_reports": null, "stickied": false, "created": 1475527883.0, "author_flair_text": null, "created_utc": 1475499083.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d8bxifp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NightOwl2687", "can_mod_post": false, "send_replies": true, "parent_id": "t3_55k0qk", "score": 1, "approved_by": null, "downs": 0, "body": "It can be good to vent, and it can help others relate to another person's experience.\n\nI see that these issues are consuming a lot of your time, especially since they are rich with memory. It reminds me of that Bjork quote, \"Neurosis only attaches itself to fertile ground where it can flourish.\" Kind of meaning your mind is vibrant, and it is going through these memories. Sexual experiences, sometimes good or bad, are a little bit more talked about. A lot seems to happen during childhood. I guess it can be confusing since we were still learning our vision of the world.\n\nRemember to balance this time with your studies. I would listen to music and study. I made sure I made time for both. I hope you start to feel better.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It can be good to vent, and it can help others relate to another person&amp;#39;s experience.&lt;/p&gt;\n\n&lt;p&gt;I see that these issues are consuming a lot of your time, especially since they are rich with memory. It reminds me of that Bjork quote, &amp;quot;Neurosis only attaches itself to fertile ground where it can flourish.&amp;quot; Kind of meaning your mind is vibrant, and it is going through these memories. Sexual experiences, sometimes good or bad, are a little bit more talked about. A lot seems to happen during childhood. I guess it can be confusing since we were still learning our vision of the world.&lt;/p&gt;\n\n&lt;p&gt;Remember to balance this time with your studies. I would listen to music and study. I made sure I made time for both. I hope you start to feel better.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8bxifp", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8bxifp/", "num_reports": null, "stickied": false, "created": 1475516905.0, "author_flair_text": null, "created_utc": 1475488105.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 8, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": false, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d8uhp4o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "mydaddyisadrunkass", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8uaxgd", "score": 1, "approved_by": null, "downs": 0, "body": "I am glad the email system helped! It's a bumpy road but totally worth the ride. \n\nThanks for the update! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I am glad the email system helped! It&amp;#39;s a bumpy road but totally worth the ride. &lt;/p&gt;\n\n&lt;p&gt;Thanks for the update! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8uhp4o", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8uhp4o/", "num_reports": null, "stickied": false, "created": 1476666835.0, "author_flair_text": null, "created_utc": 1476638035.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d8uaxgd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ariesaf", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8bdb2c", "score": 1, "approved_by": null, "downs": 0, "body": "We took a break from our routine CPT session and were able to talk about the things I sent in the email. Sorry it took so long to answer you, I'm struggling so much still. :\\ But thank you, I sent the e-mail because of your response", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We took a break from our routine CPT session and were able to talk about the things I sent in the email. Sorry it took so long to answer you, I&amp;#39;m struggling so much still. :\\ But thank you, I sent the e-mail because of your response&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8uaxgd", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8uaxgd/", "num_reports": null, "stickied": false, "created": 1476655829.0, "author_flair_text": null, "created_utc": 1476627029.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d8cv032", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "mydaddyisadrunkass", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8cs874", "score": 1, "approved_by": null, "downs": 0, "body": "Get in touch with the professor and ask for a make up. Flashbacks count as \"family emergency of a personal nature\". ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Get in touch with the professor and ask for a make up. Flashbacks count as &amp;quot;family emergency of a personal nature&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8cv032", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8cv032/", "num_reports": null, "stickied": false, "created": 1475568440.0, "author_flair_text": null, "created_utc": 1475539640.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d8cs874", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ariesaf", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8bdb2c", "score": 1, "approved_by": null, "downs": 0, "body": "I just sent an email to my therapist. It feels like therapy is happening inside a vacuum while my academics degrade outside of it. I skipped more classes today, including an exam. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I just sent an email to my therapist. It feels like therapy is happening inside a vacuum while my academics degrade outside of it. I skipped more classes today, including an exam. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8cs874", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8cs874/", "num_reports": null, "stickied": false, "created": 1475564227.0, "author_flair_text": null, "created_utc": 1475535427.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55k0qk", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d8bmwiw", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ladahmen", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d8bdb2c", "score": 3, "approved_by": null, "downs": 0, "body": "I agree with the email, especially since your therapist doesn't know.  If I realize something during therapy but it doesn't really hit me hard until I get home I usually will email my therapist too.  Good luck and keep going, you've got it", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with the email, especially since your therapist doesn&amp;#39;t know.  If I realize something during therapy but it doesn&amp;#39;t really hit me hard until I get home I usually will email my therapist too.  Good luck and keep going, you&amp;#39;ve got it&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8bmwiw", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8bmwiw/", "num_reports": null, "stickied": false, "created": 1475490823.0, "author_flair_text": null, "created_utc": 1475462023.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d8bdb2c", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "mydaddyisadrunkass", "can_mod_post": false, "send_replies": true, "parent_id": "t3_55k0qk", "score": 8, "approved_by": null, "downs": 0, "body": "Sometimes I send my therapist an email to share a new awareness or background into. He makes room for what I bring up and says it is helpful to him. The results have been good for me. \n\nWhen I started to see things clearly it was overwhelming at first. Just keep wading through it. You won't  regret the processing when you get to solid land again. \n\nYou got this. You are doing all the right things. Just keep carrying on. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sometimes I send my therapist an email to share a new awareness or background into. He makes room for what I bring up and says it is helpful to him. The results have been good for me. &lt;/p&gt;\n\n&lt;p&gt;When I started to see things clearly it was overwhelming at first. Just keep wading through it. You won&amp;#39;t  regret the processing when you get to solid land again. &lt;/p&gt;\n\n&lt;p&gt;You got this. You are doing all the right things. Just keep carrying on. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_d8bdb2c", "score_hidden": false, "permalink": "/r/ptsd/comments/55k0qk/cpt_has_been_making_me_more_aware_of_other/d8bdb2c/", "num_reports": null, "stickied": false, "created": 1475476290.0, "author_flair_text": null, "created_utc": 1475447490.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]