[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I try to make this as short as possible... I&amp;#39;m not suicidal right now, but I have absolutely no perspective as most of the time in my life. I&amp;#39;m a 25 year old male and I can&amp;#39;t get myself motivated for anything that would offer me some sort of &amp;quot;perspective&amp;quot; in life. It&amp;#39;s weird because I can be motivated to do certain things such as doing sports, enjoying the outdoors, socializing (although I live socially very isolated most of the time) but I can&amp;#39;t find any purpose or meaning in life. It&amp;#39;s so bad I can&amp;#39;t even get myself up to find work. I quit college 2 years ago without getting a degree because I felt it just sucks all life out of me. I hated the people there, I couldn&amp;#39;t care less about the material we learned (had decent grades though) etc. I looked for jobs for some time but gave up rather quickly when I realized I&amp;#39;m fucked on the job market anyways in my country (European Country). This is just notorious for my entire life or at least for the past 10 years. I just don&amp;#39;t have any motivation for anything. I did struggle with Major Depressive Disorder when I was around 15 (and I think this launched all these problems in the first place) and I&amp;#39;ve been chronically depressed ever since with ups and downs. My theory is that the antidepressants messed up my brain (probably dopamine related but I&amp;#39;m no Neuroscientist) at that point or the Ritalin I took for so called &amp;quot;ADHD&amp;quot; as a child did it but I guess we&amp;#39;ll never know.\nIt&amp;#39;s not that I&amp;#39;m not constantly depressed or unhappy, I do have periods of time where I can be quite active (doing tons of sports as an example) but in my mind life just has no meaning. Everything just passes by and is utterly meaningless. Sometimes I do have motivation that goes beyond just doing sports or whatever then I develop ideas how I could get myself out of that misery by starting a business as an example... But that usually quickly vanishes again because after a while I come to the same conclusion over and over again: Everything is absolutely meaningless. From this point on I usually try to push myself towards suicide (  the only problem being I just can&amp;#39;t do it because I know I do enjoy some things in life and if it&amp;#39;s just that one moment or whatever but I keep on trying to overcome this because I know it would be the best option rationally (or let&amp;#39;s say at least from my perspective..) Although if there was a accessible, reliable and peaceful method I would have been gone years ago. Just can&amp;#39;t bring myself to blow my brains out or hang myself as this seems to be too violent. My aggression is mostly towards the outside rather than the outside (aka I don&amp;#39;t want to butcher myself lol)\nI just don&amp;#39;t feel alive most of the time I don&amp;#39;t know how to describe it any better. The only time I feel alive is when I push my body or I&amp;#39;m in some kind of high adrenaline situation but I&amp;#39;m not good at any particular sport so I could not make a living off it... Also I&amp;#39;m a pack a day smoker so no chance I could develop any sort of top level athletics.\nFor years now I&amp;#39;ve been waiting for the &amp;quot;click&amp;quot; to happen... Something that brings some sort of meaning into life but it just doesn&amp;#39;t come. And sometimes I think I might have found it, two days later it just vanishes.&lt;/p&gt;\n\n&lt;p&gt;Any advice? \nBesides calling some useless hotline or seeing some shrink who tries to pump more chemicals into me that broke me in the first place Lol&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I try to make this as short as possible... I'm not suicidal right now, but I have absolutely no perspective as most of the time in my life. I'm a 25 year old male and I can't get myself motivated for anything that would offer me some sort of \"perspective\" in life. It's weird because I can be motivated to do certain things such as doing sports, enjoying the outdoors, socializing (although I live socially very isolated most of the time) but I can't find any purpose or meaning in life. It's so bad I can't even get myself up to find work. I quit college 2 years ago without getting a degree because I felt it just sucks all life out of me. I hated the people there, I couldn't care less about the material we learned (had decent grades though) etc. I looked for jobs for some time but gave up rather quickly when I realized I'm fucked on the job market anyways in my country (European Country). This is just notorious for my entire life or at least for the past 10 years. I just don't have any motivation for anything. I did struggle with Major Depressive Disorder when I was around 15 (and I think this launched all these problems in the first place) and I've been chronically depressed ever since with ups and downs. My theory is that the antidepressants messed up my brain (probably dopamine related but I'm no Neuroscientist) at that point or the Ritalin I took for so called \"ADHD\" as a child did it but I guess we'll never know.\nIt's not that I'm not constantly depressed or unhappy, I do have periods of time where I can be quite active (doing tons of sports as an example) but in my mind life just has no meaning. Everything just passes by and is utterly meaningless. Sometimes I do have motivation that goes beyond just doing sports or whatever then I develop ideas how I could get myself out of that misery by starting a business as an example... But that usually quickly vanishes again because after a while I come to the same conclusion over and over again: Everything is absolutely meaningless. From this point on I usually try to push myself towards suicide (  the only problem being I just can't do it because I know I do enjoy some things in life and if it's just that one moment or whatever but I keep on trying to overcome this because I know it would be the best option rationally (or let's say at least from my perspective..) Although if there was a accessible, reliable and peaceful method I would have been gone years ago. Just can't bring myself to blow my brains out or hang myself as this seems to be too violent. My aggression is mostly towards the outside rather than the outside (aka I don't want to butcher myself lol)\nI just don't feel alive most of the time I don't know how to describe it any better. The only time I feel alive is when I push my body or I'm in some kind of high adrenaline situation but I'm not good at any particular sport so I could not make a living off it... Also I'm a pack a day smoker so no chance I could develop any sort of top level athletics.\nFor years now I've been waiting for the \"click\" to happen... Something that brings some sort of meaning into life but it just doesn't come. And sometimes I think I might have found it, two days later it just vanishes.\n\nAny advice? \nBesides calling some useless hotline or seeing some shrink who tries to pump more chemicals into me that broke me in the first place Lol", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "6qsz6v", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "UncultivatedFox", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 22, "thumbnail": "", "hide_score": false, "edited": 1501551346.0, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83421, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_6qsz6v", "spoiler": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1501579368.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/6qsz6v/no_perspective/", "author_flair_text": null, "quarantine": false, "title": "No Perspective", "created_utc": 1501550568.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "dl4eq15", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dl4eix6", "score": 1, "approved_by": null, "downs": 0, "body": "But again these problems are not only work related it affects me almost in every stage of life. I have no friends, I have bad relations with my family (obviously they're pissed off I'm doing nothing) ,  I haven't had a girlfriend in 2 years even though I know for a fact I'm not unattractive and women are generally speaking interested in me but I just can't connect to anybody.  Also which woman in my age group wants to be with a bum basically? Even if you're attractive this is an absolute turnoff. \nI keep coming to the result that suicide would be the only rational solution but I just can't really pull through with it because I do like life as a general thing you know what I mean? I have a problem with society, not life in general and I don't think this is going to change anytime soon. I see how my parents have worked hard their entire life for nothing basically. Sure they have money but in my view for what price? To live in this shit society that is going to go down the next couple of decades anyways? Also makes me fucking angry at these babyboomers in general to be honest. But again I don't want to go too deep into politics. Anyways it's something that is bothering me so much it impacts my everyday life and there is no chance I can change anything on that situation. It is how it is, either I adapt or I go. ", "edited": 1501786833.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But again these problems are not only work related it affects me almost in every stage of life. I have no friends, I have bad relations with my family (obviously they&amp;#39;re pissed off I&amp;#39;m doing nothing) ,  I haven&amp;#39;t had a girlfriend in 2 years even though I know for a fact I&amp;#39;m not unattractive and women are generally speaking interested in me but I just can&amp;#39;t connect to anybody.  Also which woman in my age group wants to be with a bum basically? Even if you&amp;#39;re attractive this is an absolute turnoff. \nI keep coming to the result that suicide would be the only rational solution but I just can&amp;#39;t really pull through with it because I do like life as a general thing you know what I mean? I have a problem with society, not life in general and I don&amp;#39;t think this is going to change anytime soon. I see how my parents have worked hard their entire life for nothing basically. Sure they have money but in my view for what price? To live in this shit society that is going to go down the next couple of decades anyways? Also makes me fucking angry at these babyboomers in general to be honest. But again I don&amp;#39;t want to go too deep into politics. Anyways it&amp;#39;s something that is bothering me so much it impacts my everyday life and there is no chance I can change anything on that situation. It is how it is, either I adapt or I go. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dl4eq15", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dl4eq15/", "num_reports": null, "stickied": false, "created": 1501815238.0, "author_flair_text": null, "created_utc": 1501786438.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 9, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dl4eix6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkzu391", "score": 1, "approved_by": null, "downs": 0, "body": "It's complicated and many factors are invovled.  First of all as I said basically everything in society bores me to death this includes most types of work. Then I have a hard time socializing with coworkers usually. I mean I'm good at the whole superficial stuff and I think i can get people to like me but I feel empty and lonely all the time even if i have people around me because I just can't connect to them (not only in the workplace). Sooner or later this always leads to problems because faking it sucks energy out of me constantly. Then I also had some negative experience couple years back when I did a one year long internship. I got bullied and was only handed complete mundane tasks on purpose (yes I know internships always are mundane but this was extreme). And yes often many tasks lack intellectual stimulation for me but at the same time, due to my ADHD, I'm very disorganized and have a hard time with \"higher\" tasks (sorry English is not my native language).  \nAnd then there is another problem which I don't want to go into too much. It's a sensitive topic and about politics but to point you in the direction I basically hate this society for various reasons and I somehow don't even want to contribute anything... I find the whole west absolutely soul crushing at this point. I think society is heading in a complete wrong direction. I mean sure you could say what is it my problem but it bothers me for years now also contributes to that isolation feeling I have inside me. I just can't connect to \"regular\" people. I just don't know what to do and also it's hard to explain in details....", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;It&amp;#39;s complicated and many factors are invovled.  First of all as I said basically everything in society bores me to death this includes most types of work. Then I have a hard time socializing with coworkers usually. I mean I&amp;#39;m good at the whole superficial stuff and I think i can get people to like me but I feel empty and lonely all the time even if i have people around me because I just can&amp;#39;t connect to them (not only in the workplace). Sooner or later this always leads to problems because faking it sucks energy out of me constantly. Then I also had some negative experience couple years back when I did a one year long internship. I got bullied and was only handed complete mundane tasks on purpose (yes I know internships always are mundane but this was extreme). And yes often many tasks lack intellectual stimulation for me but at the same time, due to my ADHD, I&amp;#39;m very disorganized and have a hard time with &amp;quot;higher&amp;quot; tasks (sorry English is not my native language).&lt;br/&gt;\nAnd then there is another problem which I don&amp;#39;t want to go into too much. It&amp;#39;s a sensitive topic and about politics but to point you in the direction I basically hate this society for various reasons and I somehow don&amp;#39;t even want to contribute anything... I find the whole west absolutely soul crushing at this point. I think society is heading in a complete wrong direction. I mean sure you could say what is it my problem but it bothers me for years now also contributes to that isolation feeling I have inside me. I just can&amp;#39;t connect to &amp;quot;regular&amp;quot; people. I just don&amp;#39;t know what to do and also it&amp;#39;s hard to explain in details....&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dl4eix6", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dl4eix6/", "num_reports": null, "stickied": false, "created": 1501815040.0, "author_flair_text": null, "created_utc": 1501786240.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 8, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkzu391", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkztqsm", "score": 1, "approved_by": null, "downs": 0, "body": "I guess I'm sort of coming at it from an existentialist perspective, I.e., looking at \"the meaning of life\" as self-determined. So if you can find enjoyment in sports for instance why is something else needed? \nAs far as a job I'm wondering if what you found soul crushing was the lack of intellectual stimulation, just not your type of work, something else?", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I guess I&amp;#39;m sort of coming at it from an existentialist perspective, I.e., looking at &amp;quot;the meaning of life&amp;quot; as self-determined. So if you can find enjoyment in sports for instance why is something else needed? \nAs far as a job I&amp;#39;m wondering if what you found soul crushing was the lack of intellectual stimulation, just not your type of work, something else?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkzu391", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkzu391/", "num_reports": null, "stickied": false, "created": 1501582863.0, "author_flair_text": "", "created_utc": 1501554063.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 7, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkztqsm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkztiee", "score": 1, "approved_by": null, "downs": 0, "body": "If I could love anything for a reasonable amount of time I would give anything.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;If I could love anything for a reasonable amount of time I would give anything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkztqsm", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkztqsm/", "num_reports": null, "stickied": false, "created": 1501582406.0, "author_flair_text": null, "created_utc": 1501553606.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 6, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkztiee", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkztcc0", "score": 1, "approved_by": null, "downs": 0, "body": "Just theoretically if you could live without having to work, say traveling or whatever, would that be appealing? Or would having whatever job you wanted be appealing, helping others or doing something you love even if it made little money..?", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Just theoretically if you could live without having to work, say traveling or whatever, would that be appealing? Or would having whatever job you wanted be appealing, helping others or doing something you love even if it made little money..?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkztiee", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkztiee/", "num_reports": null, "stickied": false, "created": 1501582100.0, "author_flair_text": "", "created_utc": 1501553300.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkztcc0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkzt316", "score": 1, "approved_by": null, "downs": 0, "body": "See there is the choice between life and death. And I'm not capable of making that choice because I lack the energy. Seems to be an absolutely impossible task.  One day I'm like finally I have some motivation I'm going to change my life for the better the next day I'm like I should motivate myself to hang myself on the seiling. Neither of which has been successful so far. Sometimes I engage in risky behaviour like driving with my bycicle like a maniac because I think if a truck hits me the better for me Lol. I have certain Bipolar traits I guess question is how can I fix that...", "edited": 1501553266.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;See there is the choice between life and death. And I&amp;#39;m not capable of making that choice because I lack the energy. Seems to be an absolutely impossible task.  One day I&amp;#39;m like finally I have some motivation I&amp;#39;m going to change my life for the better the next day I&amp;#39;m like I should motivate myself to hang myself on the seiling. Neither of which has been successful so far. Sometimes I engage in risky behaviour like driving with my bycicle like a maniac because I think if a truck hits me the better for me Lol. I have certain Bipolar traits I guess question is how can I fix that...&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkztcc0", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkztcc0/", "num_reports": null, "stickied": false, "created": 1501581880.0, "author_flair_text": null, "created_utc": 1501553080.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkzt316", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkzsnt8", "score": 1, "approved_by": null, "downs": 0, "body": "Both of them. But foremost it's just about the realization that living your whole life in poverty and isolation is possible, but not enjoyable. But I don't know what is enjoyable...  Everytime I get myself motivated to play the game, the rat race I get fucking disgusted by it and I'm like do I really want to be part of this species/planet Lol don't know if that makes any sense. I have very conflicting emotions and needs sometimes.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Both of them. But foremost it&amp;#39;s just about the realization that living your whole life in poverty and isolation is possible, but not enjoyable. But I don&amp;#39;t know what is enjoyable...  Everytime I get myself motivated to play the game, the rat race I get fucking disgusted by it and I&amp;#39;m like do I really want to be part of this species/planet Lol don&amp;#39;t know if that makes any sense. I have very conflicting emotions and needs sometimes.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkzt316", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkzt316/", "num_reports": null, "stickied": false, "created": 1501581545.0, "author_flair_text": null, "created_utc": 1501552745.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkzsnt8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkzsdbw", "score": 1, "approved_by": null, "downs": 0, "body": "So the jump from the abstract world to the real world is caused by...well at this point it's caused by guilt toward being a burden on your parents? Or just the general social rule to go through the stages of life (go to school, then get a job, and so on) is that fair to say? Or is there other force? ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So the jump from the abstract world to the real world is caused by...well at this point it&amp;#39;s caused by guilt toward being a burden on your parents? Or just the general social rule to go through the stages of life (go to school, then get a job, and so on) is that fair to say? Or is there other force? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkzsnt8", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkzsnt8/", "num_reports": null, "stickied": false, "created": 1501581024.0, "author_flair_text": "", "created_utc": 1501552224.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkzsdbw", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dkzs500", "score": 1, "approved_by": null, "downs": 0, "body": "Well it's complicated. Obviously if you look at it in an abstract way I don't have any obligation to be motivated. In the real world it's not wise to live like this. I have to earn some money at some point, right now I'm sitting on my parents wallet like a parasite which isn't really fair to them either, they worked their asses off their whole life... and it bothers me. Sure I could sit on welfare or live under a bridge but then I might as well just shoot out my brains right now because it's an inevitable path of lifelong suffering living like this. I know what I'm talking about I lived like this for the past couple of years. Socially shunned, isolated etc. Sometimes I do not even care about these things but I can't overcome all human instincts. We're not meant to live like this. It's kind of paradox because obviously I'm not happy this way but I feel no matter what I try or do I will not be happy either way so I can't bring up that energy to change. I nowadays at least can bring up the energy just to survive in some ways (I became \"spiritual\" and stuff like that) but can't get any further than that.", "edited": 1501552327.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well it&amp;#39;s complicated. Obviously if you look at it in an abstract way I don&amp;#39;t have any obligation to be motivated. In the real world it&amp;#39;s not wise to live like this. I have to earn some money at some point, right now I&amp;#39;m sitting on my parents wallet like a parasite which isn&amp;#39;t really fair to them either, they worked their asses off their whole life... and it bothers me. Sure I could sit on welfare or live under a bridge but then I might as well just shoot out my brains right now because it&amp;#39;s an inevitable path of lifelong suffering living like this. I know what I&amp;#39;m talking about I lived like this for the past couple of years. Socially shunned, isolated etc. Sometimes I do not even care about these things but I can&amp;#39;t overcome all human instincts. We&amp;#39;re not meant to live like this. It&amp;#39;s kind of paradox because obviously I&amp;#39;m not happy this way but I feel no matter what I try or do I will not be happy either way so I can&amp;#39;t bring up that energy to change. I nowadays at least can bring up the energy just to survive in some ways (I became &amp;quot;spiritual&amp;quot; and stuff like that) but can&amp;#39;t get any further than that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkzsdbw", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkzsdbw/", "num_reports": null, "stickied": false, "created": 1501580670.0, "author_flair_text": null, "created_utc": 1501551870.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dkzs500", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t3_6qsz6v", "score": 1, "approved_by": null, "downs": 0, "body": "Hi\nI'm really curious what you mean when you use the word \"motivation\"--is that something that should be there...an obligation...? Where is the requirement that one be motivated coming from-- from yourself, others, culture, the rules of life?\n", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi\nI&amp;#39;m really curious what you mean when you use the word &amp;quot;motivation&amp;quot;--is that something that should be there...an obligation...? Where is the requirement that one be motivated coming from-- from yourself, others, culture, the rules of life?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dkzs500", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dkzs500/", "num_reports": null, "stickied": false, "created": 1501580385.0, "author_flair_text": "", "created_utc": 1501551585.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_6qsz6v", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "more", "data": {"count": 0, "name": "t1__", "id": "_", "parent_id": "t1_dlfsb6m", "depth": 10, "children": []}}], "before": null}}, "user_reports": [], "saved": false, "id": "dlfsb6m", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dleins7", "score": 1, "approved_by": null, "downs": 0, "body": "Yeah exactly the question is who decides. If the decision was mine I would go to sleep and just never wake up again becaus I feel I've seen everything I need to know in this world. I have no more ambition, I just want peace.\nIntellectual stimulation might be fun but I come to the same conclusion over and over again (I have to admit sometimes I come to slightly different, more \"positive\" conclusions) that I just don't care anymore. Like I said the only problem is that suicide scares me (because of the pain) and also is nasty and I don't see why I should deserve dying like a pig while there are tools out there that would be humane. Again in a purely capitalistic system I wouldn't have these problems, those are all problems caused by socialism....I don't hate myself or anything like that I just want out because I'm tired. I just don't want to die in terrible pain just because society thinks it's smart to prevent me from getting some barbiturates or at least a 12 gauge. This is another reason I'm angry at this system. No one fucking cares if someone dies but they have to make it a pain in the ass for you for some reason. Way to produce parasites and leeches. Maybe I should just sit on welfare and drain the system Lol\nIn this system the authorities always know better what's good for you instead of letting nature take it's run. Let the weak die who cares. Sorry for the rant I'm just fucking angry right now lol. Anger and hate the only thing that keeps me alive for a decade now btw haha", "edited": 1502390894.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah exactly the question is who decides. If the decision was mine I would go to sleep and just never wake up again becaus I feel I&amp;#39;ve seen everything I need to know in this world. I have no more ambition, I just want peace.\nIntellectual stimulation might be fun but I come to the same conclusion over and over again (I have to admit sometimes I come to slightly different, more &amp;quot;positive&amp;quot; conclusions) that I just don&amp;#39;t care anymore. Like I said the only problem is that suicide scares me (because of the pain) and also is nasty and I don&amp;#39;t see why I should deserve dying like a pig while there are tools out there that would be humane. Again in a purely capitalistic system I wouldn&amp;#39;t have these problems, those are all problems caused by socialism....I don&amp;#39;t hate myself or anything like that I just want out because I&amp;#39;m tired. I just don&amp;#39;t want to die in terrible pain just because society thinks it&amp;#39;s smart to prevent me from getting some barbiturates or at least a 12 gauge. This is another reason I&amp;#39;m angry at this system. No one fucking cares if someone dies but they have to make it a pain in the ass for you for some reason. Way to produce parasites and leeches. Maybe I should just sit on welfare and drain the system Lol\nIn this system the authorities always know better what&amp;#39;s good for you instead of letting nature take it&amp;#39;s run. Let the weak die who cares. Sorry for the rant I&amp;#39;m just fucking angry right now lol. Anger and hate the only thing that keeps me alive for a decade now btw haha&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dlfsb6m", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dlfsb6m/", "num_reports": null, "stickied": false, "created": 1502418985.0, "author_flair_text": null, "created_utc": 1502390185.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 9, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dleins7", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dle44pr", "score": 1, "approved_by": null, "downs": 0, "body": "You say \"philosophy is ultimately pointless.\" I think that's where we are seeing things differently. Who decides what is or is not pointless? Who decides what does it does not have meaning? Sure, you can say culture or capitalism, but those are broad answers that aren't always helpful in specific situations. \n\nIn a way, the discussion is connected to a \"theoretical\" vs \"real\" or \"practical\" debate. What is the value of theoretical vs real? And who decides? Speaking generally you could say money decides in a capitalist society, but that broad pronouncement isn't particularly helpful when addressing specific problems. \n\n\"The pure academic route would've taken too much time.\" I'm really curious what made you feel this way. How long is too long if it's doing something you love (or at least find intellectually stimulating)?  ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You say &amp;quot;philosophy is ultimately pointless.&amp;quot; I think that&amp;#39;s where we are seeing things differently. Who decides what is or is not pointless? Who decides what does it does not have meaning? Sure, you can say culture or capitalism, but those are broad answers that aren&amp;#39;t always helpful in specific situations. &lt;/p&gt;\n\n&lt;p&gt;In a way, the discussion is connected to a &amp;quot;theoretical&amp;quot; vs &amp;quot;real&amp;quot; or &amp;quot;practical&amp;quot; debate. What is the value of theoretical vs real? And who decides? Speaking generally you could say money decides in a capitalist society, but that broad pronouncement isn&amp;#39;t particularly helpful when addressing specific problems. &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The pure academic route would&amp;#39;ve taken too much time.&amp;quot; I&amp;#39;m really curious what made you feel this way. How long is too long if it&amp;#39;s doing something you love (or at least find intellectually stimulating)?  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dleins7", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dleins7/", "num_reports": null, "stickied": false, "created": 1502350156.0, "author_flair_text": "", "created_utc": 1502321356.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 8, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dle44pr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dldkkry", "score": 1, "approved_by": null, "downs": 0, "body": "Didn't read those books but it might be fitting. The only philosopher I ever actively read was Nietzsche haha. Anyways philosophy is ultimately pointless that's why I don't read it anymore. \nI dropped out of uni partially  exactly because of this feeling: I felt like I'm betraying myself sitting there among all these soulless people. I don't claim this to be the actual, objective situation but it was my impression. Also from a professional perspective I realized I chose the wrong degree. I'm interested in pure theoretical economics but I quickly realized that Business administration isn't going to fulfill that need. Problem is because I don't have the regular \"high school\" thingy (we have a very different system over here) I couldn't just switch to that major without going to school for another year. \nEven if I switched I never cared about the actual position in the workforce, managerial stuff doesn't interest me, so doesn't marketing or anything among those lines. I just liked the theoretical aspect of economics. The pure academia route would have taken away so much time I wasn't willing to give so I thought I'm just gonna drop out and look for some job but I couldn't find one and after couple of months I gave up....", "edited": 1502305525.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Didn&amp;#39;t read those books but it might be fitting. The only philosopher I ever actively read was Nietzsche haha. Anyways philosophy is ultimately pointless that&amp;#39;s why I don&amp;#39;t read it anymore. \nI dropped out of uni partially  exactly because of this feeling: I felt like I&amp;#39;m betraying myself sitting there among all these soulless people. I don&amp;#39;t claim this to be the actual, objective situation but it was my impression. Also from a professional perspective I realized I chose the wrong degree. I&amp;#39;m interested in pure theoretical economics but I quickly realized that Business administration isn&amp;#39;t going to fulfill that need. Problem is because I don&amp;#39;t have the regular &amp;quot;high school&amp;quot; thingy (we have a very different system over here) I couldn&amp;#39;t just switch to that major without going to school for another year. \nEven if I switched I never cared about the actual position in the workforce, managerial stuff doesn&amp;#39;t interest me, so doesn&amp;#39;t marketing or anything among those lines. I just liked the theoretical aspect of economics. The pure academia route would have taken away so much time I wasn&amp;#39;t willing to give so I thought I&amp;#39;m just gonna drop out and look for some job but I couldn&amp;#39;t find one and after couple of months I gave up....&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dle44pr", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dle44pr/", "num_reports": null, "stickied": false, "created": 1502334028.0, "author_flair_text": null, "created_utc": 1502305228.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 7, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dldkkry", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dld6g32", "score": 1, "approved_by": null, "downs": 0, "body": "Some of your statements remind me of Freud's book Civilization and its Discontents: \n\n\"A good part of the struggles of mankind centre round the single task of finding an expedient accommodation--one, that is, that will bring happiness--between this claim of the individual and the cultural claims of the group.\"\n\n\"The price we pay for our advance in civilization is a loss of happiness through the heightening of the sense of guilt...a dissatisfaction, for which people seek other motivations.\"\n\nI'm sorry I forgot-- what exactly made you leave university? Is it something you're against completely, or was it just the types of classes you here forced to take?", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Some of your statements remind me of Freud&amp;#39;s book Civilization and its Discontents: &lt;/p&gt;\n\n&lt;p&gt;&amp;quot;A good part of the struggles of mankind centre round the single task of finding an expedient accommodation--one, that is, that will bring happiness--between this claim of the individual and the cultural claims of the group.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;The price we pay for our advance in civilization is a loss of happiness through the heightening of the sense of guilt...a dissatisfaction, for which people seek other motivations.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m sorry I forgot-- what exactly made you leave university? Is it something you&amp;#39;re against completely, or was it just the types of classes you here forced to take?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dldkkry", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dldkkry/", "num_reports": null, "stickied": false, "created": 1502312982.0, "author_flair_text": "", "created_utc": 1502284182.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 6, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dld6g32", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dlasf6m", "score": 1, "approved_by": null, "downs": 0, "body": "I think depression is a natural reaction to surroundings. I don't see it as an illness anymore because I think the evidence is not really there. No one really understands how it works, they just noticed some chemicals supposedly linder symptoms in some people. Nowadays many of these studies get questioned. Many of these studies have been reviewed to my knowledge and the result is those antidepressants are not more effective than placebo in many cases. I myself tried many SSRIs and they fucked me up for good. I was off worse under treatment than without that's why I haven't touched anything of that stuff for years anymore. I used to go to therapy few months back and they tried to talk me into meds again. No chance I'm touching this kind of stuff.\nDepression is on the rise because unnatural lifestyles are on the rise. My point of view. I am aware that most won't agree with me.\n \nAlso the fact I had almost no symptoms of depression while i was on my 800 km hike for several weeks pretty much undermines my theory for me.\nProblem is I have no power to change my situation. I'm done on the job market no ones gonna hire me over here. I'm dependant on my parents and I dont' have a good relationship with them anymore. I can't move out of the country, I have no friends that could help me etc I'm completely stuck. Seems the only thing I have left is to swallow the bitter pill and end it.", "edited": 1502254368.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think depression is a natural reaction to surroundings. I don&amp;#39;t see it as an illness anymore because I think the evidence is not really there. No one really understands how it works, they just noticed some chemicals supposedly linder symptoms in some people. Nowadays many of these studies get questioned. Many of these studies have been reviewed to my knowledge and the result is those antidepressants are not more effective than placebo in many cases. I myself tried many SSRIs and they fucked me up for good. I was off worse under treatment than without that&amp;#39;s why I haven&amp;#39;t touched anything of that stuff for years anymore. I used to go to therapy few months back and they tried to talk me into meds again. No chance I&amp;#39;m touching this kind of stuff.\nDepression is on the rise because unnatural lifestyles are on the rise. My point of view. I am aware that most won&amp;#39;t agree with me.&lt;/p&gt;\n\n&lt;p&gt;Also the fact I had almost no symptoms of depression while i was on my 800 km hike for several weeks pretty much undermines my theory for me.\nProblem is I have no power to change my situation. I&amp;#39;m done on the job market no ones gonna hire me over here. I&amp;#39;m dependant on my parents and I dont&amp;#39; have a good relationship with them anymore. I can&amp;#39;t move out of the country, I have no friends that could help me etc I&amp;#39;m completely stuck. Seems the only thing I have left is to swallow the bitter pill and end it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dld6g32", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dld6g32/", "num_reports": null, "stickied": false, "created": 1502282936.0, "author_flair_text": null, "created_utc": 1502254136.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dlasf6m", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dl9o9vd", "score": 1, "approved_by": null, "downs": 0, "body": "What are your thoughts on depression? just wondering generally how you feel about treating depression. Have you ever tried any sort of treatment? I would say I disagree with your statement \"I don't know if it's a good thing if weak like myself are alive.\" Maybe you are not \"fit\" for capitalism but so what? The relationship between evolution and depression is not completely understood. I was a depressed person for a very long time.", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;What are your thoughts on depression? just wondering generally how you feel about treating depression. Have you ever tried any sort of treatment? I would say I disagree with your statement &amp;quot;I don&amp;#39;t know if it&amp;#39;s a good thing if weak like myself are alive.&amp;quot; Maybe you are not &amp;quot;fit&amp;quot; for capitalism but so what? The relationship between evolution and depression is not completely understood. I was a depressed person for a very long time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dlasf6m", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dlasf6m/", "num_reports": null, "stickied": false, "created": 1502166607.0, "author_flair_text": "", "created_utc": 1502137807.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dl9o9vd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dl73wma", "score": 1, "approved_by": null, "downs": 0, "body": "Well as I said I don't want to get too deep into a political discussion. Just as a side note my problem is not capitalism per se as someone who studied economics I think it's not perfect but better than many alternatives. Anyways let's put politics aside...\n\nIt's more about how we live in the modern world that is my problem. There is no meaning everything is just well ordered, civilized etc. It's boring to death. Pure capitalism btw provides more personal freedom than the system we have nowadays (which isn't capitalism in my estimation) in the Western world. \nThe example you gave with the doctor: Sure he helps some kids but we're massively overpopulated anyways what does it change if those kids die or live (i don't wanna sound like massive asshole and if a kid died in front of me it would touch me a lot emotionally). If you really want to hear my honest opinion on modern medicine; I think it's a bad thing in the long run. More suffering overall emerges from it because people get too old, the world gets overpopulated and \"bad\" genes can spread and survive. As someone who has dealt with mental issues I don't know if it's a good thing if weak like myself are alive.\n\nIt's so tough to describe but I think what i said before goes into that direction. Everything is civilized, everything has been discovered, people all live the same lives in a sense, no one can really venture out and experience something different, no one dares to ask too many questions... I don't know can't put it into words any better. I'd say civilization itself is my main problem. Everything just absolutely bores me for over a decade now.\nI imagine how times were different when modern civilization didn't exist. Where humans could just live and struggle in nature, venture out and discover new things. As I said the only time i feel alive is when i'm in some adrenaline rush either from sports or from dangerous situations. A month ago I did 800 km by foot across Spain, i never felt so alive ever. Unfortunately as I'm basically a bum financially I can't afford these things and as soon as I returned to my country my whole mental state collapsed again. I'm back into depressions, half suicidal, full of anger etc.. But society wants me to believe I'm spoiled and i live a happy life because I live in some overpriced country where people only care about materialism. Yeah happiness my ass.. On top of that you obviously have the societal pressure because you're a dissident and people let you feel it. They are scared of people who revolt against their little bubble. Which doesn't make me want to corporate it makes me want to resist even more because I feel I have nothing in common with \"regular\" people. It's a vicious circle. My character doesn't allow me to play these games for some reason, I have been like that since I was a little kid. But my rational mind knows I'm kind of hurting myself.", "edited": 1502077899.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well as I said I don&amp;#39;t want to get too deep into a political discussion. Just as a side note my problem is not capitalism per se as someone who studied economics I think it&amp;#39;s not perfect but better than many alternatives. Anyways let&amp;#39;s put politics aside...&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s more about how we live in the modern world that is my problem. There is no meaning everything is just well ordered, civilized etc. It&amp;#39;s boring to death. Pure capitalism btw provides more personal freedom than the system we have nowadays (which isn&amp;#39;t capitalism in my estimation) in the Western world. \nThe example you gave with the doctor: Sure he helps some kids but we&amp;#39;re massively overpopulated anyways what does it change if those kids die or live (i don&amp;#39;t wanna sound like massive asshole and if a kid died in front of me it would touch me a lot emotionally). If you really want to hear my honest opinion on modern medicine; I think it&amp;#39;s a bad thing in the long run. More suffering overall emerges from it because people get too old, the world gets overpopulated and &amp;quot;bad&amp;quot; genes can spread and survive. As someone who has dealt with mental issues I don&amp;#39;t know if it&amp;#39;s a good thing if weak like myself are alive.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s so tough to describe but I think what i said before goes into that direction. Everything is civilized, everything has been discovered, people all live the same lives in a sense, no one can really venture out and experience something different, no one dares to ask too many questions... I don&amp;#39;t know can&amp;#39;t put it into words any better. I&amp;#39;d say civilization itself is my main problem. Everything just absolutely bores me for over a decade now.\nI imagine how times were different when modern civilization didn&amp;#39;t exist. Where humans could just live and struggle in nature, venture out and discover new things. As I said the only time i feel alive is when i&amp;#39;m in some adrenaline rush either from sports or from dangerous situations. A month ago I did 800 km by foot across Spain, i never felt so alive ever. Unfortunately as I&amp;#39;m basically a bum financially I can&amp;#39;t afford these things and as soon as I returned to my country my whole mental state collapsed again. I&amp;#39;m back into depressions, half suicidal, full of anger etc.. But society wants me to believe I&amp;#39;m spoiled and i live a happy life because I live in some overpriced country where people only care about materialism. Yeah happiness my ass.. On top of that you obviously have the societal pressure because you&amp;#39;re a dissident and people let you feel it. They are scared of people who revolt against their little bubble. Which doesn&amp;#39;t make me want to corporate it makes me want to resist even more because I feel I have nothing in common with &amp;quot;regular&amp;quot; people. It&amp;#39;s a vicious circle. My character doesn&amp;#39;t allow me to play these games for some reason, I have been like that since I was a little kid. But my rational mind knows I&amp;#39;m kind of hurting myself.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dl9o9vd", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dl9o9vd/", "num_reports": null, "stickied": false, "created": 1502105776.0, "author_flair_text": null, "created_utc": 1502076976.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dl73wma", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dl6fdcx", "score": 1, "approved_by": null, "downs": 0, "body": "when you say \"all that matters in life seems to be money and then you die\" where does that definition come from? So for example if you work as a doctor for free and help someone--are you saying because it's capitalism it doesn't matter? So is the problem capitalism? \nAlso I'm just wondering if you've  read Camus or Celine? I ask because they have explored some of these ideas I depth. \nMy reaction when you say \"all that matters is life\" is a definition you feel that is imposed on life by society. Is that unfair to say?", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;when you say &amp;quot;all that matters in life seems to be money and then you die&amp;quot; where does that definition come from? So for example if you work as a doctor for free and help someone--are you saying because it&amp;#39;s capitalism it doesn&amp;#39;t matter? So is the problem capitalism? \nAlso I&amp;#39;m just wondering if you&amp;#39;ve  read Camus or Celine? I ask because they have explored some of these ideas I depth. \nMy reaction when you say &amp;quot;all that matters is life&amp;quot; is a definition you feel that is imposed on life by society. Is that unfair to say?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dl73wma", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dl73wma/", "num_reports": null, "stickied": false, "created": 1501958293.0, "author_flair_text": "", "created_utc": 1501929493.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dl6fdcx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "UncultivatedFox", "can_mod_post": false, "send_replies": true, "parent_id": "t1_dl4srx9", "score": 1, "approved_by": null, "downs": 0, "body": "Again it's hard to describe. Feeling alienated probably is the best description. I have no clue what I should be doing with my life at all and everything seems completely pointless. All that matters in life seems to be money and then you die. Just doesn't motivate me at all could just as well kill myself right now. I mean what impact do people have on the world nowadays? They go to some shitty job (even if it's a \"good\" job) get paid, waste the money on some bullshit don't care about anything else and die at some point. It's just completely parasitic there is no meaning to modern life. It seems completely degenerate to me and I can't cope with it. I can't tell you much more... As I said no one understands it for some reason that's also why i constantly feel alienated because no one shares these views.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Again it&amp;#39;s hard to describe. Feeling alienated probably is the best description. I have no clue what I should be doing with my life at all and everything seems completely pointless. All that matters in life seems to be money and then you die. Just doesn&amp;#39;t motivate me at all could just as well kill myself right now. I mean what impact do people have on the world nowadays? They go to some shitty job (even if it&amp;#39;s a &amp;quot;good&amp;quot; job) get paid, waste the money on some bullshit don&amp;#39;t care about anything else and die at some point. It&amp;#39;s just completely parasitic there is no meaning to modern life. It seems completely degenerate to me and I can&amp;#39;t cope with it. I can&amp;#39;t tell you much more... As I said no one understands it for some reason that&amp;#39;s also why i constantly feel alienated because no one shares these views.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dl6fdcx", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dl6fdcx/", "num_reports": null, "stickied": false, "created": 1501912851.0, "author_flair_text": null, "created_utc": 1501884051.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "dl4srx9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "i_am_not_a_liar", "can_mod_post": false, "send_replies": true, "parent_id": "t3_6qsz6v", "score": 1, "approved_by": null, "downs": 0, "body": "So when you say \"no perspective,\" is that a reference to some sort of \"big picture\" view--the world (people in rural China, for instance), time (yourself fifty years from now)--something else? \nIt sounds like you are saying that there is some other perspective you feel like you should be having? \n\nAlso, I was just wondering have you ever had a really good friend who is able to challenge you? ", "edited": false, "author_flair_css_class": "modmsg", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;So when you say &amp;quot;no perspective,&amp;quot; is that a reference to some sort of &amp;quot;big picture&amp;quot; view--the world (people in rural China, for instance), time (yourself fifty years from now)--something else? \nIt sounds like you are saying that there is some other perspective you feel like you should be having? &lt;/p&gt;\n\n&lt;p&gt;Also, I was just wondering have you ever had a really good friend who is able to challenge you? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_dl4srx9", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/6qsz6v/no_perspective/dl4srx9/", "num_reports": null, "stickied": false, "created": 1501829900.0, "author_flair_text": "", "created_utc": 1501801100.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]