[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2w2s8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There are a lot of marijuana dispensaries popping up in Toronto, and &lt;a href=\"http://www.thestar.com/news/city_hall/2016/04/30/medical-pot-shops-in-toronto-face-possible-crackdown.html\"&gt;they are at risk of a possible crackdown since none of them are legal&lt;/a&gt;.  &lt;a href=\"http://www.hc-sc.gc.ca/dhp-mps/marihuana/law-loi/index-eng.php\"&gt;There are licensed medical marijuana producers&lt;/a&gt; and a strict method of procuring marijuana for medical purposes, but store fronts are currently illegal. Canada is in the process of legalizing marijuana use completely, and possibly within the next few years.&lt;/p&gt;\n\n&lt;p&gt;The common arguments I see against a crackdown would are:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;It will turn users back to dealers&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Pot will be legal within a few years anyways, police are just ruining lives as medical marijuana is harmless. Police shouldn&amp;#39;t enforce wrong laws.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;On the other hand I currently think:&lt;/p&gt;\n\n&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;Aren&amp;#39;t store fronts just dealers who bought themselves retail space?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;It is currently illegal, the police should enforce the law, and the retail spaces could wait until regulations are put into place to operate legally. The current operating practices of these places are completely unregulated. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;In Ontario it was previously only possible to obtain alcohol (wine, beer, etc) from the LCBO or Beer Store, but there was news that select grocery stores may be able to start selling beer (this is now true). Other places such as the USA have shown that it isn&amp;#39;t total anarchy to have stores such as Walmart selling alcohol, so it would be harmless to have grocery stores in Ontario selling some beer. In news of this incoming regulation change, I wouldn&amp;#39;t accept &amp;quot;but it&amp;#39;s going to be legal soon and harmless&amp;quot; as a reason why police shouldn&amp;#39;t be cracking down on any corner or grocery stores deciding to sell beer or wine before the regulations have been decided and put into effect. &lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;For medical marijuana, there are current Government of Canada licensed producers with strict standards of quality as well as methods of distribution. It&amp;#39;s regulated. The store fronts are all currently illegal, and run by their own individual standards. There&amp;#39;s no way to know who their clientele is, or what their policies and operating practices actually are. Quite simply, zero regulation. Some of the concerns are addressed in the article linked above.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;Marijuana store-fronts should only operate once there is regulation from the government in place. Currently they are illegal, and the police would be right to crackdown on dispensaries. CMV&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There are a lot of marijuana dispensaries popping up in Toronto, and [they are at risk of a possible crackdown since none of them are legal](http://www.thestar.com/news/city_hall/2016/04/30/medical-pot-shops-in-toronto-face-possible-crackdown.html).  [There are licensed medical marijuana producers](http://www.hc-sc.gc.ca/dhp-mps/marihuana/law-loi/index-eng.php) and a strict method of procuring marijuana for medical purposes, but store fronts are currently illegal. Canada is in the process of legalizing marijuana use completely, and possibly within the next few years.\n\nThe common arguments I see against a crackdown would are:\n\n* It will turn users back to dealers\n\n* Pot will be legal within a few years anyways, police are just ruining lives as medical marijuana is harmless. Police shouldn't enforce wrong laws.\n\nOn the other hand I currently think:\n\n* Aren't store fronts just dealers who bought themselves retail space?\n\n* It is currently illegal, the police should enforce the law, and the retail spaces could wait until regulations are put into place to operate legally. The current operating practices of these places are completely unregulated. \n\n* In Ontario it was previously only possible to obtain alcohol (wine, beer, etc) from the LCBO or Beer Store, but there was news that select grocery stores may be able to start selling beer (this is now true). Other places such as the USA have shown that it isn't total anarchy to have stores such as Walmart selling alcohol, so it would be harmless to have grocery stores in Ontario selling some beer. In news of this incoming regulation change, I wouldn't accept \"but it's going to be legal soon and harmless\" as a reason why police shouldn't be cracking down on any corner or grocery stores deciding to sell beer or wine before the regulations have been decided and put into effect. \n\n* For medical marijuana, there are current Government of Canada licensed producers with strict standards of quality as well as methods of distribution. It's regulated. The store fronts are all currently illegal, and run by their own individual standards. There's no way to know who their clientele is, or what their policies and operating practices actually are. Quite simply, zero regulation. Some of the concerns are addressed in the article linked above.\n\nMarijuana store-fronts should only operate once there is regulation from the government in place. Currently they are illegal, and the police would be right to crackdown on dispensaries. CMV", "likes": null, "suggested_sort": "qa", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4h6u4l", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "hitorontothread", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 6, "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "num_comments": 7, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 539231, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_4h6u4l", "spoiler": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1462089194.0, "url": "https://www.reddit.com/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/", "author_flair_text": null, "quarantine": false, "title": "CMV: Police would be right to crackdown on Toronto Marijuana Dispensaries", "created_utc": 1462060394.0, "subreddit_name_prefixed": "r/changemyview", "distinguished": null, "media": null, "upvote_ratio": 0.75, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 6}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6u4l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6u4l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6u4l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6u4l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2o8rf2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hitorontothread", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o7fil", "score": 0, "approved_by": null, "downs": 0, "body": "Marijuana in Colorado has regulations put in place. It is lawful within Colorado. Now if a business in Minnesota were to open up a place, I think police would be right to crackdown on it. The Minnesota dispensary is following what rules for production and distribution, who would verify, and verify according to what standards?\n\nI think this gets to the root of my main concern with dispensaries opening while the law has not yet legalized and regulated them in Toronto. If you can show some sort of standards they adhere too, that their operating practices are safe and reasonable, I'd be glad to change my view. You could show me that the industry has its own internal regulations like the porn industry does with mandatory STD blood tests in order to perform. What reasons should police turn a blind eye to medical marijuana dispensaries in Toronto? Like in Colorado you have to be 21 or older to purchase, and if a dispensary sells to someone under they would be held accountable. The dispensaries contribute sales taxes. What rules are the Toronto dispensaries playing by? What's the minimum age they'll sell to. How much/ what can they sell? Are they charging taxes on the purchases and contributing to the City of Toronto? \n\nIn terms of police only investigating if they get a complaint, what would they even count as a \"this is a good place, let's not close it\" vs a \"this really is a bad dispensary, we should close it down\"? If someone complains, \"they're selling to people who are underage\", \"this weed is terrible quality\", etc. what are the police's guidelines?\n\nWe've been debating a lot about the virtues of selective enforcement and whether the police should have the power to selectively enforce in general which I don't think will CMV. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Marijuana in Colorado has regulations put in place. It is lawful within Colorado. Now if a business in Minnesota were to open up a place, I think police would be right to crackdown on it. The Minnesota dispensary is following what rules for production and distribution, who would verify, and verify according to what standards?&lt;/p&gt;\n\n&lt;p&gt;I think this gets to the root of my main concern with dispensaries opening while the law has not yet legalized and regulated them in Toronto. If you can show some sort of standards they adhere too, that their operating practices are safe and reasonable, I&amp;#39;d be glad to change my view. You could show me that the industry has its own internal regulations like the porn industry does with mandatory STD blood tests in order to perform. What reasons should police turn a blind eye to medical marijuana dispensaries in Toronto? Like in Colorado you have to be 21 or older to purchase, and if a dispensary sells to someone under they would be held accountable. The dispensaries contribute sales taxes. What rules are the Toronto dispensaries playing by? What&amp;#39;s the minimum age they&amp;#39;ll sell to. How much/ what can they sell? Are they charging taxes on the purchases and contributing to the City of Toronto? &lt;/p&gt;\n\n&lt;p&gt;In terms of police only investigating if they get a complaint, what would they even count as a &amp;quot;this is a good place, let&amp;#39;s not close it&amp;quot; vs a &amp;quot;this really is a bad dispensary, we should close it down&amp;quot;? If someone complains, &amp;quot;they&amp;#39;re selling to people who are underage&amp;quot;, &amp;quot;this weed is terrible quality&amp;quot;, etc. what are the police&amp;#39;s guidelines?&lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve been debating a lot about the virtues of selective enforcement and whether the police should have the power to selectively enforce in general which I don&amp;#39;t think will CMV. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o8rf2", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/d2o8rf2/", "num_reports": null, "stickied": false, "created": 1462120086.0, "author_flair_text": null, "created_utc": 1462091286.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o7fil", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "RAGING_VEGETARIAN", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o2qeq", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; For point 1 and 2 (and even 3) you seem to be arguing for selective enforcement.\n\nYes, for one thing because the CMV *very literally* requires me to.\n\nAnd yes, I think the police should have a level of discretion when enforcing laws.  I think that if somebody has a burnt-out taillight, an officer should be allowed to give them a warning instead of a citation.  And I think that when a community recognizes a law to be outdated, such as when we realize that marijuana shouldn't be illegal, the police should ease up on enforcing that law.\n\nIn the United States, marijuana is illegal on the federal level.  State law permits marijuana in Colorado and Oregon, in direct violation of the supreme federal law of the land.  Should the feds be cracking down on dispensaries in Colorado?  or should they monitor Colorado, understand the stats, and use the information to design updated legislation?\n\n&gt;And it is an expectation of mine at the very least for the police to be capable of enforcing laws. Especially with the Toronto police budget.\n\nThat's true, but they've been [failing to solve murders.](http://www.thestar.com/news/crime/2011/01/01/toronto_police_struggling_to_solve_murders.html)  I'd rather they improve their enforcement of murder law than their enforcement of weed law.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For point 1 and 2 (and even 3) you seem to be arguing for selective enforcement.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes, for one thing because the CMV &lt;em&gt;very literally&lt;/em&gt; requires me to.&lt;/p&gt;\n\n&lt;p&gt;And yes, I think the police should have a level of discretion when enforcing laws.  I think that if somebody has a burnt-out taillight, an officer should be allowed to give them a warning instead of a citation.  And I think that when a community recognizes a law to be outdated, such as when we realize that marijuana shouldn&amp;#39;t be illegal, the police should ease up on enforcing that law.&lt;/p&gt;\n\n&lt;p&gt;In the United States, marijuana is illegal on the federal level.  State law permits marijuana in Colorado and Oregon, in direct violation of the supreme federal law of the land.  Should the feds be cracking down on dispensaries in Colorado?  or should they monitor Colorado, understand the stats, and use the information to design updated legislation?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And it is an expectation of mine at the very least for the police to be capable of enforcing laws. Especially with the Toronto police budget.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s true, but they&amp;#39;ve been &lt;a href=\"http://www.thestar.com/news/crime/2011/01/01/toronto_police_struggling_to_solve_murders.html\"&gt;failing to solve murders.&lt;/a&gt;  I&amp;#39;d rather they improve their enforcement of murder law than their enforcement of weed law.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o7fil", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/d2o7fil/", "num_reports": null, "stickied": false, "created": 1462115189.0, "author_flair_text": "11∆", "created_utc": 1462086389.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o2qeq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hitorontothread", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nwxxh", "score": 1, "approved_by": null, "downs": 0, "body": "For point 1 and 2 (and even 3) you seem to be arguing for selective enforcement. Especially in point 1, police should ignore law breaking unless another person complains? To go to my liquor example, if a small grocery store without a license were to be selling alcohol (let's say they collect sales tax but write it as soda or juice blend in receipts), should the police ignore them?\n\nAnd the problem with point 1 in terms of marijuana dispensaries acting as medical marijuana dispensaries currently is that there really is no validation of the clientele by any means. For medical marijuana, there seems to be no consistent practice from dispensary to dispensary. From one Toronto thread on this topic, a person simply walks in saying they have headaches, see a naturopath, and bam medical marijuana user at an illegal establishment. There's no way to verify that they're not selling to minors, are they collecting proper sale tax?, etc. The option of getting marijuana from licensed marijuana producers and distributors is available for those who need it and there are standards and regulations. At this point marijuana dispensaries are completely unregulated. \n\nAnd it is an expectation of mine at the very least for the police to be capable of enforcing laws. Especially with the Toronto police budget. \n\n\nIn terms of totalitarian power to the police, wouldn't selective enforcement of laws be a disrespect to the process of getting laws passed and enacted, and actually giving such totalitarian powers to them? Regardless of what your elected government has gone through the process of passing, on police discretion laws can be ignored or enforced at will\n\n", "edited": 1462074300.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;For point 1 and 2 (and even 3) you seem to be arguing for selective enforcement. Especially in point 1, police should ignore law breaking unless another person complains? To go to my liquor example, if a small grocery store without a license were to be selling alcohol (let&amp;#39;s say they collect sales tax but write it as soda or juice blend in receipts), should the police ignore them?&lt;/p&gt;\n\n&lt;p&gt;And the problem with point 1 in terms of marijuana dispensaries acting as medical marijuana dispensaries currently is that there really is no validation of the clientele by any means. For medical marijuana, there seems to be no consistent practice from dispensary to dispensary. From one Toronto thread on this topic, a person simply walks in saying they have headaches, see a naturopath, and bam medical marijuana user at an illegal establishment. There&amp;#39;s no way to verify that they&amp;#39;re not selling to minors, are they collecting proper sale tax?, etc. The option of getting marijuana from licensed marijuana producers and distributors is available for those who need it and there are standards and regulations. At this point marijuana dispensaries are completely unregulated. &lt;/p&gt;\n\n&lt;p&gt;And it is an expectation of mine at the very least for the police to be capable of enforcing laws. Especially with the Toronto police budget. &lt;/p&gt;\n\n&lt;p&gt;In terms of totalitarian power to the police, wouldn&amp;#39;t selective enforcement of laws be a disrespect to the process of getting laws passed and enacted, and actually giving such totalitarian powers to them? Regardless of what your elected government has gone through the process of passing, on police discretion laws can be ignored or enforced at will&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o2qeq", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/d2o2qeq/", "num_reports": null, "stickied": false, "created": 1462102831.0, "author_flair_text": null, "created_utc": 1462074031.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "more", "data": {"count": 1, "name": "t1_d2o1m5w", "id": "d2o1m5w", "parent_id": "t1_d2nwxxh", "depth": 1, "children": ["d2o1m5w"]}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nwxxh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "RAGING_VEGETARIAN", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6u4l", "score": 1, "approved_by": null, "downs": 0, "body": "* The unlicensed storefronts don't have regulations yet, but neither do traditional dealers.  It's better for people selling unregulated drugs to be out in the open than it is for them to be secretive.  Sellers whose activities are visible to the police know that they have to be careful and not poison or rip off their customers, since they are working on borrowed time and can be shut down, fined, or jailed in an instant if somebody complains to the cops.  People who buy drugs secretively from strangers who are chronically hiding from the cops have little legal recourse if they are hurt or scammed.\n\n* Law enforcement agencies don't have the resources to \"crack down\" on every crime, everywhere, all the time.  Like every other group, they have to set priorities.  Should the Toronto police divert detectives away from a rape case in order to shut down a dispensary that isn't hurting anyone?\n\n* Relationships between police and the general public are fragile.  In a civilized society, it's important for people to trust the police.  When a crime is committed, we depend on affected individuals to report the crime to the police and cooperate with them.  When the police punish people for actions that most people don't perceive as serious crimes, such as selling/smoking weed, that relationship is damaged.  Police are no longer perceived as allies of the people, working for a peaceful community, and are instead seen as totalitarians who jail and fine on a power trip.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;ul&gt;\n&lt;li&gt;&lt;p&gt;The unlicensed storefronts don&amp;#39;t have regulations yet, but neither do traditional dealers.  It&amp;#39;s better for people selling unregulated drugs to be out in the open than it is for them to be secretive.  Sellers whose activities are visible to the police know that they have to be careful and not poison or rip off their customers, since they are working on borrowed time and can be shut down, fined, or jailed in an instant if somebody complains to the cops.  People who buy drugs secretively from strangers who are chronically hiding from the cops have little legal recourse if they are hurt or scammed.&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Law enforcement agencies don&amp;#39;t have the resources to &amp;quot;crack down&amp;quot; on every crime, everywhere, all the time.  Like every other group, they have to set priorities.  Should the Toronto police divert detectives away from a rape case in order to shut down a dispensary that isn&amp;#39;t hurting anyone?&lt;/p&gt;&lt;/li&gt;\n&lt;li&gt;&lt;p&gt;Relationships between police and the general public are fragile.  In a civilized society, it&amp;#39;s important for people to trust the police.  When a crime is committed, we depend on affected individuals to report the crime to the police and cooperate with them.  When the police punish people for actions that most people don&amp;#39;t perceive as serious crimes, such as selling/smoking weed, that relationship is damaged.  Police are no longer perceived as allies of the people, working for a peaceful community, and are instead seen as totalitarians who jail and fine on a power trip.&lt;/p&gt;&lt;/li&gt;\n&lt;/ul&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nwxxh", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/d2nwxxh/", "num_reports": null, "stickied": false, "created": 1462092009.0, "author_flair_text": "11∆", "created_utc": 1462063209.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6u4l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2olfmu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Crewman-Chu", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6u4l", "score": 2, "approved_by": null, "downs": 0, "body": "The only one of your arguments that isn't simply \"It should be stopped because it's against the law\" is this one:\n\n&gt;For medical marijuana, there are current Government of Canada licensed producers with strict standards of quality as well as methods of distribution. It's regulated. The store fronts are all currently illegal, and run by their own individual standards. There's no way to know who their clientele is, or what their policies and operating practices actually are. Quite simply, zero regulation. Some of the concerns are addressed in the article linked above.\n\nAnd my counterargument to this is that *all* illegal drugs are sold with no quality control or regulation. The only difference now, as you pointed out, is that these salespeople have retail space. So if you take that away, nothing changes except the location of the illegal and unregulated sales. So you do absolutely no good by closing down the shops. All that comes of it is a waste of resources and disruption of people's lives.\n\nAnd like I said, your other arguments boil down to \"It's the law, so it should be enforced,\" which is silly. The law is not and has never been a good way to determine the right or wrong thing to do. To argue otherwise would be to argue that something like slavery is permissible when it is legal.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The only one of your arguments that isn&amp;#39;t simply &amp;quot;It should be stopped because it&amp;#39;s against the law&amp;quot; is this one:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;For medical marijuana, there are current Government of Canada licensed producers with strict standards of quality as well as methods of distribution. It&amp;#39;s regulated. The store fronts are all currently illegal, and run by their own individual standards. There&amp;#39;s no way to know who their clientele is, or what their policies and operating practices actually are. Quite simply, zero regulation. Some of the concerns are addressed in the article linked above.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;And my counterargument to this is that &lt;em&gt;all&lt;/em&gt; illegal drugs are sold with no quality control or regulation. The only difference now, as you pointed out, is that these salespeople have retail space. So if you take that away, nothing changes except the location of the illegal and unregulated sales. So you do absolutely no good by closing down the shops. All that comes of it is a waste of resources and disruption of people&amp;#39;s lives.&lt;/p&gt;\n\n&lt;p&gt;And like I said, your other arguments boil down to &amp;quot;It&amp;#39;s the law, so it should be enforced,&amp;quot; which is silly. The law is not and has never been a good way to determine the right or wrong thing to do. To argue otherwise would be to argue that something like slavery is permissible when it is legal.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2olfmu", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/d2olfmu/", "num_reports": null, "stickied": false, "created": 1462152289.0, "author_flair_text": "1∆", "created_utc": 1462123489.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6u4l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2s4543", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Zob_dznts", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6u4l", "score": 2, "approved_by": null, "downs": 0, "body": "The purpose of police is to *protect the rights and safety of others* not to exercise their *right* to arrest any lawbreaker. If police had unlimited time, manpower, and resources, nearly every US citizen could be jailed for any (however inconsequential) law that they have unknowingly broken. That however, would be doing much more harm to society than good. \n\nSo would you still consider police spending their limited time, manpower, and resources on enforcing a crime that does little if any harm to society rather than focusing on serious crimes (theft, murder, rape) as the *right* thing to do?", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The purpose of police is to &lt;em&gt;protect the rights and safety of others&lt;/em&gt; not to exercise their &lt;em&gt;right&lt;/em&gt; to arrest any lawbreaker. If police had unlimited time, manpower, and resources, nearly every US citizen could be jailed for any (however inconsequential) law that they have unknowingly broken. That however, would be doing much more harm to society than good. &lt;/p&gt;\n\n&lt;p&gt;So would you still consider police spending their limited time, manpower, and resources on enforcing a crime that does little if any harm to society rather than focusing on serious crimes (theft, murder, rape) as the &lt;em&gt;right&lt;/em&gt; thing to do?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2s4543", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6u4l/cmv_police_would_be_right_to_crackdown_on_toronto/d2s4543/", "num_reports": null, "stickied": false, "created": 1462369560.0, "author_flair_text": "1∆", "created_utc": 1462340760.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]