[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2w2s8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;There is an explanation of the movie here &lt;a href=\"http://www.kubrick2001.com/\"&gt;http://www.kubrick2001.com/&lt;/a&gt;\nBut I still think the movie is dumb.&lt;/p&gt;\n\n&lt;p&gt;(This is largely a rant, backed with some reasoning. I will probably offend huge swathes of people. But please understand when replying, I am totally open to rebuttals, but I will cross-examine them with logic, and I will grant fair plausibility to things that seem true and fair enough despite not being able to prove it to a T. I am mainly looking at blatant and cherry-picked arguments, as you will see in the paragraphs below. So by all means, rip apart my words here, as I am doing (can&amp;#39;t have double standards now, can we? That would be hypocritical. Please do rip me apart based on the words I have said here, and not based on the offense you may have felt by those words. Thanks)&lt;/p&gt;\n\n&lt;p&gt;Really, the glass cracking but the wine still being there.... from that you&amp;#39;re supposed to draw that the spirit is present as the body is cast aside? Really? Because that&amp;#39;s the only thing that that could mean, right? And you had to be so implicit about it?&lt;/p&gt;\n\n&lt;p&gt;and was the the LSD trip really necessary? Hal900 faked shit, and you don&amp;#39;t know if he&amp;#39;s really plotted communications module malfunction to isolate and strategically destroy his human passengers, or if he&amp;#39;s just actually malfunctioning. Deceit. So how do you know if Hal900 isn&amp;#39;t faking dying. He says he &amp;quot;feels&amp;quot; himself dying? And as the human disconnects memory modules, Hal900 talks more slowly? That&amp;#39;s not how computers work. It would be instantly corrupted, and stop. There is no reason why it would talk more slowly as opposed to just stop talking or losing the memory file that it&amp;#39;s speaking. Shows how much Stanley Kubrik knows (or cared to research or consult or listen to advisors who would have pointed that out knows - yet we&amp;#39;re to take lessons from him about AI singularity? pft). So with such blatant ignorance of the behaviors and mechanisms of computers, I, the viewer is supposed to understand the Hal900 is actually losing and &amp;quot;dying&amp;quot;, as opposed to faking it and being Machiavelian, like he arguably was (but we can&amp;#39;t be certain) when he said the communications module is failing? Come on. And then it goes into this LSD trip that I&amp;#39;m supposed to take literally? And then I&amp;#39;m not supposed to take the room scene after the LSD trip too literally? Come on...&lt;/p&gt;\n\n&lt;p&gt;There is a pervasive oversimplification in film about man and tools. AI singularity is the mechanism and the theme by which &amp;quot;man loses control of his tools&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;And really, a f-ing starchild? where the f did that come from? Did he figure out a way to clone himself? Maybe you want to insert those steps in, instead of spending 5 times longer on every scene than necessary?&lt;/p&gt;\n\n&lt;p&gt;It commits the sin that the 2013 movie Snowpiercer does. Both movies spend so much time on the buildup, but when we get to the actual crux of the philosophical thesis and main point of each movie, it is glossed over so quickly, when there many many questionable steps in the logic of the grand thesis. This rapid glossing over of steps to me is a common observed pattern that I notice in the artsy humanities majors, generally speaking of course. They want to claim things are true, but not submit to the methodology and criteria of establishing truth. And if you press them on it, they retreat to relativism, that everything is subjective, why aren&amp;#39;t you being nice, logic is just as valid as opinion, post modernism... it&amp;#39;s like they have no shame.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Cerebral&amp;quot;, &amp;quot;academic&amp;quot; film.... such leaps of conclusions, such skipping of steps, such construing of events that could mean ten thousand things to mean specifically one thing arbitrarily chosen... such pretentiousness achieved through an unnecessary degree of implicitness. My personal opinion is that this is an example of over-glorification of the ivory tower. Just like how stupid child art passes off for tens of millions of dollars because of overinflated, fabricated demand, and the error of the human mind. No, that painting is not worth that much, and neither is this film (well, economic worth is determined by supply and demand. I&amp;#39;m talking about the intrinsic worth that those buying and praising the work claim they have).&lt;/p&gt;\n\n&lt;p&gt;There is a saying by Richard Feynman. The gist is to use simple words instead of jargon to test whether anything of substance was said, or if jargon was inserted, obscuring whether any real idea of substance was said. In film, the close equivalent would be to see if any point of substance was made, or if you just artificially inflated it to be &amp;quot;cerebral&amp;quot; by obscuring, skipping steps, and making things implicit when you could have &amp;quot;used simple words&amp;quot; by being explicit. That would never fly in engineering or the sciences. &amp;quot;Hey look at me, I&amp;#39;m such a brilliant person - I skip steps to prove my points. Can I has PhD?&amp;quot; This gets to the crux of why a 3.0 GPA in sciences is considered much more than a 3.0 in humanities, again, in general.&lt;/p&gt;\n\n&lt;p&gt;But then again, maybe Stanley Kubrik is just sooo f-ing genius, and I missed 10 thousand things. But again, even if that were the case, the point about being implicit vs explicit still stands.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "There is an explanation of the movie here http://www.kubrick2001.com/\nBut I still think the movie is dumb.\n\n(This is largely a rant, backed with some reasoning. I will probably offend huge swathes of people. But please understand when replying, I am totally open to rebuttals, but I will cross-examine them with logic, and I will grant fair plausibility to things that seem true and fair enough despite not being able to prove it to a T. I am mainly looking at blatant and cherry-picked arguments, as you will see in the paragraphs below. So by all means, rip apart my words here, as I am doing (can't have double standards now, can we? That would be hypocritical. Please do rip me apart based on the words I have said here, and not based on the offense you may have felt by those words. Thanks)\n\nReally, the glass cracking but the wine still being there.... from that you're supposed to draw that the spirit is present as the body is cast aside? Really? Because that's the only thing that that could mean, right? And you had to be so implicit about it?\n\nand was the the LSD trip really necessary? Hal900 faked shit, and you don't know if he's really plotted communications module malfunction to isolate and strategically destroy his human passengers, or if he's just actually malfunctioning. Deceit. So how do you know if Hal900 isn't faking dying. He says he \"feels\" himself dying? And as the human disconnects memory modules, Hal900 talks more slowly? That's not how computers work. It would be instantly corrupted, and stop. There is no reason why it would talk more slowly as opposed to just stop talking or losing the memory file that it's speaking. Shows how much Stanley Kubrik knows (or cared to research or consult or listen to advisors who would have pointed that out knows - yet we're to take lessons from him about AI singularity? pft). So with such blatant ignorance of the behaviors and mechanisms of computers, I, the viewer is supposed to understand the Hal900 is actually losing and \"dying\", as opposed to faking it and being Machiavelian, like he arguably was (but we can't be certain) when he said the communications module is failing? Come on. And then it goes into this LSD trip that I'm supposed to take literally? And then I'm not supposed to take the room scene after the LSD trip too literally? Come on...\n\nThere is a pervasive oversimplification in film about man and tools. AI singularity is the mechanism and the theme by which \"man loses control of his tools\".\n\nAnd really, a f-ing starchild? where the f did that come from? Did he figure out a way to clone himself? Maybe you want to insert those steps in, instead of spending 5 times longer on every scene than necessary?\n\nIt commits the sin that the 2013 movie Snowpiercer does. Both movies spend so much time on the buildup, but when we get to the actual crux of the philosophical thesis and main point of each movie, it is glossed over so quickly, when there many many questionable steps in the logic of the grand thesis. This rapid glossing over of steps to me is a common observed pattern that I notice in the artsy humanities majors, generally speaking of course. They want to claim things are true, but not submit to the methodology and criteria of establishing truth. And if you press them on it, they retreat to relativism, that everything is subjective, why aren't you being nice, logic is just as valid as opinion, post modernism... it's like they have no shame.\n\n\"Cerebral\", \"academic\" film.... such leaps of conclusions, such skipping of steps, such construing of events that could mean ten thousand things to mean specifically one thing arbitrarily chosen... such pretentiousness achieved through an unnecessary degree of implicitness. My personal opinion is that this is an example of over-glorification of the ivory tower. Just like how stupid child art passes off for tens of millions of dollars because of overinflated, fabricated demand, and the error of the human mind. No, that painting is not worth that much, and neither is this film (well, economic worth is determined by supply and demand. I'm talking about the intrinsic worth that those buying and praising the work claim they have).\n\nThere is a saying by Richard Feynman. The gist is to use simple words instead of jargon to test whether anything of substance was said, or if jargon was inserted, obscuring whether any real idea of substance was said. In film, the close equivalent would be to see if any point of substance was made, or if you just artificially inflated it to be \"cerebral\" by obscuring, skipping steps, and making things implicit when you could have \"used simple words\" by being explicit. That would never fly in engineering or the sciences. \"Hey look at me, I'm such a brilliant person - I skip steps to prove my points. Can I has PhD?\" This gets to the crux of why a 3.0 GPA in sciences is considered much more than a 3.0 in humanities, again, in general.\n\nBut then again, maybe Stanley Kubrik is just sooo f-ing genius, and I missed 10 thousand things. But again, even if that were the case, the point about being implicit vs explicit still stands.", "likes": null, "suggested_sort": "qa", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4h8m6l", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "gxwho", "num_crossposts": 0, "link_flair_text": "[∆(s) from OP]", "can_mod_post": false, "send_replies": true, "pinned": false, "score": 4, "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "num_comments": 54, "thumbnail": "", "hide_score": false, "edited": 1462108808.0, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 539231, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_4h8m6l", "spoiler": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1462129038.0, "url": "https://www.reddit.com/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/", "author_flair_text": null, "quarantine": false, "title": "CMV: A Space Odyssey (and other such films) are pretentious, arbitrary, and contradictory", "created_utc": 1462100238.0, "subreddit_name_prefixed": "r/changemyview", "distinguished": null, "media": null, "upvote_ratio": 0.57, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 4}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 20, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 14, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2p0su8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ofsgc", "score": 1, "approved_by": null, "downs": 0, "body": "a", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;a&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2p0su8", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2p0su8/", "num_reports": null, "stickied": false, "created": 1462176943.0, "author_flair_text": null, "created_utc": 1462148143.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ofsgc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DeltaBot", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ofrlj", "score": 1, "approved_by": null, "downs": 0, "body": "Confirmed: 1 delta awarded to /u/DHCKris. ^[[History](/r/changemyview/wiki/user/DHCKris)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]", "edited": 1462148194.0, "author_flair_css_class": "points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/DHCKris\"&gt;/u/DHCKris&lt;/a&gt;. &lt;sup&gt;[&lt;a href=\"/r/changemyview/wiki/user/DHCKris\"&gt;History&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;[&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/deltabot\"&gt;Wiki&lt;/a&gt;][&lt;a href=\"https://github.com/alexames/DeltaBot\"&gt;Code&lt;/a&gt;][&lt;a href=\"/r/DeltaBot\"&gt;/r/DeltaBot&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ofsgc", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ofsgc/", "num_reports": null, "stickied": false, "created": 1462142515.0, "author_flair_text": "∞∆", "created_utc": 1462113715.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": "moderator"}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ofrlj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ofieo", "score": 3, "approved_by": null, "downs": 0, "body": "&amp;#8710;\n\nThanks. This really clears things up and makes the world make sense again =P\n\nfilms, like music, can have any meaning the viewer puts onto it, or no meaning at all.\nFilms can and probably do have a point they're trying to get across, especially in this film, but the general principle stands that it doesn't have to. \n\nOpenended films is a legit film style, whereby many valid interpretations can exist, and is sometimes intended.\n____\n\nsidenote: I see a lot of parallels with open ended movies (like whether that mysterious black slab was real aliens or not) and religion (is heaven a physical place where we have physical bodies or not?).\n\nMaybe it's the type of mind that is OK with not having concrete answers to those questions, to emphasize feelings, and project all kinds of meaning or feeling into things that finds both open ended films, music, and religion so fitting for them (is it a coincidence that music is always so heavily intertwined with religion? probably not).\n\nI personally find that degree of open endedness, so much substitution of emotion for logic as far as metaphysics goes to be incredibly jarring, annoying, and even infuriating. They leave such critical things unanswered, yet are so convinced of a certain truth (arbitrarily chosen by them according to their feelings, of course), so contented with ignorance, so blind to the incredibly significant logical implications of those things.... but they want to spread their view and emotion based on sand on everyone else while talking it up so much.... give me a break.", "edited": 1462148119.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#8710;&lt;/p&gt;\n\n&lt;p&gt;Thanks. This really clears things up and makes the world make sense again =P&lt;/p&gt;\n\n&lt;p&gt;films, like music, can have any meaning the viewer puts onto it, or no meaning at all.\nFilms can and probably do have a point they&amp;#39;re trying to get across, especially in this film, but the general principle stands that it doesn&amp;#39;t have to. &lt;/p&gt;\n\n&lt;p&gt;Openended films is a legit film style, whereby many valid interpretations can exist, and is sometimes intended.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;sidenote: I see a lot of parallels with open ended movies (like whether that mysterious black slab was real aliens or not) and religion (is heaven a physical place where we have physical bodies or not?).&lt;/p&gt;\n\n&lt;p&gt;Maybe it&amp;#39;s the type of mind that is OK with not having concrete answers to those questions, to emphasize feelings, and project all kinds of meaning or feeling into things that finds both open ended films, music, and religion so fitting for them (is it a coincidence that music is always so heavily intertwined with religion? probably not).&lt;/p&gt;\n\n&lt;p&gt;I personally find that degree of open endedness, so much substitution of emotion for logic as far as metaphysics goes to be incredibly jarring, annoying, and even infuriating. They leave such critical things unanswered, yet are so convinced of a certain truth (arbitrarily chosen by them according to their feelings, of course), so contented with ignorance, so blind to the incredibly significant logical implications of those things.... but they want to spread their view and emotion based on sand on everyone else while talking it up so much.... give me a break.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ofrlj", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ofrlj/", "num_reports": null, "stickied": false, "created": 1462142468.0, "author_flair_text": null, "created_utc": 1462113668.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "more", "data": {"count": 2, "name": "t1_d2qpfx4", "id": "d2qpfx4", "parent_id": "t1_d2ofieo", "depth": 3, "children": ["d2qpfx4"]}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ofieo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DHCKris", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2of99i", "score": 14, "approved_by": null, "downs": 0, "body": "Yeah, this is pretty much it. Man, if the vagueness of 2001 annoys you, I know some great movies you should *never* see: 2001 is tame by comparison.\n\nBut yeah, movies don't have to have a coherent plot, all they have to be is a series of images (and even that rule has been broken in film history). Again, think of a movie with a coherent plot as a song with comprehensable lyrics. 2001, then, is like an instrumental piece and can either mean whatever you want or **mean nothing at all:** just provide an enjoyable melody or series of sounds that ocasionally inspires moods, thoughts or feelings.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Yeah, this is pretty much it. Man, if the vagueness of 2001 annoys you, I know some great movies you should &lt;em&gt;never&lt;/em&gt; see: 2001 is tame by comparison.&lt;/p&gt;\n\n&lt;p&gt;But yeah, movies don&amp;#39;t have to have a coherent plot, all they have to be is a series of images (and even that rule has been broken in film history). Again, think of a movie with a coherent plot as a song with comprehensable lyrics. 2001, then, is like an instrumental piece and can either mean whatever you want or &lt;strong&gt;mean nothing at all:&lt;/strong&gt; just provide an enjoyable melody or series of sounds that ocasionally inspires moods, thoughts or feelings.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ofieo", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ofieo/", "num_reports": null, "stickied": false, "created": 1462141949.0, "author_flair_text": "98∆", "created_utc": 1462113149.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2pbcwi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2pb1s1", "score": 0, "approved_by": null, "downs": 0, "body": "&gt; What is there to be ashamed of?\n\nI guess that about sums up the philosophy of art, doesn't it?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What is there to be ashamed of?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I guess that about sums up the philosophy of art, doesn&amp;#39;t it?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2pbcwi", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2pbcwi/", "num_reports": null, "stickied": false, "created": 1462194168.0, "author_flair_text": null, "created_utc": 1462165368.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 9, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2pb1s1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hallflukai", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2pa7cf", "score": 1, "approved_by": null, "downs": 0, "body": "Well I was using the art example as an analogy. Same thing with 2001. Try to put your current interpretation aside and see it how other people might see it. Instead of interpreting the film being \"super implicit\" just to inflate its own \"literary value\", try to see what it might accomplish by doing that. What would be lost by stating it more explicitly? Read other people's interpretations of the film with an open mind, too. What do they make of the scenes?\n\nTo be blunt, I think your constant request that movies say things more explicitly comes from either an unwillingness to look at subtext or not enough time thinking about subtext. Do you want an epilogue for The Lion King where somebody tells you the movie is about growing older and accepting responsibility? That's an implicit message of the movie that's never stated explicitly. Movies like 2001 are on the far side of the spectrum where *most* of the movie is subtext. \n\n&gt;It commits the sin that the 2013 movie Snowpiercer does. Both movies spend so much time on the buildup, but when we get to the actual crux of the philosophical thesis and main point of each movie, it is glossed over so quickly, when there many many questionable steps in the logic of the grand thesis. This rapid glossing over of steps to me is a common observed pattern that I notice in the artsy humanities majors, generally speaking of course. They want to claim things are true, but not submit to the methodology and criteria of establishing truth.\n\nThat's the thing. The philosophy and message of Snowpiercer does *not* come from the reveal. It comes from the rest of the movie. The story, the journey to the end is where the meat of the message is contained. \n\n&gt;And if you press them on it, they retreat to relativism, that everything is subjective, why aren't you being nice, logic is just as valid as opinion, post modernism... it's like they have no shame.\n\nWhat's wrong with any of this? Art is subjective. Are you really trying your best to see it from their viewpoint or are you just dismissing their viewpoint as pretentious from the get go, though? I also doubt anybody has criticized you for \"not being nice\". Opinion is just as valid as logic when discussing art, and post modernism is a completely valid lens to look at film through. What is there to be ashamed of? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well I was using the art example as an analogy. Same thing with 2001. Try to put your current interpretation aside and see it how other people might see it. Instead of interpreting the film being &amp;quot;super implicit&amp;quot; just to inflate its own &amp;quot;literary value&amp;quot;, try to see what it might accomplish by doing that. What would be lost by stating it more explicitly? Read other people&amp;#39;s interpretations of the film with an open mind, too. What do they make of the scenes?&lt;/p&gt;\n\n&lt;p&gt;To be blunt, I think your constant request that movies say things more explicitly comes from either an unwillingness to look at subtext or not enough time thinking about subtext. Do you want an epilogue for The Lion King where somebody tells you the movie is about growing older and accepting responsibility? That&amp;#39;s an implicit message of the movie that&amp;#39;s never stated explicitly. Movies like 2001 are on the far side of the spectrum where &lt;em&gt;most&lt;/em&gt; of the movie is subtext. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It commits the sin that the 2013 movie Snowpiercer does. Both movies spend so much time on the buildup, but when we get to the actual crux of the philosophical thesis and main point of each movie, it is glossed over so quickly, when there many many questionable steps in the logic of the grand thesis. This rapid glossing over of steps to me is a common observed pattern that I notice in the artsy humanities majors, generally speaking of course. They want to claim things are true, but not submit to the methodology and criteria of establishing truth.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s the thing. The philosophy and message of Snowpiercer does &lt;em&gt;not&lt;/em&gt; come from the reveal. It comes from the rest of the movie. The story, the journey to the end is where the meat of the message is contained. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And if you press them on it, they retreat to relativism, that everything is subjective, why aren&amp;#39;t you being nice, logic is just as valid as opinion, post modernism... it&amp;#39;s like they have no shame.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;What&amp;#39;s wrong with any of this? Art is subjective. Are you really trying your best to see it from their viewpoint or are you just dismissing their viewpoint as pretentious from the get go, though? I also doubt anybody has criticized you for &amp;quot;not being nice&amp;quot;. Opinion is just as valid as logic when discussing art, and post modernism is a completely valid lens to look at film through. What is there to be ashamed of? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2pb1s1", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2pb1s1/", "num_reports": null, "stickied": false, "created": 1462193458.0, "author_flair_text": null, "created_utc": 1462164658.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 8, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2x618o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2phjrn", "score": 1, "approved_by": null, "downs": 0, "body": "very well put. \n\n&amp;#8710; ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;very well put. &lt;/p&gt;\n\n&lt;p&gt;&amp;#8710; &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2x618o", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2x618o/", "num_reports": null, "stickied": false, "created": 1462715312.0, "author_flair_text": null, "created_utc": 1462686512.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 9, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2phjrn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "nowonmai", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2pa7cf", "score": 2, "approved_by": null, "downs": 0, "body": "That implies that the artist's direct narrative is always preferable to the viewers subjective interpretation. I have a real problem with that. The whole idea of being spoonfed completely negates my life experiences and any personal nuance. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That implies that the artist&amp;#39;s direct narrative is always preferable to the viewers subjective interpretation. I have a real problem with that. The whole idea of being spoonfed completely negates my life experiences and any personal nuance. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2phjrn", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2phjrn/", "num_reports": null, "stickied": false, "created": 1462214614.0, "author_flair_text": null, "created_utc": 1462185814.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 8, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2pa7cf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2p9lbp", "score": 0, "approved_by": null, "downs": 0, "body": "no, not art as a whole.\nspecific filmic devices are pretentious, like being super implicit to inflate the literary value of it, instead of just saying it explicitly.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;no, not art as a whole.\nspecific filmic devices are pretentious, like being super implicit to inflate the literary value of it, instead of just saying it explicitly.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2pa7cf", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2pa7cf/", "num_reports": null, "stickied": false, "created": 1462191664.0, "author_flair_text": null, "created_utc": 1462162864.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 7, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2p9lbp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hallflukai", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2p8n0v", "score": 2, "approved_by": null, "downs": 0, "body": "Here's something that helps me in regard to staying open to strange/weird/modern art.\n\nTake something like this [famous Jackson Pollock](http://www.jackson-pollock.org/images/paintings/autumn-rhythm.jpg).\n\nOn first glance to somebody like you (if I\"m reader into your views on art correctly) this might just be a pretentious piece of shit, right?\n\nAnd sure, that's a valid viewpoint. But think of the people that respect this an something *more* than paint splatters on a canvas. Try to see what they might see, think about it how they might think about it. Throw any ideas you have at it that aren't \"this is pretentious garbage\". Eventually, maybe, one of those ideas will stick. Maybe you'll appreciate the artistic movements Pollock was lashing out against and how his art is a rebellion against that. I personally like how the ink splatters can draw your eye around the canvas. Maybe you find some significance in the colors present in the context of the title (Autumn Rhythm).\n\nYou need to be able to accept that maybe these pretentious art hipsters know something that you don't, something that can't be explained with grand unified theories. Try to learn from them and how they appreciate this sort of stuff. Obviously there's *something* there worth appreciating since they're not just pretending to like it to seem cool.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Here&amp;#39;s something that helps me in regard to staying open to strange/weird/modern art.&lt;/p&gt;\n\n&lt;p&gt;Take something like this &lt;a href=\"http://www.jackson-pollock.org/images/paintings/autumn-rhythm.jpg\"&gt;famous Jackson Pollock&lt;/a&gt;.&lt;/p&gt;\n\n&lt;p&gt;On first glance to somebody like you (if I&amp;quot;m reader into your views on art correctly) this might just be a pretentious piece of shit, right?&lt;/p&gt;\n\n&lt;p&gt;And sure, that&amp;#39;s a valid viewpoint. But think of the people that respect this an something &lt;em&gt;more&lt;/em&gt; than paint splatters on a canvas. Try to see what they might see, think about it how they might think about it. Throw any ideas you have at it that aren&amp;#39;t &amp;quot;this is pretentious garbage&amp;quot;. Eventually, maybe, one of those ideas will stick. Maybe you&amp;#39;ll appreciate the artistic movements Pollock was lashing out against and how his art is a rebellion against that. I personally like how the ink splatters can draw your eye around the canvas. Maybe you find some significance in the colors present in the context of the title (Autumn Rhythm).&lt;/p&gt;\n\n&lt;p&gt;You need to be able to accept that maybe these pretentious art hipsters know something that you don&amp;#39;t, something that can&amp;#39;t be explained with grand unified theories. Try to learn from them and how they appreciate this sort of stuff. Obviously there&amp;#39;s &lt;em&gt;something&lt;/em&gt; there worth appreciating since they&amp;#39;re not just pretending to like it to seem cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2p9lbp", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2p9lbp/", "num_reports": null, "stickied": false, "created": 1462190446.0, "author_flair_text": null, "created_utc": 1462161646.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 6, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2p8n0v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2p6xql", "score": 1, "approved_by": null, "downs": 0, "body": "you're seriously changing my mind a lot. \n\nI guess I've always had problems with open-endedness to some degree. \n\nPart of it is wanting to know grand unified theories for things, which is what I naturally put together in my head for things that catch my interest. \n\nAnother part of it is just blank screen anxiety. If I am told to draw something on a blank sheet, there is actually a lot of problems that block me mentally and emotionally. I've heard it's not uncommon.\n\nAnd the last major part is the sheet confusion of contradictions and nonsense from being told I might burn in hell for eternity, but the steps I need to take to avoid it were always unclear, vague, and I was never sure. Logic is amazing for this reason alone.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;you&amp;#39;re seriously changing my mind a lot. &lt;/p&gt;\n\n&lt;p&gt;I guess I&amp;#39;ve always had problems with open-endedness to some degree. &lt;/p&gt;\n\n&lt;p&gt;Part of it is wanting to know grand unified theories for things, which is what I naturally put together in my head for things that catch my interest. &lt;/p&gt;\n\n&lt;p&gt;Another part of it is just blank screen anxiety. If I am told to draw something on a blank sheet, there is actually a lot of problems that block me mentally and emotionally. I&amp;#39;ve heard it&amp;#39;s not uncommon.&lt;/p&gt;\n\n&lt;p&gt;And the last major part is the sheet confusion of contradictions and nonsense from being told I might burn in hell for eternity, but the steps I need to take to avoid it were always unclear, vague, and I was never sure. Logic is amazing for this reason alone.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2p8n0v", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2p8n0v/", "num_reports": null, "stickied": false, "created": 1462188688.0, "author_flair_text": null, "created_utc": 1462159888.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2pd1gg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2p6xql", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; World Of Tomorrow\n\nOH I think i already saw that! I could follow that. it's was cool.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;World Of Tomorrow&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;OH I think i already saw that! I could follow that. it&amp;#39;s was cool.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2pd1gg", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2pd1gg/", "num_reports": null, "stickied": false, "created": 1462198478.0, "author_flair_text": null, "created_utc": 1462169678.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2p6xql", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hallflukai", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ox0dm", "score": 2, "approved_by": null, "downs": 0, "body": "You could buy me a virtual beer by watching Don Hertzfeldt's \"World Of Tomorrow\" on Netflix! It's by the same guy that did my favorite movie (It's Such A Beautiful Day). Give it a watch and go in with an open mind. Think of it less like a linear narrative and more as a painting of sorts. It's only 16 minutes so even if you find it pretentious and aimless (which are very valid ways to describe it) you might appreciate it for its simplicity and really great visuals and use of music. \n\nActually here's a way to describe how you might want to go into this movie: think of the way a young child might watch a movie or appreciate a storybook. Just let it wash over you and pick up meaning where it happens intuitively, but don't try to force anything that doesn't really come to you.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You could buy me a virtual beer by watching Don Hertzfeldt&amp;#39;s &amp;quot;World Of Tomorrow&amp;quot; on Netflix! It&amp;#39;s by the same guy that did my favorite movie (It&amp;#39;s Such A Beautiful Day). Give it a watch and go in with an open mind. Think of it less like a linear narrative and more as a painting of sorts. It&amp;#39;s only 16 minutes so even if you find it pretentious and aimless (which are very valid ways to describe it) you might appreciate it for its simplicity and really great visuals and use of music. &lt;/p&gt;\n\n&lt;p&gt;Actually here&amp;#39;s a way to describe how you might want to go into this movie: think of the way a young child might watch a movie or appreciate a storybook. Just let it wash over you and pick up meaning where it happens intuitively, but don&amp;#39;t try to force anything that doesn&amp;#39;t really come to you.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2p6xql", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2p6xql/", "num_reports": null, "stickied": false, "created": 1462185973.0, "author_flair_text": null, "created_utc": 1462157173.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ox0dm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2opq4p", "score": 1, "approved_by": null, "downs": 0, "body": "&amp;#8710;\n\n\nYes. this is awesome. Thanks for posting. I'd like to give buy you a virtual beer. How do I do that? Idk if I have any karma points or stuff like that. (pretty new new to the reddit mechanisms)\nYeah, I don't necessarily need to understand a specific movie or go through that experience first hand, but simply understanding the structure or meta-style of it, like you described really well helps a ton.\n\nNow, maybe I still think this particular movie is still pretentious or arbitrary, but I would be basing my delta award based on the type or style that this particular movie falls into. A class vs an instance, to put it in programming terms.", "edited": 1462159951.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#8710;&lt;/p&gt;\n\n&lt;p&gt;Yes. this is awesome. Thanks for posting. I&amp;#39;d like to give buy you a virtual beer. How do I do that? Idk if I have any karma points or stuff like that. (pretty new new to the reddit mechanisms)\nYeah, I don&amp;#39;t necessarily need to understand a specific movie or go through that experience first hand, but simply understanding the structure or meta-style of it, like you described really well helps a ton.&lt;/p&gt;\n\n&lt;p&gt;Now, maybe I still think this particular movie is still pretentious or arbitrary, but I would be basing my delta award based on the type or style that this particular movie falls into. A class vs an instance, to put it in programming terms.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ox0dm", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ox0dm/", "num_reports": null, "stickied": false, "created": 1462170552.0, "author_flair_text": null, "created_utc": 1462141752.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2opq4p", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hallflukai", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2of99i", "score": 3, "approved_by": null, "downs": 0, "body": "I think the problem is that your way of viewing art and movies is just not in line with what movies like 2001 are going after. There's nothing wrong with that, but if you're not open to thinking along the lines films like 2001 need you to think along your perception of the movie won't be changed. I'm mostly going to be ignoring 2001 but focusing on modern art and more obscure narrative styles and maybe, hopefully, giving you an appreciation for them. \n\n&gt;Maybe I'm accustomed to coherent plot, and don't like the \"here's some random images, you figure that sht out\" style of movies.\n\nThat's exactly it, really. My favorite movie of all time, [It's Such A Beautiful Day](https://www.youtube.com/watch?v=m4LLVIUh6ZM) falls very squarely along these lines. Narratives have differing layers of opaqueness to them.\n\nI'll illustrate this using two book you have heard of, if not read, and then trying to tie it back into film.\n\nThe first book is Harry Potter. it has an extremely linear narrative. Nothing is hidden from the reader, there's nothing really to be gleaned about Harry Potter's character or mental state that's not already said in the book. Sure, there are things hidden from the audience for dramatic tension but it always bubbles up to the surface eventually.\n\nThe second book is Catcher In The Rye. I think we can all agree that the surface-narrative is *not* the main point of the book. An angsty teenage kid's inner ramblings as he walks around for three days? If you look at the book as a straight-ahead narrative it's not that great.\n\nBut if you look underneath the surface at the themes and ideas the book brings up you can really start to see how brilliant it is. It deals with alienation and loneliness, and a lot of young adults find solace in the book because it lets them know that they're not alone in identifying with Holden. It deals with maturation between adolescence and adulthood. The difference is, you have to think about CITR more than Harry Potter to get to this. These themes are present in Harry Potter too, but they are much more transparent.\n\nBack to movies, there are plenty of movies that are like Harry Potter. The plot drives them and the narrative is very transparent about its themes. But some movies are more nuanced. Their surface-narratives are more hazy. Just for fun, let's imagine that the [Intro from Wall-E](https://www.youtube.com/watch?v=nLx_7wEmwms) is a short film and that nothing comes after the clip I linked.\n\nNow, this imaginary short film doesn't actually make any statements about the state of earth. The music is cheerful. There's no monologue about how humans destroyed the earth. But it is very clear that it is making a statement about pollution.\n\nImagine narratives as a spectrum. On one side, you have very clear, cause and effect, a -&gt; b -&gt; c narratives. As you traverse to the other side, the narrative becomes less of a chain of events and becomes more cloudy. You might ask why Pulp Fiction isn't told in a linear fashion even though it would still work. You might have works like The Life of Pi where the way the narrative is told is actually *part* of the narrative. 2001 is very clearly in the territory of having a cloudier, hazier, less cause-and-effect, less chain-of-events narrative.\n\nThis isn't the greatest explanation, I'll be honest. I'm just kind of throwing my thoughts out there, but I hope it might give you some sort of insight into how movies like this are appreciated. I can guarantee that movies like this aren't going to \"click\" all at once and I'd be very surprised to see any delta-Vs given out in this thread. It takes time to gain an appreciation for films like this since they're so far away from the normal narratives we're used to.\n\nAs a final sort of post-script, there is one film in particular that, for me, really exemplifies the movie/music connection that /u/DHSKris is making. I remember sitting on my bed in my dorm watching [Upstream Color](https://www.youtube.com/watch?v=5U9KmAlrEXU) in one sitting. The plot of this film is extremely cloudy, but I sat there just sort of *absorbing* the movie instead of actually following it. I don't really know how to tie that in to any of this, but it seemed relevant.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think the problem is that your way of viewing art and movies is just not in line with what movies like 2001 are going after. There&amp;#39;s nothing wrong with that, but if you&amp;#39;re not open to thinking along the lines films like 2001 need you to think along your perception of the movie won&amp;#39;t be changed. I&amp;#39;m mostly going to be ignoring 2001 but focusing on modern art and more obscure narrative styles and maybe, hopefully, giving you an appreciation for them. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Maybe I&amp;#39;m accustomed to coherent plot, and don&amp;#39;t like the &amp;quot;here&amp;#39;s some random images, you figure that sht out&amp;quot; style of movies.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s exactly it, really. My favorite movie of all time, &lt;a href=\"https://www.youtube.com/watch?v=m4LLVIUh6ZM\"&gt;It&amp;#39;s Such A Beautiful Day&lt;/a&gt; falls very squarely along these lines. Narratives have differing layers of opaqueness to them.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll illustrate this using two book you have heard of, if not read, and then trying to tie it back into film.&lt;/p&gt;\n\n&lt;p&gt;The first book is Harry Potter. it has an extremely linear narrative. Nothing is hidden from the reader, there&amp;#39;s nothing really to be gleaned about Harry Potter&amp;#39;s character or mental state that&amp;#39;s not already said in the book. Sure, there are things hidden from the audience for dramatic tension but it always bubbles up to the surface eventually.&lt;/p&gt;\n\n&lt;p&gt;The second book is Catcher In The Rye. I think we can all agree that the surface-narrative is &lt;em&gt;not&lt;/em&gt; the main point of the book. An angsty teenage kid&amp;#39;s inner ramblings as he walks around for three days? If you look at the book as a straight-ahead narrative it&amp;#39;s not that great.&lt;/p&gt;\n\n&lt;p&gt;But if you look underneath the surface at the themes and ideas the book brings up you can really start to see how brilliant it is. It deals with alienation and loneliness, and a lot of young adults find solace in the book because it lets them know that they&amp;#39;re not alone in identifying with Holden. It deals with maturation between adolescence and adulthood. The difference is, you have to think about CITR more than Harry Potter to get to this. These themes are present in Harry Potter too, but they are much more transparent.&lt;/p&gt;\n\n&lt;p&gt;Back to movies, there are plenty of movies that are like Harry Potter. The plot drives them and the narrative is very transparent about its themes. But some movies are more nuanced. Their surface-narratives are more hazy. Just for fun, let&amp;#39;s imagine that the &lt;a href=\"https://www.youtube.com/watch?v=nLx_7wEmwms\"&gt;Intro from Wall-E&lt;/a&gt; is a short film and that nothing comes after the clip I linked.&lt;/p&gt;\n\n&lt;p&gt;Now, this imaginary short film doesn&amp;#39;t actually make any statements about the state of earth. The music is cheerful. There&amp;#39;s no monologue about how humans destroyed the earth. But it is very clear that it is making a statement about pollution.&lt;/p&gt;\n\n&lt;p&gt;Imagine narratives as a spectrum. On one side, you have very clear, cause and effect, a -&amp;gt; b -&amp;gt; c narratives. As you traverse to the other side, the narrative becomes less of a chain of events and becomes more cloudy. You might ask why Pulp Fiction isn&amp;#39;t told in a linear fashion even though it would still work. You might have works like The Life of Pi where the way the narrative is told is actually &lt;em&gt;part&lt;/em&gt; of the narrative. 2001 is very clearly in the territory of having a cloudier, hazier, less cause-and-effect, less chain-of-events narrative.&lt;/p&gt;\n\n&lt;p&gt;This isn&amp;#39;t the greatest explanation, I&amp;#39;ll be honest. I&amp;#39;m just kind of throwing my thoughts out there, but I hope it might give you some sort of insight into how movies like this are appreciated. I can guarantee that movies like this aren&amp;#39;t going to &amp;quot;click&amp;quot; all at once and I&amp;#39;d be very surprised to see any delta-Vs given out in this thread. It takes time to gain an appreciation for films like this since they&amp;#39;re so far away from the normal narratives we&amp;#39;re used to.&lt;/p&gt;\n\n&lt;p&gt;As a final sort of post-script, there is one film in particular that, for me, really exemplifies the movie/music connection that &lt;a href=\"/u/DHSKris\"&gt;/u/DHSKris&lt;/a&gt; is making. I remember sitting on my bed in my dorm watching &lt;a href=\"https://www.youtube.com/watch?v=5U9KmAlrEXU\"&gt;Upstream Color&lt;/a&gt; in one sitting. The plot of this film is extremely cloudy, but I sat there just sort of &lt;em&gt;absorbing&lt;/em&gt; the movie instead of actually following it. I don&amp;#39;t really know how to tie that in to any of this, but it seemed relevant.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2opq4p", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2opq4p/", "num_reports": null, "stickied": false, "created": 1462158985.0, "author_flair_text": null, "created_utc": 1462130185.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2owqah", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ohtl5", "score": 1, "approved_by": null, "downs": 0, "body": "nope. full attention.\n\nno wait, doesn't he just go into the trance after shutting down hal? \nA thing that also confused me was suspended belief. I'm not supposed to take things after that literally, so I couldn't tell if I was supposed to believe hal was actually shut down, or if Hal was just pretending. Afterall, he was a diabolical mastermind in regards to the communication module malfunction.\n\nFlying into the monolith? It was just there in space? Did he crash into it? Yeah, I understand the monolith is what creates the LSD trip, not the robot.\n\nI missed how the monolith had special powers... what did it do? disappear?\n\n", "edited": 1462148303.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;nope. full attention.&lt;/p&gt;\n\n&lt;p&gt;no wait, doesn&amp;#39;t he just go into the trance after shutting down hal? \nA thing that also confused me was suspended belief. I&amp;#39;m not supposed to take things after that literally, so I couldn&amp;#39;t tell if I was supposed to believe hal was actually shut down, or if Hal was just pretending. Afterall, he was a diabolical mastermind in regards to the communication module malfunction.&lt;/p&gt;\n\n&lt;p&gt;Flying into the monolith? It was just there in space? Did he crash into it? Yeah, I understand the monolith is what creates the LSD trip, not the robot.&lt;/p&gt;\n\n&lt;p&gt;I missed how the monolith had special powers... what did it do? disappear?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2owqah", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2owqah/", "num_reports": null, "stickied": false, "created": 1462170088.0, "author_flair_text": null, "created_utc": 1462141288.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ohtl5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MikeCharlieUniform", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ogja1", "score": 1, "approved_by": null, "downs": 0, "body": "I have to be honest - I am left wondering if you were attempting to multi-task while watching the film.\n\n&gt; When does he contact the monolith? After disarming the computer?\n\nBowman shuts down HAL. He then discovers the message explaining the true purpose of the mission. He continues on to the monolith, takes an EVA pod, and flies to the monolith. That's when he says \"my God, it's full of stars!\" and experiences the \"LSD trip\" (as you call it) and the weird white room. *All of that* is connected to the monolith, not HAL.\n\n&gt; But if one moment, magic works, and then it doesn't, for no good reason, when they didn't even travel back into the earth world, and his wand is not broken, and he isn't mysteriously silenced by some unknown spell.... the physics has been broken.\n\nJust because you don't have full information doesn't mean the \"physics is broken\". Bowman entered an object created a *very* long time ago by a *very* advanced civilization. Very little about that should be immediately comprehensible.\n\n&gt; If the Bourne Supremacy ended with a magic chariot whisking Matt Damon out resulting from a spell a girl yelling \"wingardium leviosa\" That would be wtfness and a really crappy movie, and people would be right to say it's a crappy movie imo.\n\nRight, but that's not what happened here. The monolith was set up as an extraterrestrial object with special powers in the very first scene in the movie.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have to be honest - I am left wondering if you were attempting to multi-task while watching the film.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When does he contact the monolith? After disarming the computer?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Bowman shuts down HAL. He then discovers the message explaining the true purpose of the mission. He continues on to the monolith, takes an EVA pod, and flies to the monolith. That&amp;#39;s when he says &amp;quot;my God, it&amp;#39;s full of stars!&amp;quot; and experiences the &amp;quot;LSD trip&amp;quot; (as you call it) and the weird white room. &lt;em&gt;All of that&lt;/em&gt; is connected to the monolith, not HAL.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But if one moment, magic works, and then it doesn&amp;#39;t, for no good reason, when they didn&amp;#39;t even travel back into the earth world, and his wand is not broken, and he isn&amp;#39;t mysteriously silenced by some unknown spell.... the physics has been broken.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just because you don&amp;#39;t have full information doesn&amp;#39;t mean the &amp;quot;physics is broken&amp;quot;. Bowman entered an object created a &lt;em&gt;very&lt;/em&gt; long time ago by a &lt;em&gt;very&lt;/em&gt; advanced civilization. Very little about that should be immediately comprehensible.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If the Bourne Supremacy ended with a magic chariot whisking Matt Damon out resulting from a spell a girl yelling &amp;quot;wingardium leviosa&amp;quot; That would be wtfness and a really crappy movie, and people would be right to say it&amp;#39;s a crappy movie imo.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Right, but that&amp;#39;s not what happened here. The monolith was set up as an extraterrestrial object with special powers in the very first scene in the movie.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ohtl5", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ohtl5/", "num_reports": null, "stickied": false, "created": 1462146262.0, "author_flair_text": null, "created_utc": 1462117462.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ogja1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2og8ag", "score": 0, "approved_by": null, "downs": 0, "body": "When does he contact the monolith? After disarming the computer?\n\nI guess it comes down to arbitrariness. If it's just something outside his understanding, it could have shown Dave literally anything. But Stanley Kubrik decided to show Dave and the audience these certain images. I can't get around the fact that everything and anything shown from that point is all just random. The selection has a meaning. or more close meaning to certain interpretations over others.\n\nThat interpretation works too. Do you think it's somewhat of a cop-out? I mean it's valid and all, but when we try to evaluate interpretations over another, we give precedence to and say one interpretation is more valid than another if it explains more details, and there is more congruency with other details, just like science and logic. \n\nIf what happened outside of his perspective is so, then why the LSD trip? Wouldn't some sort of induced hallucination explain more details? \n\nIf some other explanation that covered things in more detail, for example his aging somehow being connected to Hal... idk... would be more valid than the hallucination interpretation.\n\nLike we say there is a theme of evolution because the movie opened with apes, and the mysterious black slab was there too, tying all phases of the movie (apes, present, and the aging scene). Therefore we say the evolution or species progress theme is more valid than the explanation of \"oh it's all a dream... since technically any movie can be considered a dream.\"\n\n___________\n\nUnreliable narrators in genera:\n\nThat's fine, it has some semblance in reality, as that's how every single one of us is going through life.\n\nWe can then apply our tools of reasoning and objective logic to figure out how things \"really\" are, according to the rules and physics of that fictional universe. But when the rules of the universe change within that film, without narration, and INCONSISTENTLY.... that's another thing.\n\nTo illustrate, maybe a special wizard casts a super forbidden spell that results in all magic being empty and nonexistent. That's still consistent with the physics of that fictional universe, since it was a spell that eliminates spells.\n\nBut if one moment, magic works, and then it doesn't, for no good reason, when they didn't even travel back into the earth world, and his wand is not broken, and he isn't mysteriously silenced by some unknown spell.... the physics has been broken.\n\n\n\nGetting back on point about unreliable narrators. The Shining does it, Fight club does it, and it's actually a common literary device used in micro-examples throughout various works. Naruto will show selective flashbacks of Gaara's past as he viewed it, with the same emotional undertones. Fine. It can be pieced together, and it can easily be inferred that it's from someone's perspective. This actually models reality, where we hear a rumor according to a person, and that creates a mental model of reality, then we go out and test and analyze that model. \nBut if it's just... things change and you don't know how to interpret it, and there is no way to pin down how to interpret it based on any of the other clues in the movie, then what are we watching? \n\nIf it's not supposed to make sense THEN TELL US IT'S NOT SUPPOSED TO MAKE SENSE.\n\nThat's all I wish. I actually find the lack of such meta-information in normal social communication to be annoying too.  People will say stuff like \"that's inappropriate\", but what they actually mean is they think it's inappropriate based on their working model of ethics, social norms, belief structure, etc.\n\nOr \"that's illogical\" when what they're saying has nothing to do with logic, but rather a projected thing they personally value, and then assume the other person has the same goal and value, but take a different course of action not conducive to achieving that goal/value. Maybe they have some other value; then it's not illogical for them. Presumption of assumptions and projections of those assumptions.\n\nIf the Bourne Supremacy ended with a magic chariot whisking Matt Damon out resulting from a spell a girl yelling \"wingardium leviosa\" That would be wtfness and a really crappy movie, and people would be right to say it's a crappy movie imo.\n", "edited": 1462115890.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;When does he contact the monolith? After disarming the computer?&lt;/p&gt;\n\n&lt;p&gt;I guess it comes down to arbitrariness. If it&amp;#39;s just something outside his understanding, it could have shown Dave literally anything. But Stanley Kubrik decided to show Dave and the audience these certain images. I can&amp;#39;t get around the fact that everything and anything shown from that point is all just random. The selection has a meaning. or more close meaning to certain interpretations over others.&lt;/p&gt;\n\n&lt;p&gt;That interpretation works too. Do you think it&amp;#39;s somewhat of a cop-out? I mean it&amp;#39;s valid and all, but when we try to evaluate interpretations over another, we give precedence to and say one interpretation is more valid than another if it explains more details, and there is more congruency with other details, just like science and logic. &lt;/p&gt;\n\n&lt;p&gt;If what happened outside of his perspective is so, then why the LSD trip? Wouldn&amp;#39;t some sort of induced hallucination explain more details? &lt;/p&gt;\n\n&lt;p&gt;If some other explanation that covered things in more detail, for example his aging somehow being connected to Hal... idk... would be more valid than the hallucination interpretation.&lt;/p&gt;\n\n&lt;p&gt;Like we say there is a theme of evolution because the movie opened with apes, and the mysterious black slab was there too, tying all phases of the movie (apes, present, and the aging scene). Therefore we say the evolution or species progress theme is more valid than the explanation of &amp;quot;oh it&amp;#39;s all a dream... since technically any movie can be considered a dream.&amp;quot;&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Unreliable narrators in genera:&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s fine, it has some semblance in reality, as that&amp;#39;s how every single one of us is going through life.&lt;/p&gt;\n\n&lt;p&gt;We can then apply our tools of reasoning and objective logic to figure out how things &amp;quot;really&amp;quot; are, according to the rules and physics of that fictional universe. But when the rules of the universe change within that film, without narration, and INCONSISTENTLY.... that&amp;#39;s another thing.&lt;/p&gt;\n\n&lt;p&gt;To illustrate, maybe a special wizard casts a super forbidden spell that results in all magic being empty and nonexistent. That&amp;#39;s still consistent with the physics of that fictional universe, since it was a spell that eliminates spells.&lt;/p&gt;\n\n&lt;p&gt;But if one moment, magic works, and then it doesn&amp;#39;t, for no good reason, when they didn&amp;#39;t even travel back into the earth world, and his wand is not broken, and he isn&amp;#39;t mysteriously silenced by some unknown spell.... the physics has been broken.&lt;/p&gt;\n\n&lt;p&gt;Getting back on point about unreliable narrators. The Shining does it, Fight club does it, and it&amp;#39;s actually a common literary device used in micro-examples throughout various works. Naruto will show selective flashbacks of Gaara&amp;#39;s past as he viewed it, with the same emotional undertones. Fine. It can be pieced together, and it can easily be inferred that it&amp;#39;s from someone&amp;#39;s perspective. This actually models reality, where we hear a rumor according to a person, and that creates a mental model of reality, then we go out and test and analyze that model. \nBut if it&amp;#39;s just... things change and you don&amp;#39;t know how to interpret it, and there is no way to pin down how to interpret it based on any of the other clues in the movie, then what are we watching? &lt;/p&gt;\n\n&lt;p&gt;If it&amp;#39;s not supposed to make sense THEN TELL US IT&amp;#39;S NOT SUPPOSED TO MAKE SENSE.&lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s all I wish. I actually find the lack of such meta-information in normal social communication to be annoying too.  People will say stuff like &amp;quot;that&amp;#39;s inappropriate&amp;quot;, but what they actually mean is they think it&amp;#39;s inappropriate based on their working model of ethics, social norms, belief structure, etc.&lt;/p&gt;\n\n&lt;p&gt;Or &amp;quot;that&amp;#39;s illogical&amp;quot; when what they&amp;#39;re saying has nothing to do with logic, but rather a projected thing they personally value, and then assume the other person has the same goal and value, but take a different course of action not conducive to achieving that goal/value. Maybe they have some other value; then it&amp;#39;s not illogical for them. Presumption of assumptions and projections of those assumptions.&lt;/p&gt;\n\n&lt;p&gt;If the Bourne Supremacy ended with a magic chariot whisking Matt Damon out resulting from a spell a girl yelling &amp;quot;wingardium leviosa&amp;quot; That would be wtfness and a really crappy movie, and people would be right to say it&amp;#39;s a crappy movie imo.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ogja1", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ogja1/", "num_reports": null, "stickied": false, "created": 1462143928.0, "author_flair_text": null, "created_utc": 1462115128.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2og8ag", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MikeCharlieUniform", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2of99i", "score": 3, "approved_by": null, "downs": 0, "body": "How do you feel about [unreliable narrators](http://tvtropes.org/pmwiki/pmwiki.php/Main/UnreliableNarrator)?\n\n&gt; I also find it really jarring and confusing (and in turn, annoying) when there are physics-shifts mid-movie. If magic is real OK, good. let's go with that for the movie. But a hallucination and an LSD trip, and then a floating amniotic embryo.... is that supposed to be a dream, literally what's happening, symbolic, projections or intentions of Hal, Hal becoming more human, the life of the human flashing before his eyes?....\n\nThe story is told from Dave Bowman's perspective. He contacts the monolith. What happens next is outside of the box of his understanding.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How do you feel about &lt;a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/UnreliableNarrator\"&gt;unreliable narrators&lt;/a&gt;?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I also find it really jarring and confusing (and in turn, annoying) when there are physics-shifts mid-movie. If magic is real OK, good. let&amp;#39;s go with that for the movie. But a hallucination and an LSD trip, and then a floating amniotic embryo.... is that supposed to be a dream, literally what&amp;#39;s happening, symbolic, projections or intentions of Hal, Hal becoming more human, the life of the human flashing before his eyes?....&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The story is told from Dave Bowman&amp;#39;s perspective. He contacts the monolith. What happens next is outside of the box of his understanding.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og8ag", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2og8ag/", "num_reports": null, "stickied": false, "created": 1462143371.0, "author_flair_text": null, "created_utc": 1462114571.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2ro9ia", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "puppetmaster2501", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2of99i", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; Maybe I'm accustomed to coherent plot, and don't like the \"here's some random images, you figure that sht out\" style of movies.  \n  \nThat's a thing, too. Movies have plots, generally, but they don't *need* to. Some movies rely a lot on complex, layered plots with many twists and exciting reveals to keep you on the edge of your seat -- but that's some movies. A very subdued or even meaningless plot isn't necessarily a worse plot. Plot only exists as a single component among several that make a specific movie a movie.   \n  \nI would guess that you mostly watch movies for the plot, or the action, or something like that. If you haven't, try watching some movies but instead of watching as you might normally watch, thinking about the things you normally think about, try watching with a whole different perspective. Why, just for sake of the exercise of it. Never hurts to think differently.    \n  \nFor example, say you're in some class and a teacher assigns you the task to \"explain how the lighting and camera work in 2001 contributes to the story/theme/message/meaning.\" What would you think about as you watch each scene carefully, pondering how the lighting is? Like what's light, what's dark, and why? Was the lighting very thoughtless, like just, \"let's put these lights here and there to make sure the image doesn't suck and the actors are visible,\" or is there some more roundabout purpose to it all? Same with camera work -- what kinds of shots are there, why close, why far, why focus on this or that, why that angle, why that cut or transition, etc? Do different kinds of angles or focus or whatever change how you see a scene (figuratively as well as literally?) These are either choices made during filming that are kinda haphazard and just happened to get a good view of the action, or they might be very specific, carefully designed choices.    \n  \nYou don't have to go \"symbol-hunting\" with everything, always wondering what the hidden meaning might be behind every camera angle, every lighting arrangement, every prop in the background, every word in the script, etc. Plenty of times there isn't a hidden meaning to be found. But - all of those choices, even if they were relatively arbitrary, they were deliberate, and they can give the viewer a whole lot to think about.  \n  \nI have not personally seen 2001: A Space Odyssey in a very long time. From what I remember, that movie was just beautiful to watch and it felt somehow important.  \n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Maybe I&amp;#39;m accustomed to coherent plot, and don&amp;#39;t like the &amp;quot;here&amp;#39;s some random images, you figure that sht out&amp;quot; style of movies.  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s a thing, too. Movies have plots, generally, but they don&amp;#39;t &lt;em&gt;need&lt;/em&gt; to. Some movies rely a lot on complex, layered plots with many twists and exciting reveals to keep you on the edge of your seat -- but that&amp;#39;s some movies. A very subdued or even meaningless plot isn&amp;#39;t necessarily a worse plot. Plot only exists as a single component among several that make a specific movie a movie.   &lt;/p&gt;\n\n&lt;p&gt;I would guess that you mostly watch movies for the plot, or the action, or something like that. If you haven&amp;#39;t, try watching some movies but instead of watching as you might normally watch, thinking about the things you normally think about, try watching with a whole different perspective. Why, just for sake of the exercise of it. Never hurts to think differently.    &lt;/p&gt;\n\n&lt;p&gt;For example, say you&amp;#39;re in some class and a teacher assigns you the task to &amp;quot;explain how the lighting and camera work in 2001 contributes to the story/theme/message/meaning.&amp;quot; What would you think about as you watch each scene carefully, pondering how the lighting is? Like what&amp;#39;s light, what&amp;#39;s dark, and why? Was the lighting very thoughtless, like just, &amp;quot;let&amp;#39;s put these lights here and there to make sure the image doesn&amp;#39;t suck and the actors are visible,&amp;quot; or is there some more roundabout purpose to it all? Same with camera work -- what kinds of shots are there, why close, why far, why focus on this or that, why that angle, why that cut or transition, etc? Do different kinds of angles or focus or whatever change how you see a scene (figuratively as well as literally?) These are either choices made during filming that are kinda haphazard and just happened to get a good view of the action, or they might be very specific, carefully designed choices.    &lt;/p&gt;\n\n&lt;p&gt;You don&amp;#39;t have to go &amp;quot;symbol-hunting&amp;quot; with everything, always wondering what the hidden meaning might be behind every camera angle, every lighting arrangement, every prop in the background, every word in the script, etc. Plenty of times there isn&amp;#39;t a hidden meaning to be found. But - all of those choices, even if they were relatively arbitrary, they were deliberate, and they can give the viewer a whole lot to think about.  &lt;/p&gt;\n\n&lt;p&gt;I have not personally seen 2001: A Space Odyssey in a very long time. From what I remember, that movie was just beautiful to watch and it felt somehow important.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ro9ia", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ro9ia/", "num_reports": null, "stickied": false, "created": 1462345272.0, "author_flair_text": "2∆", "created_utc": 1462316472.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2of99i", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2of1w3", "score": 1, "approved_by": null, "downs": 0, "body": "I hear you. This is most convincing yet.\n\nA minor nitpick is that I'm not so much expecting all the answers to be provided, so much as it is \"write a coherent question so that I can understand what you're saying\" sort of approach, if that analogy makes sense. Like I'm fine with certain things being omitted, but I don't like it when it's so omitted to the point where it's unclear whether to take something literally or figuratively... or when there are way too many possible explanations that are completely open ended. \n\nMaybe I'm accustomed to coherent plot, and don't like the \"here's some random images, you figure that sht out\" style of movies.\n\nI still think movies aren't quite like songs as you describe. You show a certain series of pictures with a purpose. It's not just because or it makes you feel good. Music is to be enjoyed as is, maybe there is a theme or point behind the lyrics, maybe there isn't. But with this movie, clearly there is, by tying the evolutionary force, and the space  child.\n\nI also find it really jarring and confusing (and in turn, annoying) when there are physics-shifts mid-movie. If magic is real OK, good. let's go with that for the movie. But a hallucination and an LSD trip, and then a floating amniotic embryo.... is that supposed to be a dream, literally what's happening, symbolic, projections or intentions of Hal, Hal becoming more human, the life of the human flashing before his eyes?.... \n\ntoo many possible ways to view the actual thing. Let's pin that down first... is my reaction. It's too confusing, in the bad way.\n\nSo while I totally get the way of approaching movies like music, I can't seem to get over the hump that this movie isn't quite that. There really does seem to be a point being made, and it could have been made, but it's just so implicit.\n\nby the way, why do you call it just \"2001\"?", "edited": 1462112991.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I hear you. This is most convincing yet.&lt;/p&gt;\n\n&lt;p&gt;A minor nitpick is that I&amp;#39;m not so much expecting all the answers to be provided, so much as it is &amp;quot;write a coherent question so that I can understand what you&amp;#39;re saying&amp;quot; sort of approach, if that analogy makes sense. Like I&amp;#39;m fine with certain things being omitted, but I don&amp;#39;t like it when it&amp;#39;s so omitted to the point where it&amp;#39;s unclear whether to take something literally or figuratively... or when there are way too many possible explanations that are completely open ended. &lt;/p&gt;\n\n&lt;p&gt;Maybe I&amp;#39;m accustomed to coherent plot, and don&amp;#39;t like the &amp;quot;here&amp;#39;s some random images, you figure that sht out&amp;quot; style of movies.&lt;/p&gt;\n\n&lt;p&gt;I still think movies aren&amp;#39;t quite like songs as you describe. You show a certain series of pictures with a purpose. It&amp;#39;s not just because or it makes you feel good. Music is to be enjoyed as is, maybe there is a theme or point behind the lyrics, maybe there isn&amp;#39;t. But with this movie, clearly there is, by tying the evolutionary force, and the space  child.&lt;/p&gt;\n\n&lt;p&gt;I also find it really jarring and confusing (and in turn, annoying) when there are physics-shifts mid-movie. If magic is real OK, good. let&amp;#39;s go with that for the movie. But a hallucination and an LSD trip, and then a floating amniotic embryo.... is that supposed to be a dream, literally what&amp;#39;s happening, symbolic, projections or intentions of Hal, Hal becoming more human, the life of the human flashing before his eyes?.... &lt;/p&gt;\n\n&lt;p&gt;too many possible ways to view the actual thing. Let&amp;#39;s pin that down first... is my reaction. It&amp;#39;s too confusing, in the bad way.&lt;/p&gt;\n\n&lt;p&gt;So while I totally get the way of approaching movies like music, I can&amp;#39;t seem to get over the hump that this movie isn&amp;#39;t quite that. There really does seem to be a point being made, and it could have been made, but it&amp;#39;s just so implicit.&lt;/p&gt;\n\n&lt;p&gt;by the way, why do you call it just &amp;quot;2001&amp;quot;?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2of99i", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2of99i/", "num_reports": null, "stickied": false, "created": 1462141407.0, "author_flair_text": null, "created_utc": 1462112607.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2of1w3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DHCKris", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 20, "approved_by": null, "downs": 0, "body": "2001 is one of my favorite films and you (and the website you linked) are approaching it in entirely the wrong way.\n\nOne of my favorite Kubrick quotes goes something like, \"a movie is more like music than it is like fiction.\" What I take this to mean is that while surely you *can* dig deeply into a movie for meaning, as you might analyze a song's lyrics, there is more to it than merely the story that it tells.\n\nI think 2001 is an incredibly simple film to understand. It is a gorgeous feast for the eyes and a marvel in cinematography that presents a number of well-realized science-fiction tropes strung together by a loose narrative. Think of it like instrumental music: maybe it means one thing, maybe it tells a story, but it doesn't matter because the point is that you can turn your brain off and let the melody wash over you.\n\nConstantly expecting a movie, or any art at all, to provide you with answers is a pretty pedestrian way of approaching it. At the end of the day, movies aren't stories, or lectures: they are moving images. 2001 is a great movie because its images are cool and raise questions about our place in the universe and at the same time tell a little narrative about space travel. It's just cool to look at in the same way music is cool to hear.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;2001 is one of my favorite films and you (and the website you linked) are approaching it in entirely the wrong way.&lt;/p&gt;\n\n&lt;p&gt;One of my favorite Kubrick quotes goes something like, &amp;quot;a movie is more like music than it is like fiction.&amp;quot; What I take this to mean is that while surely you &lt;em&gt;can&lt;/em&gt; dig deeply into a movie for meaning, as you might analyze a song&amp;#39;s lyrics, there is more to it than merely the story that it tells.&lt;/p&gt;\n\n&lt;p&gt;I think 2001 is an incredibly simple film to understand. It is a gorgeous feast for the eyes and a marvel in cinematography that presents a number of well-realized science-fiction tropes strung together by a loose narrative. Think of it like instrumental music: maybe it means one thing, maybe it tells a story, but it doesn&amp;#39;t matter because the point is that you can turn your brain off and let the melody wash over you.&lt;/p&gt;\n\n&lt;p&gt;Constantly expecting a movie, or any art at all, to provide you with answers is a pretty pedestrian way of approaching it. At the end of the day, movies aren&amp;#39;t stories, or lectures: they are moving images. 2001 is a great movie because its images are cool and raise questions about our place in the universe and at the same time tell a little narrative about space travel. It&amp;#39;s just cool to look at in the same way music is cool to hear.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2of1w3", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2of1w3/", "num_reports": null, "stickied": false, "created": 1462140968.0, "author_flair_text": "98∆", "created_utc": 1462112168.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 7, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oh5ki", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oervx", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;too much open endedness is meaningless to me.\n\nThis says it all. Some of us love vast open endedness and it just so happens that you don't.\n\n&gt;Confined open-endedness gets us somewhere.\n\nYou're implying that absolute open-endedness can get us nowhere. That isn't true. If I watch a totally open-ended movie and am moved by it, did the movie get me nowhere? No", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;too much open endedness is meaningless to me.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This says it all. Some of us love vast open endedness and it just so happens that you don&amp;#39;t.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Confined open-endedness gets us somewhere.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You&amp;#39;re implying that absolute open-endedness can get us nowhere. That isn&amp;#39;t true. If I watch a totally open-ended movie and am moved by it, did the movie get me nowhere? No&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2oh5ki", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2oh5ki/", "num_reports": null, "stickied": false, "created": 1462145071.0, "author_flair_text": null, "created_utc": 1462116271.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oervx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2odq7c", "score": 1, "approved_by": null, "downs": 0, "body": "fair enough.\n\nI personally don't find it entertaining for the reasons I've mentioned all over the thread. Too much open endedness is meaningless to me. Confined open-endedness gets us somewhere.", "edited": 1462113022.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;fair enough.&lt;/p&gt;\n\n&lt;p&gt;I personally don&amp;#39;t find it entertaining for the reasons I&amp;#39;ve mentioned all over the thread. Too much open endedness is meaningless to me. Confined open-endedness gets us somewhere.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oervx", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2oervx/", "num_reports": null, "stickied": false, "created": 1462140357.0, "author_flair_text": null, "created_utc": 1462111557.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2odq7c", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2odlk1", "score": 2, "approved_by": null, "downs": 0, "body": "That idea doesn't even stand up, at least not in the context of this discussion. \"Substance\" isn't a thing in the realm of entertainment. Entertainment is made to be entertaining, not substantive. If artificial elevation via implicitness is entertaining, then so be it.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That idea doesn&amp;#39;t even stand up, at least not in the context of this discussion. &amp;quot;Substance&amp;quot; isn&amp;#39;t a thing in the realm of entertainment. Entertainment is made to be entertaining, not substantive. If artificial elevation via implicitness is entertaining, then so be it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2odq7c", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2odq7c/", "num_reports": null, "stickied": false, "created": 1462137962.0, "author_flair_text": null, "created_utc": 1462109162.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2odlk1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ocpda", "score": 1, "approved_by": null, "downs": 0, "body": "My point and purpose with mentioning Feynman's idea (not Feynman himself) is not so much regarding philosophy as a discipline as it is about the specific point about substance vs jargon. substance vs pretentiousness. substance vs artificial elevation via implicitness.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;My point and purpose with mentioning Feynman&amp;#39;s idea (not Feynman himself) is not so much regarding philosophy as a discipline as it is about the specific point about substance vs jargon. substance vs pretentiousness. substance vs artificial elevation via implicitness.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2odlk1", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2odlk1/", "num_reports": null, "stickied": false, "created": 1462137665.0, "author_flair_text": null, "created_utc": 1462108865.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "more", "data": {"count": 4, "name": "t1_d2pfcff", "id": "d2pfcff", "parent_id": "t1_d2ocpda", "depth": 1, "children": ["d2pfcff"]}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ocpda", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 7, "approved_by": null, "downs": 0, "body": "Movies and art in general are not necessarily about proving a point or making an argument. Sometimes the artists are just going for an emotional impact. If they have to pad their work with jargon in order to achieve that impact, that's not a bad thing as long as the viewer is getting something out of the work. In the end, 2001 is not a dissertation, it's entertainment.\n\nAlso, I wouldn't take advice from Feynman when it comes to stuff near the realm of philosophy. A guy that dismissed philosophy on the basis of stereotypes and mocked Spinoza is not someone that understood humanity's relation to reality.", "edited": 1462106693.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Movies and art in general are not necessarily about proving a point or making an argument. Sometimes the artists are just going for an emotional impact. If they have to pad their work with jargon in order to achieve that impact, that&amp;#39;s not a bad thing as long as the viewer is getting something out of the work. In the end, 2001 is not a dissertation, it&amp;#39;s entertainment.&lt;/p&gt;\n\n&lt;p&gt;Also, I wouldn&amp;#39;t take advice from Feynman when it comes to stuff near the realm of philosophy. A guy that dismissed philosophy on the basis of stereotypes and mocked Spinoza is not someone that understood humanity&amp;#39;s relation to reality.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2ocpda", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ocpda/", "num_reports": null, "stickied": false, "created": 1462135252.0, "author_flair_text": null, "created_utc": 1462106452.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2og69l", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Bl0bbydude", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2od2d6", "score": 1, "approved_by": null, "downs": 0, "body": "Okay, I'll try to clear some stuff up about the storyline. \nI will tell you this straight off: I wasn't a big fan of the movie, it was okay. The book series is fantastic, and I'm pulling most of this from the books. \n\nThe Monoliths are the technology from another ancient alone civilization. These aliens are incredibly old, and consider themselves 'farmers' of the universe. The Monoliths are tools to guide civilizations through evolution. The 'Star Child' isn't a literal child, just the next step for Dave. (And HAL too actually, it's complicated.) I'm hoping you'll read the books, so I won't break down the Monoliths any more. \n\nUltimately I think the movie is an adaptation of the first book for people who have read the first book. I happened to see the movie before reading the books, and my experience was much the same. The movie really should have included more information, but it is a dense book. \n\nTL;DR Read the book. It's great.  ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Okay, I&amp;#39;ll try to clear some stuff up about the storyline. \nI will tell you this straight off: I wasn&amp;#39;t a big fan of the movie, it was okay. The book series is fantastic, and I&amp;#39;m pulling most of this from the books. &lt;/p&gt;\n\n&lt;p&gt;The Monoliths are the technology from another ancient alone civilization. These aliens are incredibly old, and consider themselves &amp;#39;farmers&amp;#39; of the universe. The Monoliths are tools to guide civilizations through evolution. The &amp;#39;Star Child&amp;#39; isn&amp;#39;t a literal child, just the next step for Dave. (And HAL too actually, it&amp;#39;s complicated.) I&amp;#39;m hoping you&amp;#39;ll read the books, so I won&amp;#39;t break down the Monoliths any more. &lt;/p&gt;\n\n&lt;p&gt;Ultimately I think the movie is an adaptation of the first book for people who have read the first book. I happened to see the movie before reading the books, and my experience was much the same. The movie really should have included more information, but it is a dense book. &lt;/p&gt;\n\n&lt;p&gt;TL;DR Read the book. It&amp;#39;s great.  &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og69l", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2og69l/", "num_reports": null, "stickied": false, "created": 1462143262.0, "author_flair_text": null, "created_utc": 1462114462.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2og5b1", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MikeCharlieUniform", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2od2d6", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; Are we to take it that that thing is what made apes into humans as opposed to natural evolution itself? come on, big pill to swallow there.\n\nThe apes touched the monolith, and then discovered tools. Yup - that spark of intelligence is supposed to have been imparted by the monolith.\n\n&gt; And why would you need that mysterious thing at all? It would still happen without it.\n\nThat's not how evolution works. It's not a directed process that *necessarily* leads to more complex, more capable species.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Are we to take it that that thing is what made apes into humans as opposed to natural evolution itself? come on, big pill to swallow there.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The apes touched the monolith, and then discovered tools. Yup - that spark of intelligence is supposed to have been imparted by the monolith.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;And why would you need that mysterious thing at all? It would still happen without it.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That&amp;#39;s not how evolution works. It&amp;#39;s not a directed process that &lt;em&gt;necessarily&lt;/em&gt; leads to more complex, more capable species.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og5b1", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2og5b1/", "num_reports": null, "stickied": false, "created": 1462143212.0, "author_flair_text": null, "created_utc": 1462114412.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2od2d6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ocqdg", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; Regarding the collapse of the AI: i believe the premise is that he's disconnecting hal's different functions from the central processor, one at a time, like cutting off limbs. Either way, artistic licence. It makes the scene more dramatic. Sometimes accuracy makes for boring storytelling, like when people answer a phone and jump immediately into a conversation. Either way, it was the 1960s did people know the theoretical architecture of AI or how it would work then? Does it matter?\n\nIt matters because it confused me as to what to take literally vs figuratively. Right after that scene, it goes into and LSD trip, and then it goes into a very physics-violating scene in the room. I was also confused about whether the AI was intentionally scheming a takeover vs simply malfunctioning. \n\nBut only later do I find by watching the explanation video series that the particular interpretation it took was by taking certain things literally and other things figuratively. But you can only get there by assuming so. If you don't have the luxury of hindsight, it's not clear what's literal or not.\n\n&gt; As far as the star child, this isnt out of the blue, nor is it Illogical within the frame of the movie. The book explains that the monolith was there to spurr human evolution to eventually elevate the species to another plane of existance. Dave was just the first specimen. In the second book, they use the monoliths to condense jupiter into a small star to aid the aquarian life living on ganymede (i think).\nThe star child conversion is the climax of the story, we see the mysterious monolith as a mysterious motiff, first giving apes some kind of agency and spurring intelligence, then burried under the surface of the moon, waiting to be discovered, and finally on jupiter (saturn in the first book). The whole time, we're wondering \"what is it? Why? What are the motivations?\" And we're given an answer.\n\nI guess the theme of evolution makes sense. The mysterious thing was there during the primitive homonids time period, and presumably it helped them evolve. So it would be doing the same thing in space. But the movie doesn't explain that at all. It's very implicit. Are we to take it that that thing is what made apes into humans as opposed to natural evolution itself? come on, big pill to swallow there. And why would you need that mysterious thing at all? It would still happen without it. Or is that thing purely symbolic, not alien life? If it is merely symbolic and not alien life, then why did they actually see that thing, and why did that thing actually exist in the time of the apes, and why did the mission itself cite alien technology? inconsistencies...\n\nTo be honest, do you know what this open ended, yet authoritative narrative feels like? Religious texts. So many empty details, contradictory goose chases, yet claims to be so authoritative and true.\n\nI don't think what you wrote adequately explains that it's not out of the blue. Babies need females. There were no females. Hal killed everyone else sleeping in the pods. Who is going to feed the baby? Hal has no motor control of physical objects in the ship that would be able to take care of the baby.  It was floating in the fking air on the bed exposed to the air.  It happened in the scene where things were disappearing. It was after the LSD trip. And at no point in time after the LSD trip did we ever get back to physics-obeying reality, something that would indicate that the entire thing isn't a hallucination, a dream, or anything like that. Who is to say that the entire LSD trip wasn't something the alien tech induced at that moment, and then everything after that was a dream? So yea, that's pretty out of the blue. \n\n&gt; Its an illustration of fear and wonder. You're floating through space, a completely inhospitable, hazardous environment, inches away from instant death, and youre completely dependant on an autonomous piece of Technology, that suddenly wants you dead.\n\nThis much is clear to me. It was my emotional experience, and it was during the part where there was no supernatural or alien or physics-defying things going on.\n\n\nWhat I think is, instead of making all the philosophical points WITHIN the reality and physics originally set in the beginning of the movie, like the Matrix does, changing up the physics of a segment of a movie I think is a copout and lazy way for the movie maker to inject symbolism to explain and make his point. I think it's a literary (or filmic) device to make a point without doing it in words. I personally think it's lazy, since you can do it within the confines of the originally allowed set of rules and physics without swtiching them up mid-movie, like the Matrix, and many other good movies does. It's more restrictive, and takes more work, and is tighter. Like engineering, like a completely symmetric mathematical equation. Like the helicentric model without circles within circles that the geocentric model had to use. Occam's razor. Good code. Like a haiku that isn't like \"YO, I'm going to add another mofo-ing line of .... let's say... 29 sylllables! And it's still going to be called a haiku, yo\"", "edited": 1462108751.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Regarding the collapse of the AI: i believe the premise is that he&amp;#39;s disconnecting hal&amp;#39;s different functions from the central processor, one at a time, like cutting off limbs. Either way, artistic licence. It makes the scene more dramatic. Sometimes accuracy makes for boring storytelling, like when people answer a phone and jump immediately into a conversation. Either way, it was the 1960s did people know the theoretical architecture of AI or how it would work then? Does it matter?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It matters because it confused me as to what to take literally vs figuratively. Right after that scene, it goes into and LSD trip, and then it goes into a very physics-violating scene in the room. I was also confused about whether the AI was intentionally scheming a takeover vs simply malfunctioning. &lt;/p&gt;\n\n&lt;p&gt;But only later do I find by watching the explanation video series that the particular interpretation it took was by taking certain things literally and other things figuratively. But you can only get there by assuming so. If you don&amp;#39;t have the luxury of hindsight, it&amp;#39;s not clear what&amp;#39;s literal or not.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;As far as the star child, this isnt out of the blue, nor is it Illogical within the frame of the movie. The book explains that the monolith was there to spurr human evolution to eventually elevate the species to another plane of existance. Dave was just the first specimen. In the second book, they use the monoliths to condense jupiter into a small star to aid the aquarian life living on ganymede (i think).\nThe star child conversion is the climax of the story, we see the mysterious monolith as a mysterious motiff, first giving apes some kind of agency and spurring intelligence, then burried under the surface of the moon, waiting to be discovered, and finally on jupiter (saturn in the first book). The whole time, we&amp;#39;re wondering &amp;quot;what is it? Why? What are the motivations?&amp;quot; And we&amp;#39;re given an answer.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I guess the theme of evolution makes sense. The mysterious thing was there during the primitive homonids time period, and presumably it helped them evolve. So it would be doing the same thing in space. But the movie doesn&amp;#39;t explain that at all. It&amp;#39;s very implicit. Are we to take it that that thing is what made apes into humans as opposed to natural evolution itself? come on, big pill to swallow there. And why would you need that mysterious thing at all? It would still happen without it. Or is that thing purely symbolic, not alien life? If it is merely symbolic and not alien life, then why did they actually see that thing, and why did that thing actually exist in the time of the apes, and why did the mission itself cite alien technology? inconsistencies...&lt;/p&gt;\n\n&lt;p&gt;To be honest, do you know what this open ended, yet authoritative narrative feels like? Religious texts. So many empty details, contradictory goose chases, yet claims to be so authoritative and true.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think what you wrote adequately explains that it&amp;#39;s not out of the blue. Babies need females. There were no females. Hal killed everyone else sleeping in the pods. Who is going to feed the baby? Hal has no motor control of physical objects in the ship that would be able to take care of the baby.  It was floating in the fking air on the bed exposed to the air.  It happened in the scene where things were disappearing. It was after the LSD trip. And at no point in time after the LSD trip did we ever get back to physics-obeying reality, something that would indicate that the entire thing isn&amp;#39;t a hallucination, a dream, or anything like that. Who is to say that the entire LSD trip wasn&amp;#39;t something the alien tech induced at that moment, and then everything after that was a dream? So yea, that&amp;#39;s pretty out of the blue. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Its an illustration of fear and wonder. You&amp;#39;re floating through space, a completely inhospitable, hazardous environment, inches away from instant death, and youre completely dependant on an autonomous piece of Technology, that suddenly wants you dead.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This much is clear to me. It was my emotional experience, and it was during the part where there was no supernatural or alien or physics-defying things going on.&lt;/p&gt;\n\n&lt;p&gt;What I think is, instead of making all the philosophical points WITHIN the reality and physics originally set in the beginning of the movie, like the Matrix does, changing up the physics of a segment of a movie I think is a copout and lazy way for the movie maker to inject symbolism to explain and make his point. I think it&amp;#39;s a literary (or filmic) device to make a point without doing it in words. I personally think it&amp;#39;s lazy, since you can do it within the confines of the originally allowed set of rules and physics without swtiching them up mid-movie, like the Matrix, and many other good movies does. It&amp;#39;s more restrictive, and takes more work, and is tighter. Like engineering, like a completely symmetric mathematical equation. Like the helicentric model without circles within circles that the geocentric model had to use. Occam&amp;#39;s razor. Good code. Like a haiku that isn&amp;#39;t like &amp;quot;YO, I&amp;#39;m going to add another mofo-ing line of .... let&amp;#39;s say... 29 sylllables! And it&amp;#39;s still going to be called a haiku, yo&amp;quot;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2od2d6", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2od2d6/", "num_reports": null, "stickied": false, "created": 1462136277.0, "author_flair_text": null, "created_utc": 1462107477.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ocqdg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "MontiBurns", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 2, "approved_by": null, "downs": 0, "body": "Before we begin, its important to remember that this was a work of fiction from the 1960s.  Its also regarded as the first mainstream feature film attempt at \"serious\" scifi, not campy aliens, robots, and spacebattles.  That doesnt make it hard scifi.  The opening scene with the apes and the monolith establish this right off the bat.  Its pretty soft as far the science goes, thats an artistic choice, it doesnt make it bad or inaccurate.\n\nRegarding the collapse of the AI: i believe the premise is that he's disconnecting hal's different functions from the central processor, one at a time, like cutting off limbs.  Either way, artistic licence.  It makes the scene more dramatic.  Sometimes accuracy makes for boring storytelling, like when people answer a phone and jump immediately into a conversation.  Either way, it was the 1960s did people know the theoretical architecture of AI or how it would work then?  Does it matter?\n\nRegarding Hals behavior, the reason explained by the book was that hal was the only member of the crew told the entire reason and objectives for the mission.  The thought was that telling them about the monolith and the inevitable presence of alien life could cause them to unravel.  The ai was also told to protect the crew and act in their best interests, two completely contradictory orders that led to a kind of insanity where the ai determined the best course of action was to kill the crew and take over the mission itself.  Again, soft scifi, the theme thats being explored is the moral compass, or lackthereof, of AIs.  Its an illustration of fear and wonder.  You're floating through space, a completely inhospitable, hazardous environment, inches away from instant death, and youre completely dependant on an autonomous piece of Technology, that suddenly wants you dead.\n\nAs far as the star child, this isnt out of the blue, nor is it Illogical within the frame of the movie. The book explains that the monolith was there to spurr human evolution to eventually elevate the species to another plane of existance.  Dave was just the first specimen.  In the second book, they use the monoliths to condense jupiter into a small star to aid the aquarian life living on ganymede (i think).\n\nThe star child conversion is the climax of the story, we see the mysterious monolith as a mysterious motiff, first giving apes some kind of agency and spurring intelligence, then burried under the surface of the moon, waiting to be discovered, and finally on jupiter (saturn in the first book).  The whole time, we're wondering \"what is it? Why?  What are the motivations?\"  And we're given an answer.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Before we begin, its important to remember that this was a work of fiction from the 1960s.  Its also regarded as the first mainstream feature film attempt at &amp;quot;serious&amp;quot; scifi, not campy aliens, robots, and spacebattles.  That doesnt make it hard scifi.  The opening scene with the apes and the monolith establish this right off the bat.  Its pretty soft as far the science goes, thats an artistic choice, it doesnt make it bad or inaccurate.&lt;/p&gt;\n\n&lt;p&gt;Regarding the collapse of the AI: i believe the premise is that he&amp;#39;s disconnecting hal&amp;#39;s different functions from the central processor, one at a time, like cutting off limbs.  Either way, artistic licence.  It makes the scene more dramatic.  Sometimes accuracy makes for boring storytelling, like when people answer a phone and jump immediately into a conversation.  Either way, it was the 1960s did people know the theoretical architecture of AI or how it would work then?  Does it matter?&lt;/p&gt;\n\n&lt;p&gt;Regarding Hals behavior, the reason explained by the book was that hal was the only member of the crew told the entire reason and objectives for the mission.  The thought was that telling them about the monolith and the inevitable presence of alien life could cause them to unravel.  The ai was also told to protect the crew and act in their best interests, two completely contradictory orders that led to a kind of insanity where the ai determined the best course of action was to kill the crew and take over the mission itself.  Again, soft scifi, the theme thats being explored is the moral compass, or lackthereof, of AIs.  Its an illustration of fear and wonder.  You&amp;#39;re floating through space, a completely inhospitable, hazardous environment, inches away from instant death, and youre completely dependant on an autonomous piece of Technology, that suddenly wants you dead.&lt;/p&gt;\n\n&lt;p&gt;As far as the star child, this isnt out of the blue, nor is it Illogical within the frame of the movie. The book explains that the monolith was there to spurr human evolution to eventually elevate the species to another plane of existance.  Dave was just the first specimen.  In the second book, they use the monoliths to condense jupiter into a small star to aid the aquarian life living on ganymede (i think).&lt;/p&gt;\n\n&lt;p&gt;The star child conversion is the climax of the story, we see the mysterious monolith as a mysterious motiff, first giving apes some kind of agency and spurring intelligence, then burried under the surface of the moon, waiting to be discovered, and finally on jupiter (saturn in the first book).  The whole time, we&amp;#39;re wondering &amp;quot;what is it? Why?  What are the motivations?&amp;quot;  And we&amp;#39;re given an answer.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ocqdg", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ocqdg/", "num_reports": null, "stickied": false, "created": 1462135337.0, "author_flair_text": "107∆", "created_utc": 1462106537.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2og89s", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gyroda", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oeqmr", "score": 2, "approved_by": null, "downs": 0, "body": "&gt; doing that erodes the value of the film\n\nSurely getting people to think about an idea has some value?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;doing that erodes the value of the film&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Surely getting people to think about an idea has some value?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og89s", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2og89s/", "num_reports": null, "stickied": false, "created": 1462143370.0, "author_flair_text": "12∆", "created_utc": 1462114570.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 6, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oeqmr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2od6dg", "score": 1, "approved_by": null, "downs": 0, "body": "I think then, doing that erodes the value of the film. Being too open ended, is like having no film at all. \n\nInfinite interpretations exist for everything.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think then, doing that erodes the value of the film. Being too open ended, is like having no film at all. &lt;/p&gt;\n\n&lt;p&gt;Infinite interpretations exist for everything.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oeqmr", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2oeqmr/", "num_reports": null, "stickied": false, "created": 1462140281.0, "author_flair_text": null, "created_utc": 1462111481.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2od6dg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "jeanfelixpiccard", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ocg0m", "score": 3, "approved_by": null, "downs": 0, "body": "The film is not meant to be an exact philosophical statement. It *may* lead to philosophical thinking, but that is up to the viewer. Everyone has a different experience of the film, don't let yourself be fooled by someone who wants to impose on you how to interpret the film.\n\nIf you say that these are just random sequences put together, then yours would be a valid interpretation of the film, as valid as any other, because art is a subjective experience. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;The film is not meant to be an exact philosophical statement. It &lt;em&gt;may&lt;/em&gt; lead to philosophical thinking, but that is up to the viewer. Everyone has a different experience of the film, don&amp;#39;t let yourself be fooled by someone who wants to impose on you how to interpret the film.&lt;/p&gt;\n\n&lt;p&gt;If you say that these are just random sequences put together, then yours would be a valid interpretation of the film, as valid as any other, because art is a subjective experience. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2od6dg", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2od6dg/", "num_reports": null, "stickied": false, "created": 1462136588.0, "author_flair_text": null, "created_utc": 1462107788.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ocg0m", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ocb7a", "score": 3, "approved_by": null, "downs": 0, "body": "yes. \n\nThe qualm I have about that though is this extreme counterexample:\n\nWe can stitch together random scenes and slides, and that would have even more room for interpretation. \n\nIf the criteria is strictly greater variety of interpretation, then the most disparate, nonsensical stitching of images and sounds should be liked more by that person.\n\nMicroexample:\n\na picture of a rock for 5 minutes. Then a party.\n\nintepretations:\n\n1) oh, you see, there was simplicity, now there is complexity.\n\n2) there was no joy, now there is joy. No emotion, now emotion.\n\n3) stillness, now liveliness.\n\n4) boringness, now fun.\n\n5) that deadness lasts for a long time, but live is short and more precious.\n\n6) that this mirrors our evolutionary history, where most of it was simple and inactive, and non-living, and our flourishing of life is a relatively short-lived state in the grand scheme of the universe's timeline.\n\nIt's endless. and it's stupid.\n\nThe value of having many interpretations comes in once possibilities are restricted enough to a point. I think this comes in the form of how the plot can be interpreted as opposed to philosophical interpretation.\n\nLike, in certain movies, we can interpret that a character did X Y Z in the unshown scenes because of this logic that logic, and that scene which would be consistent with that hypothesis... you see.\n\nBut if it's like philosophical stuff, like that gigantic amniotic egg in the bed representing a new space man.... come on. Why not draw the lesson that man is bigger, since that fetus was huge? Does the hugeness have meaning? Why was it depicted that way? Or is the size of it immaterial? How do we know what is core to the philosophical thesis and what is not? Why is it on the bed? Is the bed supposed to symbolize a mechanical, technological motherhood replacing biological, emotional, organic motherhood? The fetus suddenly appeared, with no explanation as to how it got there. Is that supposed to represent the rapid evolution of humanity in the new age? Or is it completely just a bypassing of details by the director to focus on his actual intended thesis, the new age technological baby born in space, the new ocean? And who is to decide the actual intended meaning or interpretation? Back to square one. \n\n\nIt's endless, and stupid. You can draw whatever you want based on any detail. It needs to be more confined and restricted, and not be about completely open ended philosophy. When things are open ended like this, it has all the problems that religious interpretation has, and the reason why we decoupled it from power and decision-making in the public sphere. Who is to say a thesis about those minutia I chose to focus on is better or worse than things that seem and resonate more true, or make a more meaningful paper? Just because something seems more meaningful doesn't meant it's more correct or better. We see this fallacy in action all the time with religion, or personification, and religious interpretation of the results of evolution.", "edited": 1462106422.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;yes. &lt;/p&gt;\n\n&lt;p&gt;The qualm I have about that though is this extreme counterexample:&lt;/p&gt;\n\n&lt;p&gt;We can stitch together random scenes and slides, and that would have even more room for interpretation. &lt;/p&gt;\n\n&lt;p&gt;If the criteria is strictly greater variety of interpretation, then the most disparate, nonsensical stitching of images and sounds should be liked more by that person.&lt;/p&gt;\n\n&lt;p&gt;Microexample:&lt;/p&gt;\n\n&lt;p&gt;a picture of a rock for 5 minutes. Then a party.&lt;/p&gt;\n\n&lt;p&gt;intepretations:&lt;/p&gt;\n\n&lt;p&gt;1) oh, you see, there was simplicity, now there is complexity.&lt;/p&gt;\n\n&lt;p&gt;2) there was no joy, now there is joy. No emotion, now emotion.&lt;/p&gt;\n\n&lt;p&gt;3) stillness, now liveliness.&lt;/p&gt;\n\n&lt;p&gt;4) boringness, now fun.&lt;/p&gt;\n\n&lt;p&gt;5) that deadness lasts for a long time, but live is short and more precious.&lt;/p&gt;\n\n&lt;p&gt;6) that this mirrors our evolutionary history, where most of it was simple and inactive, and non-living, and our flourishing of life is a relatively short-lived state in the grand scheme of the universe&amp;#39;s timeline.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s endless. and it&amp;#39;s stupid.&lt;/p&gt;\n\n&lt;p&gt;The value of having many interpretations comes in once possibilities are restricted enough to a point. I think this comes in the form of how the plot can be interpreted as opposed to philosophical interpretation.&lt;/p&gt;\n\n&lt;p&gt;Like, in certain movies, we can interpret that a character did X Y Z in the unshown scenes because of this logic that logic, and that scene which would be consistent with that hypothesis... you see.&lt;/p&gt;\n\n&lt;p&gt;But if it&amp;#39;s like philosophical stuff, like that gigantic amniotic egg in the bed representing a new space man.... come on. Why not draw the lesson that man is bigger, since that fetus was huge? Does the hugeness have meaning? Why was it depicted that way? Or is the size of it immaterial? How do we know what is core to the philosophical thesis and what is not? Why is it on the bed? Is the bed supposed to symbolize a mechanical, technological motherhood replacing biological, emotional, organic motherhood? The fetus suddenly appeared, with no explanation as to how it got there. Is that supposed to represent the rapid evolution of humanity in the new age? Or is it completely just a bypassing of details by the director to focus on his actual intended thesis, the new age technological baby born in space, the new ocean? And who is to decide the actual intended meaning or interpretation? Back to square one. &lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s endless, and stupid. You can draw whatever you want based on any detail. It needs to be more confined and restricted, and not be about completely open ended philosophy. When things are open ended like this, it has all the problems that religious interpretation has, and the reason why we decoupled it from power and decision-making in the public sphere. Who is to say a thesis about those minutia I chose to focus on is better or worse than things that seem and resonate more true, or make a more meaningful paper? Just because something seems more meaningful doesn&amp;#39;t meant it&amp;#39;s more correct or better. We see this fallacy in action all the time with religion, or personification, and religious interpretation of the results of evolution.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ocg0m", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ocg0m/", "num_reports": null, "stickied": false, "created": 1462134480.0, "author_flair_text": null, "created_utc": 1462105680.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ocb7a", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "jeanfelixpiccard", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oc5xs", "score": 3, "approved_by": null, "downs": 0, "body": "Could you entertain the thought that there might exist a person on earth who sees 2001 as their favorite film precisely because it is more vague and allows for more interpretation?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Could you entertain the thought that there might exist a person on earth who sees 2001 as their favorite film precisely because it is more vague and allows for more interpretation?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ocb7a", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ocb7a/", "num_reports": null, "stickied": false, "created": 1462134086.0, "author_flair_text": null, "created_utc": 1462105286.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oc5xs", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2obx2n", "score": 1, "approved_by": null, "downs": 0, "body": "I'm not quite sure where you're going with this, or how what I liked has anything to do with a particular film or style of films having specific negative characteristics, but I'll bite.\n\nI liked The Matrix. \n\n1) Its philosophical meanings were much more evident. The presentation is logically coherent (if you're going into a virtual world, it's clearly demonstrated).  The boundaries between what the viewer is to take literally vs figuratively is very clear. You can have an awesome thesis, but obscuring the steps doesn't make the thesis any better, nor make a bad thesis good. The types of movies I'm objecting to mostly rely on obscuring to raise their value, as opposed to having something good to say in the first place.\n\n2) The philosophy was also optional; you could enjoy the film for the action and story even if you didn't care at all about the message behind it. \n\nBut those are things to not hate the movie for, rather than reasons to like it.\n\n\nTo break down the reasons for why I liked the matrix are a few, some mechanical, others philosophical:\n\nIt's obviously a very well executed film in terms of graphics, cinematography, and just an enjoyable experience.\n\nPhilosophically, the themes happen to agree with my viewpoints. I value truth and more accurate perspectives. I think there is a lot of sht and propaganda that we swallow and think is true and agree with for a variety of reasons rooted in conditioning and hacking the mind... that when examined with the reliable tool of logic, turn out to be contradictory. And I think having correct perspectives and ways of looking at things, and determining what is true is the tools for engineering good societies (whatever that means), and detecting exploitative parasites, especially the ones with so much power in charge of the state).\n\nIf the Matrix had been presented in a very implicit way, like you could not tell clearly if they were in the matrix or outside of it, then I'd give it the same \"too implicit\" flag. If each scene took so unnecessarily long, I'd call it out just like I called out the A Space Odyssey. If it had been ambiguous about what the viewer should take as literal occurrence vs metaphor, I'd give it the same complaints. If it was strictly metaphorical, but the metaphor could have many different meanings, then I'd also call that stupid. You have a clear intention, so pin it down. Unless your point is to be ambiguous and open ended. If you really want to do that, then be clear about THAT, and say that that's what you're doing. and if you're going to do that, then for the love of boobs, have the courtesy and straightforwardness to clearly convey what we are to take metaphorically vs literally.\n\nIt's more of the specific practices in pretentious and academic film making that I find so annoying and utterly pointless.\n\nIt's like writing a mathematical proof by skipping steps. It's like writing a paragraph with missing sentences. It's like giving a presentation without key slides...... and then patting yourself on the back for it, and calling that \"artistic\" and \"deep\". No, that's just lazy and skipping steps... and if you pat yourself on the back for it, pretentious.", "edited": 1462105585.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not quite sure where you&amp;#39;re going with this, or how what I liked has anything to do with a particular film or style of films having specific negative characteristics, but I&amp;#39;ll bite.&lt;/p&gt;\n\n&lt;p&gt;I liked The Matrix. &lt;/p&gt;\n\n&lt;p&gt;1) Its philosophical meanings were much more evident. The presentation is logically coherent (if you&amp;#39;re going into a virtual world, it&amp;#39;s clearly demonstrated).  The boundaries between what the viewer is to take literally vs figuratively is very clear. You can have an awesome thesis, but obscuring the steps doesn&amp;#39;t make the thesis any better, nor make a bad thesis good. The types of movies I&amp;#39;m objecting to mostly rely on obscuring to raise their value, as opposed to having something good to say in the first place.&lt;/p&gt;\n\n&lt;p&gt;2) The philosophy was also optional; you could enjoy the film for the action and story even if you didn&amp;#39;t care at all about the message behind it. &lt;/p&gt;\n\n&lt;p&gt;But those are things to not hate the movie for, rather than reasons to like it.&lt;/p&gt;\n\n&lt;p&gt;To break down the reasons for why I liked the matrix are a few, some mechanical, others philosophical:&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s obviously a very well executed film in terms of graphics, cinematography, and just an enjoyable experience.&lt;/p&gt;\n\n&lt;p&gt;Philosophically, the themes happen to agree with my viewpoints. I value truth and more accurate perspectives. I think there is a lot of sht and propaganda that we swallow and think is true and agree with for a variety of reasons rooted in conditioning and hacking the mind... that when examined with the reliable tool of logic, turn out to be contradictory. And I think having correct perspectives and ways of looking at things, and determining what is true is the tools for engineering good societies (whatever that means), and detecting exploitative parasites, especially the ones with so much power in charge of the state).&lt;/p&gt;\n\n&lt;p&gt;If the Matrix had been presented in a very implicit way, like you could not tell clearly if they were in the matrix or outside of it, then I&amp;#39;d give it the same &amp;quot;too implicit&amp;quot; flag. If each scene took so unnecessarily long, I&amp;#39;d call it out just like I called out the A Space Odyssey. If it had been ambiguous about what the viewer should take as literal occurrence vs metaphor, I&amp;#39;d give it the same complaints. If it was strictly metaphorical, but the metaphor could have many different meanings, then I&amp;#39;d also call that stupid. You have a clear intention, so pin it down. Unless your point is to be ambiguous and open ended. If you really want to do that, then be clear about THAT, and say that that&amp;#39;s what you&amp;#39;re doing. and if you&amp;#39;re going to do that, then for the love of boobs, have the courtesy and straightforwardness to clearly convey what we are to take metaphorically vs literally.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s more of the specific practices in pretentious and academic film making that I find so annoying and utterly pointless.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s like writing a mathematical proof by skipping steps. It&amp;#39;s like writing a paragraph with missing sentences. It&amp;#39;s like giving a presentation without key slides...... and then patting yourself on the back for it, and calling that &amp;quot;artistic&amp;quot; and &amp;quot;deep&amp;quot;. No, that&amp;#39;s just lazy and skipping steps... and if you pat yourself on the back for it, pretentious.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oc5xs", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2oc5xs/", "num_reports": null, "stickied": false, "created": 1462133647.0, "author_flair_text": null, "created_utc": 1462104847.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2obx2n", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "jeanfelixpiccard", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 3, "approved_by": null, "downs": 0, "body": "Tell us which film you liked. What is your most favorite film ever?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Tell us which film you liked. What is your most favorite film ever?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2obx2n", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2obx2n/", "num_reports": null, "stickied": false, "created": 1462132871.0, "author_flair_text": null, "created_utc": 1462104071.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2og6he", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Hq3473", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ofkc3", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;I assumed it was content data\n\nWell, when you assume - you make an ass of u and me.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I assumed it was content data&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Well, when you assume - you make an ass of u and me.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og6he", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2og6he/", "num_reports": null, "stickied": false, "created": 1462143273.0, "author_flair_text": "201∆", "created_utc": 1462114473.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ofkc3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2od09f", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;  particular interpretation it took was by taking certain things literally and other things figuratively. But you can only get there by assu\n\nright it wasn't exactly clear what he was disconnecting. I assumed it was content data, as opposed to various intercommuncation performance enhancing modules, or RAM, or other such things that could result in throttling or slowing.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;particular interpretation it took was by taking certain things literally and other things figuratively. But you can only get there by assu&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;right it wasn&amp;#39;t exactly clear what he was disconnecting. I assumed it was content data, as opposed to various intercommuncation performance enhancing modules, or RAM, or other such things that could result in throttling or slowing.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ofkc3", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ofkc3/", "num_reports": null, "stickied": false, "created": 1462142058.0, "author_flair_text": null, "created_utc": 1462113258.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2od09f", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Hq3473", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 2, "approved_by": null, "downs": 0, "body": "&gt;And as the human disconnects memory modules, Hal900 talks more slowly? That's not how computers work. It would be instantly corrupted, and stop. \n\nHall900 is probably some kind of neural network programmed AI with many processors.\n\nIf you start disconnecting parts of neural network one at a time,  it could still function, but functioning would get slower and slower as less processors becomd available.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;And as the human disconnects memory modules, Hal900 talks more slowly? That&amp;#39;s not how computers work. It would be instantly corrupted, and stop. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Hall900 is probably some kind of neural network programmed AI with many processors.&lt;/p&gt;\n\n&lt;p&gt;If you start disconnecting parts of neural network one at a time,  it could still function, but functioning would get slower and slower as less processors becomd available.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2od09f", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2od09f/", "num_reports": null, "stickied": false, "created": 1462136116.0, "author_flair_text": "201∆", "created_utc": 1462107316.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 4, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2owwc6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "NuclearStudent", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 4, "approved_by": null, "downs": 0, "body": "I think that your main problem is that you were born before all the stuff in *2001* became mainstream. \n\nPeople hadn't even landed on the moon yet! No probe had ever taken pictures of Saturn or Jupiter. *2001* predates *the majority of the Space Race.* Think about that for a second-Kubrick had to depict planets that had only ever been seen by telescope. It's a miracle that he wasn't horrifically wrong.\n\nIn this light, it's reasonable that Kubrick decided to skip over the details. Wireless electronics, machine learning, and much other technology we take for granted hadn't even been invented yet. Kubrick couldn't have known what an autonomously learning program would be like, *because they were decades from entering the workplace.*\n\nYou have to realize, this film is half a century old. It is impressive because it was trying to set a technical roadmap for future human technological development while also interesting a lay audience. \n\nYou might also be interested in the book, which takes the additional daring of trying to provide scientific explanations for everything that's going on- \n\n&gt;     A dozen units had been pulled out, yet thanks to the multiple redundancy of its design - another feature, Bowman knew, that had been copied from the human brain - the computer was still \nholding its own.\n\n\n\n\n\n \n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I think that your main problem is that you were born before all the stuff in &lt;em&gt;2001&lt;/em&gt; became mainstream. &lt;/p&gt;\n\n&lt;p&gt;People hadn&amp;#39;t even landed on the moon yet! No probe had ever taken pictures of Saturn or Jupiter. &lt;em&gt;2001&lt;/em&gt; predates &lt;em&gt;the majority of the Space Race.&lt;/em&gt; Think about that for a second-Kubrick had to depict planets that had only ever been seen by telescope. It&amp;#39;s a miracle that he wasn&amp;#39;t horrifically wrong.&lt;/p&gt;\n\n&lt;p&gt;In this light, it&amp;#39;s reasonable that Kubrick decided to skip over the details. Wireless electronics, machine learning, and much other technology we take for granted hadn&amp;#39;t even been invented yet. Kubrick couldn&amp;#39;t have known what an autonomously learning program would be like, &lt;em&gt;because they were decades from entering the workplace.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;You have to realize, this film is half a century old. It is impressive because it was trying to set a technical roadmap for future human technological development while also interesting a lay audience. &lt;/p&gt;\n\n&lt;p&gt;You might also be interested in the book, which takes the additional daring of trying to provide scientific explanations for everything that&amp;#39;s going on- &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;pre&gt;&lt;code&gt;A dozen units had been pulled out, yet thanks to the multiple redundancy of its design - another feature, Bowman knew, that had been copied from the human brain - the computer was still \n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;holding its own.&lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2owwc6", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2owwc6/", "num_reports": null, "stickied": false, "created": 1462170364.0, "author_flair_text": null, "created_utc": 1462141564.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2ogxuw", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "pistolpierre", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2og5jq", "score": 1, "approved_by": null, "downs": 0, "body": "Well in terms of film, anything can be valid to anyone, since the judging of art / film is subjective. But I would suggest that you don't entirely discount films purely because of their lack of straightforwardness. I mean where do you draw the line? Surely you don't expect every film to spell everything out and hand-hold the audience so that any semblance of mystery or intrigue is vanished?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Well in terms of film, anything can be valid to anyone, since the judging of art / film is subjective. But I would suggest that you don&amp;#39;t entirely discount films purely because of their lack of straightforwardness. I mean where do you draw the line? Surely you don&amp;#39;t expect every film to spell everything out and hand-hold the audience so that any semblance of mystery or intrigue is vanished?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ogxuw", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ogxuw/", "num_reports": null, "stickied": false, "created": 1462144692.0, "author_flair_text": "1∆", "created_utc": 1462115892.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2og5jq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ofv8r", "score": 0, "approved_by": null, "downs": 0, "body": "Defining the criteria for valid that we're talking about here is in order.\n\nWe mean valid in terms of film? emotion? truth? \nit certainly isn't valid in terms of truth. for film I can see it would be.\n\n\nBut that's what children do. A dinosaur makes friends with a pony, and then they get sucked into a black hole, and then there is music, where Al Capone evolves into a butterfly, and has his penis eaten by a piranha. When will that be getting an emmy? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Defining the criteria for valid that we&amp;#39;re talking about here is in order.&lt;/p&gt;\n\n&lt;p&gt;We mean valid in terms of film? emotion? truth? \nit certainly isn&amp;#39;t valid in terms of truth. for film I can see it would be.&lt;/p&gt;\n\n&lt;p&gt;But that&amp;#39;s what children do. A dinosaur makes friends with a pony, and then they get sucked into a black hole, and then there is music, where Al Capone evolves into a butterfly, and has his penis eaten by a piranha. When will that be getting an emmy? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og5jq", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2og5jq/", "num_reports": null, "stickied": false, "created": 1462143225.0, "author_flair_text": null, "created_utc": 1462114425.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ofv8r", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "pistolpierre", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oet8s", "score": 1, "approved_by": null, "downs": 0, "body": "But making literary sense can include things like being obscure / ambiguous / esoteric, all of which can be just as valid as things like clarity and straightforwardness. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;But making literary sense can include things like being obscure / ambiguous / esoteric, all of which can be just as valid as things like clarity and straightforwardness. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ofv8r", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2ofv8r/", "num_reports": null, "stickied": false, "created": 1462142670.0, "author_flair_text": "1∆", "created_utc": 1462113870.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oet8s", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "gxwho", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oe4mu", "score": 1, "approved_by": null, "downs": 0, "body": "sure. I'm noticing common traits between these films and academic films.\n\nDoesn't have to make scientific sense. I get that it's literature/art/film. It needs to make literary sense, which I think it doesn't.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;sure. I&amp;#39;m noticing common traits between these films and academic films.&lt;/p&gt;\n\n&lt;p&gt;Doesn&amp;#39;t have to make scientific sense. I get that it&amp;#39;s literature/art/film. It needs to make literary sense, which I think it doesn&amp;#39;t.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oet8s", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2oet8s/", "num_reports": null, "stickied": false, "created": 1462140440.0, "author_flair_text": null, "created_utc": 1462111640.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oe4mu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "pistolpierre", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 2, "approved_by": null, "downs": 0, "body": "I'm not sure it's fair to dissect it as if it were an academic paper. You have to remember that it's a film - a science fiction film (emphasis on fiction) - not a science textbook. Not everything needs to make perfect scientific sense. Though 2001 is one of the few sci-fi's that comes close. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m not sure it&amp;#39;s fair to dissect it as if it were an academic paper. You have to remember that it&amp;#39;s a film - a science fiction film (emphasis on fiction) - not a science textbook. Not everything needs to make perfect scientific sense. Though 2001 is one of the few sci-fi&amp;#39;s that comes close. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oe4mu", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2oe4mu/", "num_reports": null, "stickied": false, "created": 1462138916.0, "author_flair_text": "1∆", "created_utc": 1462110116.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h8m6l", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2olx29", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "PineappleSlices", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h8m6l", "score": 2, "approved_by": null, "downs": 0, "body": "I'm curious if you've by any chance read  the book. It has the same basic narrative, but is told in a overall more straightforward and comprehensible way. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m curious if you&amp;#39;ve by any chance read  the book. It has the same basic narrative, but is told in a overall more straightforward and comprehensible way. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2olx29", "score_hidden": false, "permalink": "/r/changemyview/comments/4h8m6l/cmv_a_space_odyssey_and_other_such_films_are/d2olx29/", "num_reports": null, "stickied": false, "created": 1462153038.0, "author_flair_text": "10∆", "created_utc": 1462124238.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]