[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2w2s8", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "changemyview", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Often grades have nothing to do with competency. Grades often have to do with class participation, following instructions, and how much a student is willing to submit their will to the will of the teacher. &lt;/p&gt;\n\n&lt;p&gt;It has been said: &amp;quot;well behaved women rarely make history&amp;quot;. &lt;/p&gt;\n\n&lt;p&gt;Pink Floyd tells teachers to &amp;quot;leave those kids alone&amp;quot;. I agree that school treats kids like an assembly line product.&lt;/p&gt;\n\n&lt;p&gt;I was often given repetitive busy work, and graded for my mindlessly trying to please the teacher. Much of the wasted time in school would be removed if busy work was replaced with objective demonstration of mastery of skills or subjects, as a check box (or even a percentage) for each skill instead of a ranking of teacher pleasing output vs. other students. &lt;/p&gt;\n\n&lt;p&gt;I told a teacher that we were doing busy work. She was the head of the teachers union, and was pretty smart. She quickly agreed that it was busy-work, but that even busy-work teaches a student. She said busy work teaches discipline! &lt;/p&gt;\n\n&lt;p&gt;But the Nazi solder learned discipline. I don&amp;#39;t want to my kids to be graded for their willingness to follow orders, and produce endless, repetitive paperwork to be given a percent grade, comparing them to each other. &lt;/p&gt;\n\n&lt;p&gt;I want a score per competency, that follows them through high school, and allows them to eventually show competency at their own speed. &lt;/p&gt;\n\n&lt;p&gt;Change my view. Convince me that kids should be given percentages vs other students their same age on broad performance, without telling me specifically what little things they still haven&amp;#39;t mastered. Convince me that that percentage means anything that I can act on. I can&amp;#39;t just teach my kids &amp;quot;English&amp;quot; I have to have specific competencies that I can work with them to (punctuation, spelling, etc). &lt;/p&gt;\n\n&lt;p&gt;I guess I am saying their grades should be broken down into hundreds of small competencies. You can still do percentages, but it shouldn&amp;#39;t be percentages on producing paperwork, or busywork. &lt;/p&gt;\n\n&lt;p&gt;The ranking is bad, and telling a kid that 72% of their peers are doing better is stupid. But if we give them a specific list of specific skills they haven&amp;#39;t mastered, or information that they need to be able to recall, that gives them a list of actions. Giving them a grade is soul destroying. &lt;/p&gt;\n\n&lt;p&gt;Sure colleges will need to have ways of determining if kids get into their school. However, a letter grade, or percentage is stupid, and a list of specific competencies would be much better for everyone. &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;Because of your feedback forcing me to not exaggerate, I would modify my original statement to say this:&lt;/p&gt;\n\n&lt;p&gt;We should &lt;strong&gt;focus less&lt;/strong&gt; &lt;del&gt;not&lt;/del&gt; &lt;strong&gt;on&lt;/strong&gt; rank&lt;strong&gt;ing&lt;/strong&gt; kids vs. each other&lt;del&gt;.&lt;/del&gt; &lt;strong&gt;, and focus more on exactly which&lt;/strong&gt; &lt;del&gt;We should just track&lt;/del&gt; subjects that have been mastered, and those that still need work. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Often grades have nothing to do with competency. Grades often have to do with class participation, following instructions, and how much a student is willing to submit their will to the will of the teacher. \n\nIt has been said: \"well behaved women rarely make history\". \n\nPink Floyd tells teachers to \"leave those kids alone\". I agree that school treats kids like an assembly line product.\n\nI was often given repetitive busy work, and graded for my mindlessly trying to please the teacher. Much of the wasted time in school would be removed if busy work was replaced with objective demonstration of mastery of skills or subjects, as a check box (or even a percentage) for each skill instead of a ranking of teacher pleasing output vs. other students. \n\nI told a teacher that we were doing busy work. She was the head of the teachers union, and was pretty smart. She quickly agreed that it was busy-work, but that even busy-work teaches a student. She said busy work teaches discipline! \n\nBut the Nazi solder learned discipline. I don't want to my kids to be graded for their willingness to follow orders, and produce endless, repetitive paperwork to be given a percent grade, comparing them to each other. \n\nI want a score per competency, that follows them through high school, and allows them to eventually show competency at their own speed. \n\nChange my view. Convince me that kids should be given percentages vs other students their same age on broad performance, without telling me specifically what little things they still haven't mastered. Convince me that that percentage means anything that I can act on. I can't just teach my kids \"English\" I have to have specific competencies that I can work with them to (punctuation, spelling, etc). \n\nI guess I am saying their grades should be broken down into hundreds of small competencies. You can still do percentages, but it shouldn't be percentages on producing paperwork, or busywork. \n\nThe ranking is bad, and telling a kid that 72% of their peers are doing better is stupid. But if we give them a specific list of specific skills they haven't mastered, or information that they need to be able to recall, that gives them a list of actions. Giving them a grade is soul destroying. \n\nSure colleges will need to have ways of determining if kids get into their school. However, a letter grade, or percentage is stupid, and a list of specific competencies would be much better for everyone. \n\n--- \nBecause of your feedback forcing me to not exaggerate, I would modify my original statement to say this:\n\nWe should **focus less** ~~not~~ **on** rank**ing** kids vs. each other~~.~~ **, and focus more on exactly which** ~~We should just track~~ subjects that have been mastered, and those that still need work. \n", "likes": null, "suggested_sort": "qa", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "4h6jtz", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "myklob", "num_crossposts": 0, "link_flair_text": "[∆(s) from OP]", "can_mod_post": false, "send_replies": true, "pinned": false, "score": 82, "approved_by": null, "over_18": false, "domain": "self.changemyview", "hidden": false, "num_comments": 47, "thumbnail": "", "hide_score": false, "edited": 1462135263.0, "link_flair_css_class": "OPdelta", "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 539231, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_4h6jtz", "spoiler": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1462084561.0, "url": "https://www.reddit.com/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/", "author_flair_text": null, "quarantine": false, "title": "CMV: We should not rank kids vs. each other. We should just track subjects that have been mastered, and those that still need work.", "created_utc": 1462055761.0, "subreddit_name_prefixed": "r/changemyview", "distinguished": null, "media": null, "upvote_ratio": 0.83, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 82}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 19, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 0, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 6, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2nyp12", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "on_my_lunch_break", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nwuw5", "score": 6, "approved_by": null, "downs": 0, "body": "&gt; I believe that if the specific individual concepts were what everyone focused on (at grade time) less busywork would be done, with the goal of evaluating compliance.\n\nWhy? What is the connection between implementing an immensely complex system of metrics and reducing busywork? I don't see how that follows at all.\n\n&gt; Teachers gave assignments to see who could keep up with the work load, not to achieve a specific set of competency.\n\nSounds like maybe you just had shitty teachers... not all of them are like that. Most of them do care quite a lot about ensuring that students meet established benchmarks.\n\n&gt; A letter grade is not specifically actionable in the same way as a specific list of skills that need additional work. \n\nSure. But like I said, teachers *do* give feedback when students need work. It's not like they just hand out a grade and then refuse to discuss the rationale for the grade.\n\n&gt; But they would no what to do with a student that that was behind in \"Spelling\", \"Punctuation\", and \"subject/verb agreement\".\n\nI sort of addressed this in my post... we do have standardized testing that scores students in broad areas like the ones you mentioned.\n\n&gt; The Khan Academy competency checklist.\n\nThere are 1200 skills on just the math checklist. Assuming a more or less even distribution of these competencies, that's 100 of them per year, per class, per student. That's a lot of extra hoops to jump through for teachers, and it forces them to \"teach to the test\" in the same way as common core. Why is that something we should aspire to?\n\n&gt; How many teachers look at those results, and structure the class to ensure that each kid has an individual system to address those deficiencies?\n\nLots of them do. That's kind of the point of state testing -- to *force* teachers to evaluate student progress in certain areas and help them figure out where they need to improve and how they can do that.\n\n&gt; If grades and curriculum and testing were all looking at the same things\n\nThey do, loosely speaking.\n\n&gt; Whenever a curve is set. Each score is graded as a percentage. Not a percentage of a specific skill usually. Not an organized percentage. Just a percentage.\n\nThat doesn't really make any sense. Are you confusing *percentage* with *percentile*? Can you give a better explanation of exactly how these scores are calculated?\n\n&gt; So they looked at everyone's percent grade in each class, to determine what the top 1% really was. So yes, percentages are used more than just ACTs. Percent ranks are given based on grades.\n\nJust because you're using the word \"percent\" doesn't mean you're consistently talking about the same thing. Saying you got a grade of 70% means you earned 70% of the available points. It doesn't mean that you're dumber than 30% of the class. Again, I think you're confusing \"percentage\" and \"percentile.\"\n\n&gt; It is soul destroying, because it is not CONSTRUCTIVE feedback\n\nRight. The teacher GIVES constructive feedback, which is tailored to each student. If anything, it's much *more* constructive this way, because we're not forcing kids into cookie-cutter shapes. We're assessing them as individuals, not as a set of boxes to be ticked. A good teacher will be able to assess each kid and figure out what feedback to give to help that student succeed. That's constructive feedback.\n\nThe grade is just an objective measure of how you're doing compared to established expectations. Humans like scores. We like to know where we stand. It's a lot harder to know where you stand when you're looking at a list of a thousand competencies than if you just get a grade and some custom-tailored feedback.\n\n&gt; That is much more objective than a percent score in a class, that takes into account participation, attendance, test scores, and assignments scores. \n\nBut participation, attendance, tests, and assignments are important things in college. How well someone did on those things in high school is a huge indicator of their potential for success in college.\n\n&gt; A list of competencies, if everyone used the same list, is 1 billion times more objective than a percent score.\n\nLook, the competencies aren't objective, either. What qualifies as fulfillment of a specific competency for one teacher might be totally different from the next teacher's standards.\n\nOn top of that, it wouldn't really make sense for everyone to use the same list. What about electives like art and music? What about AP classes? What about when students are given a choice between physics, biology, and chemistry, but they aren't required to take all three? Either you'd force students to take identical academic paths, or you'd ignore a huge amount of incredibly important information about a student's successes and failures.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;I believe that if the specific individual concepts were what everyone focused on (at grade time) less busywork would be done, with the goal of evaluating compliance.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Why? What is the connection between implementing an immensely complex system of metrics and reducing busywork? I don&amp;#39;t see how that follows at all.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Teachers gave assignments to see who could keep up with the work load, not to achieve a specific set of competency.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sounds like maybe you just had shitty teachers... not all of them are like that. Most of them do care quite a lot about ensuring that students meet established benchmarks.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A letter grade is not specifically actionable in the same way as a specific list of skills that need additional work. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Sure. But like I said, teachers &lt;em&gt;do&lt;/em&gt; give feedback when students need work. It&amp;#39;s not like they just hand out a grade and then refuse to discuss the rationale for the grade.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But they would no what to do with a student that that was behind in &amp;quot;Spelling&amp;quot;, &amp;quot;Punctuation&amp;quot;, and &amp;quot;subject/verb agreement&amp;quot;.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I sort of addressed this in my post... we do have standardized testing that scores students in broad areas like the ones you mentioned.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The Khan Academy competency checklist.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;There are 1200 skills on just the math checklist. Assuming a more or less even distribution of these competencies, that&amp;#39;s 100 of them per year, per class, per student. That&amp;#39;s a lot of extra hoops to jump through for teachers, and it forces them to &amp;quot;teach to the test&amp;quot; in the same way as common core. Why is that something we should aspire to?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;How many teachers look at those results, and structure the class to ensure that each kid has an individual system to address those deficiencies?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Lots of them do. That&amp;#39;s kind of the point of state testing -- to &lt;em&gt;force&lt;/em&gt; teachers to evaluate student progress in certain areas and help them figure out where they need to improve and how they can do that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If grades and curriculum and testing were all looking at the same things&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;They do, loosely speaking.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Whenever a curve is set. Each score is graded as a percentage. Not a percentage of a specific skill usually. Not an organized percentage. Just a percentage.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That doesn&amp;#39;t really make any sense. Are you confusing &lt;em&gt;percentage&lt;/em&gt; with &lt;em&gt;percentile&lt;/em&gt;? Can you give a better explanation of exactly how these scores are calculated?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So they looked at everyone&amp;#39;s percent grade in each class, to determine what the top 1% really was. So yes, percentages are used more than just ACTs. Percent ranks are given based on grades.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Just because you&amp;#39;re using the word &amp;quot;percent&amp;quot; doesn&amp;#39;t mean you&amp;#39;re consistently talking about the same thing. Saying you got a grade of 70% means you earned 70% of the available points. It doesn&amp;#39;t mean that you&amp;#39;re dumber than 30% of the class. Again, I think you&amp;#39;re confusing &amp;quot;percentage&amp;quot; and &amp;quot;percentile.&amp;quot;&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It is soul destroying, because it is not CONSTRUCTIVE feedback&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Right. The teacher GIVES constructive feedback, which is tailored to each student. If anything, it&amp;#39;s much &lt;em&gt;more&lt;/em&gt; constructive this way, because we&amp;#39;re not forcing kids into cookie-cutter shapes. We&amp;#39;re assessing them as individuals, not as a set of boxes to be ticked. A good teacher will be able to assess each kid and figure out what feedback to give to help that student succeed. That&amp;#39;s constructive feedback.&lt;/p&gt;\n\n&lt;p&gt;The grade is just an objective measure of how you&amp;#39;re doing compared to established expectations. Humans like scores. We like to know where we stand. It&amp;#39;s a lot harder to know where you stand when you&amp;#39;re looking at a list of a thousand competencies than if you just get a grade and some custom-tailored feedback.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;That is much more objective than a percent score in a class, that takes into account participation, attendance, test scores, and assignments scores. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;But participation, attendance, tests, and assignments are important things in college. How well someone did on those things in high school is a huge indicator of their potential for success in college.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;A list of competencies, if everyone used the same list, is 1 billion times more objective than a percent score.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Look, the competencies aren&amp;#39;t objective, either. What qualifies as fulfillment of a specific competency for one teacher might be totally different from the next teacher&amp;#39;s standards.&lt;/p&gt;\n\n&lt;p&gt;On top of that, it wouldn&amp;#39;t really make sense for everyone to use the same list. What about electives like art and music? What about AP classes? What about when students are given a choice between physics, biology, and chemistry, but they aren&amp;#39;t required to take all three? Either you&amp;#39;d force students to take identical academic paths, or you&amp;#39;d ignore a huge amount of incredibly important information about a student&amp;#39;s successes and failures.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nyp12", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nyp12/", "num_reports": null, "stickied": false, "created": 1462095087.0, "author_flair_text": "18∆", "created_utc": 1462066287.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nwuw5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nuvgq", "score": 0, "approved_by": null, "downs": 0, "body": "&gt; But none of this (criticisms about the nature of the work that kids do in school) actually has to do with the concept of ranking or giving grades based on performance.\n\nI did not explain that concept very well. We are told by leadership gurus to \"begin with the end in mind\". I believe that if the specific individual concepts were what everyone focused on (at grade time) less busywork would be done, with the goal of evaluating compliance. I don't know how to explain this concept very well, or prove it. But I feel it with every fiber of my being. Teachers gave assignments to see who could keep up with the work load, not to achieve a specific set of competency. This is the problem. Teacher structure their days to have grades. They give assignments. They give busy work. If we evaluated just on competency, then it would re-orient everything. \n\nA letter grade is not specifically actionable in the same way as a specific list of skills that need additional work. Students, parents, and next year's teachers have no idea what to do with a student that got a \"C minus\" in \"English\". But they would no what to do with a student that that was behind in \"Spelling\", \"Punctuation\", and \"subject/verb agreement\".  \n\n&gt; Can you give a practical explanation of how this would be implemented?\n\nThe Khan Academy competency checklist. \n\n&gt; However, I do want to take a moment to point out: A lot of the state testing does give a competitive ranking while also identifying areas of mastery and areas in need of improvement.\n\nThat is the problem, and the disconnect between testing and teaching. How many teachers look at those results, and structure the class to ensure that each kid has an individual system to address those deficiencies? That is my whole point. If grades and curriculum and testing were all looking at the same things, we would be in a much better place. \n\n&gt; When does this ever happen, other than on tests like the SAT which are by their very nature intended to rank people?\n\nEvery year, many time. I don't know if it is no child left behind, or common core. But their is never ending testing, with new percentages multiple times each year. Whenever a curve is set. Each score is graded as a percentage. Not a percentage of a specific skill usually. Not an organized percentage. Just a percentage. \n\nMy wife was a valedictorian. But, because it was a large school their were many students that got all As. So they looked at everyone's percent grade in each class, to determine what the top 1% really was. So yes, percentages are used more than just ACTs. Percent ranks are given based on grades. \n\n&gt; If they think that getting a bad grade is \"soul destroying,\" then they're woefully unprepared to enter the real world and assume the responsibilities of an adult.\n\nIt is soul destroying, because it is not CONSTRUCTIVE feedback, in that a percentage does not tell them specific actionable things to work on. \n\n&gt; So, what objective measures are colleges going to use to rank students and decide who to accept?\n\nThe objective measures of what skills have been mastered. That is much more objective than a percent score in a class, that takes into account participation, attendance, test scores, and assignments scores. A list of competencies, if everyone used the same list, is 1 billion times more objective than a percent score. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;But none of this (criticisms about the nature of the work that kids do in school) actually has to do with the concept of ranking or giving grades based on performance.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I did not explain that concept very well. We are told by leadership gurus to &amp;quot;begin with the end in mind&amp;quot;. I believe that if the specific individual concepts were what everyone focused on (at grade time) less busywork would be done, with the goal of evaluating compliance. I don&amp;#39;t know how to explain this concept very well, or prove it. But I feel it with every fiber of my being. Teachers gave assignments to see who could keep up with the work load, not to achieve a specific set of competency. This is the problem. Teacher structure their days to have grades. They give assignments. They give busy work. If we evaluated just on competency, then it would re-orient everything. &lt;/p&gt;\n\n&lt;p&gt;A letter grade is not specifically actionable in the same way as a specific list of skills that need additional work. Students, parents, and next year&amp;#39;s teachers have no idea what to do with a student that got a &amp;quot;C minus&amp;quot; in &amp;quot;English&amp;quot;. But they would no what to do with a student that that was behind in &amp;quot;Spelling&amp;quot;, &amp;quot;Punctuation&amp;quot;, and &amp;quot;subject/verb agreement&amp;quot;.  &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Can you give a practical explanation of how this would be implemented?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The Khan Academy competency checklist. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;However, I do want to take a moment to point out: A lot of the state testing does give a competitive ranking while also identifying areas of mastery and areas in need of improvement.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;That is the problem, and the disconnect between testing and teaching. How many teachers look at those results, and structure the class to ensure that each kid has an individual system to address those deficiencies? That is my whole point. If grades and curriculum and testing were all looking at the same things, we would be in a much better place. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When does this ever happen, other than on tests like the SAT which are by their very nature intended to rank people?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Every year, many time. I don&amp;#39;t know if it is no child left behind, or common core. But their is never ending testing, with new percentages multiple times each year. Whenever a curve is set. Each score is graded as a percentage. Not a percentage of a specific skill usually. Not an organized percentage. Just a percentage. &lt;/p&gt;\n\n&lt;p&gt;My wife was a valedictorian. But, because it was a large school their were many students that got all As. So they looked at everyone&amp;#39;s percent grade in each class, to determine what the top 1% really was. So yes, percentages are used more than just ACTs. Percent ranks are given based on grades. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If they think that getting a bad grade is &amp;quot;soul destroying,&amp;quot; then they&amp;#39;re woefully unprepared to enter the real world and assume the responsibilities of an adult.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;It is soul destroying, because it is not CONSTRUCTIVE feedback, in that a percentage does not tell them specific actionable things to work on. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;So, what objective measures are colleges going to use to rank students and decide who to accept?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The objective measures of what skills have been mastered. That is much more objective than a percent score in a class, that takes into account participation, attendance, test scores, and assignments scores. A list of competencies, if everyone used the same list, is 1 billion times more objective than a percent score. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nwuw5", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nwuw5/", "num_reports": null, "stickied": false, "created": 1462091862.0, "author_flair_text": null, "created_utc": 1462063062.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nuvgq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "on_my_lunch_break", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 19, "approved_by": null, "downs": 0, "body": "I'd like to you clarify: What exactly is the view, here?\n\nYou start off with this title:\n\n&gt; We should not rank kids vs. each other. We should just track subjects that have been mastered, and those that still need work.\n\nYou then go on to give a lot of very fair, valid criticisms about the nature of the work that kids do in school. But none of this actually has to do with the concept of ranking or giving grades based on performance. It's a long list of good reasons why we need to change the ways we teach kids, but I don't see any reasons that have to do with your actual title.\n\nSo, when you get to this part:\n\n&gt; Change my view. Convince me that kids should be given percentages vs other students their same age on broad performance, without telling me specifically what little things they still haven't mastered. Convince me that that percentage means anything that I can act on. \n\n...I'm not sure how exactly this is tied into your title, and I'm also not sure what the support is for this view.\n\nHowever, I do want to take a moment to point out: A lot of the state testing does give a competitive ranking while also identifying areas of mastery and areas in need of improvement. When I was in grade school (in the state of Oregon), one such test was for writing samples. We'd do these a couple times a year, and we'd be graded on things like mechanics, organization, sentence structure, and word choice.\n\nAlso, most teachers -- the decent ones, at least -- give feedback about mastery (or lack thereof) as part of the grading process. It's not formal, because competencies aren't always black-and-white and they're not a binary thing where you either have them or you don't.\n\n&gt; I guess I am saying their grades should be broken down into hundreds of small competencies. You can still do percentages, but it shouldn't be percentages on producing paperwork, or busywork.\n\nCan you give a practical explanation of how this would be implemented? Who decides what the competencies are? How do you measure and quantify each one? That also seems like an extraordinary amount of the \"busy work\" you were complaining about... so how would it improve things?\n\n&gt; The ranking is bad, and telling a kid that 72% of their peers are doing better is stupid.\n\nWhen does this ever happen, other than on tests like the SAT which are *by their very nature* intended to rank people?\n\n&gt; Giving them a grade is soul destroying.\n\nI don't see how. It tells you very clearly, with one number, where you stand. If a kid's ego is so fragile that they can't handle an honest assessment of their performance, then perhaps they need to toughen up. If they think that getting a bad grade is \"soul destroying,\" then they're woefully unprepared to enter the real world and assume the responsibilities of an adult.\n\nAlso, if they're so fragile that a letter grade will affect them that way, a laundry list of every tiny thing they haven't mastered will be *way* worse for them. Hell, I *liked* getting letter grades in school to measure my progress, but a list of every little thing that I haven't mastered would probably have given me a panic attack.\n\n&gt; Sure colleges will need to have ways of determining if kids get into their school. However, a letter grade, or percentage is stupid, and a list of specific competencies would be much better for everyone.\n\nSo, what objective measures are colleges going to use to rank students and decide who to accept? Is the list of competencies going to be nationally standardized? Don't you see a high potential for that to be a shitshow, given what's happened every other time they've tried to lay down national standards?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;d like to you clarify: What exactly is the view, here?&lt;/p&gt;\n\n&lt;p&gt;You start off with this title:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We should not rank kids vs. each other. We should just track subjects that have been mastered, and those that still need work.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;You then go on to give a lot of very fair, valid criticisms about the nature of the work that kids do in school. But none of this actually has to do with the concept of ranking or giving grades based on performance. It&amp;#39;s a long list of good reasons why we need to change the ways we teach kids, but I don&amp;#39;t see any reasons that have to do with your actual title.&lt;/p&gt;\n\n&lt;p&gt;So, when you get to this part:&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Change my view. Convince me that kids should be given percentages vs other students their same age on broad performance, without telling me specifically what little things they still haven&amp;#39;t mastered. Convince me that that percentage means anything that I can act on. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;...I&amp;#39;m not sure how exactly this is tied into your title, and I&amp;#39;m also not sure what the support is for this view.&lt;/p&gt;\n\n&lt;p&gt;However, I do want to take a moment to point out: A lot of the state testing does give a competitive ranking while also identifying areas of mastery and areas in need of improvement. When I was in grade school (in the state of Oregon), one such test was for writing samples. We&amp;#39;d do these a couple times a year, and we&amp;#39;d be graded on things like mechanics, organization, sentence structure, and word choice.&lt;/p&gt;\n\n&lt;p&gt;Also, most teachers -- the decent ones, at least -- give feedback about mastery (or lack thereof) as part of the grading process. It&amp;#39;s not formal, because competencies aren&amp;#39;t always black-and-white and they&amp;#39;re not a binary thing where you either have them or you don&amp;#39;t.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I guess I am saying their grades should be broken down into hundreds of small competencies. You can still do percentages, but it shouldn&amp;#39;t be percentages on producing paperwork, or busywork.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Can you give a practical explanation of how this would be implemented? Who decides what the competencies are? How do you measure and quantify each one? That also seems like an extraordinary amount of the &amp;quot;busy work&amp;quot; you were complaining about... so how would it improve things?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;The ranking is bad, and telling a kid that 72% of their peers are doing better is stupid.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;When does this ever happen, other than on tests like the SAT which are &lt;em&gt;by their very nature&lt;/em&gt; intended to rank people?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Giving them a grade is soul destroying.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t see how. It tells you very clearly, with one number, where you stand. If a kid&amp;#39;s ego is so fragile that they can&amp;#39;t handle an honest assessment of their performance, then perhaps they need to toughen up. If they think that getting a bad grade is &amp;quot;soul destroying,&amp;quot; then they&amp;#39;re woefully unprepared to enter the real world and assume the responsibilities of an adult.&lt;/p&gt;\n\n&lt;p&gt;Also, if they&amp;#39;re so fragile that a letter grade will affect them that way, a laundry list of every tiny thing they haven&amp;#39;t mastered will be &lt;em&gt;way&lt;/em&gt; worse for them. Hell, I &lt;em&gt;liked&lt;/em&gt; getting letter grades in school to measure my progress, but a list of every little thing that I haven&amp;#39;t mastered would probably have given me a panic attack.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sure colleges will need to have ways of determining if kids get into their school. However, a letter grade, or percentage is stupid, and a list of specific competencies would be much better for everyone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;So, what objective measures are colleges going to use to rank students and decide who to accept? Is the list of competencies going to be nationally standardized? Don&amp;#39;t you see a high potential for that to be a shitshow, given what&amp;#39;s happened every other time they&amp;#39;ve tried to lay down national standards?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nuvgq", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nuvgq/", "num_reports": null, "stickied": false, "created": 1462088362.0, "author_flair_text": "18∆", "created_utc": 1462059562.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2ohji7", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o6i2d", "score": 2, "approved_by": null, "downs": 0, "body": "That is the saddest thing I have ever heard. I hope teachers don't share your opinion. Businesses that have you do busywork, that don't improve the bottom line will go out of business. \n\nThe business world has been talking about \"Lean manufacturing\". for a long time. \n\nhttps://en.wikipedia.org/wiki/Lean_manufacturing\n\n\"Essentially, lean is centered on making obvious what adds value by reducing everything else. Lean manufacturing is a management philosophy derived mostly from the Toyota Production System (TPS) (hence the term Toyotism is also prevalent) and identified as \"lean\" only in the 1990s.[1][2] TPS is renowned for its focus on reduction of the original Toyota seven wastes to improve overall customer value, but there are varying perspectives on how this is best achieved. The steady growth of Toyota, from a small company to the world's largest automaker,[3] has focused attention on how it has achieved this success.\"\n\nI think that we want to do the same thing to education. We should remove everything that adds value. Boring repetitive tasks will be handled by computer in the future, and we need kids that can do more than boring repetitive tasks. \n\nKids need to believe that their actions will teach them something. Kids are tuning out because they feel they are being manipulated, and controlled for the sadistic pleasure of their task masters, not because the work will actually teach them anything. What you say confirms my greatest fears. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;That is the saddest thing I have ever heard. I hope teachers don&amp;#39;t share your opinion. Businesses that have you do busywork, that don&amp;#39;t improve the bottom line will go out of business. &lt;/p&gt;\n\n&lt;p&gt;The business world has been talking about &amp;quot;Lean manufacturing&amp;quot;. for a long time. &lt;/p&gt;\n\n&lt;p&gt;&lt;a href=\"https://en.wikipedia.org/wiki/Lean_manufacturing\"&gt;https://en.wikipedia.org/wiki/Lean_manufacturing&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Essentially, lean is centered on making obvious what adds value by reducing everything else. Lean manufacturing is a management philosophy derived mostly from the Toyota Production System (TPS) (hence the term Toyotism is also prevalent) and identified as &amp;quot;lean&amp;quot; only in the 1990s.[1][2] TPS is renowned for its focus on reduction of the original Toyota seven wastes to improve overall customer value, but there are varying perspectives on how this is best achieved. The steady growth of Toyota, from a small company to the world&amp;#39;s largest automaker,[3] has focused attention on how it has achieved this success.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think that we want to do the same thing to education. We should remove everything that adds value. Boring repetitive tasks will be handled by computer in the future, and we need kids that can do more than boring repetitive tasks. &lt;/p&gt;\n\n&lt;p&gt;Kids need to believe that their actions will teach them something. Kids are tuning out because they feel they are being manipulated, and controlled for the sadistic pleasure of their task masters, not because the work will actually teach them anything. What you say confirms my greatest fears. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ohji7", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2ohji7/", "num_reports": null, "stickied": false, "created": 1462145759.0, "author_flair_text": null, "created_utc": 1462116959.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o6i2d", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 2, "approved_by": null, "downs": 0, "body": "School is not always about who is the smartest. It tries to sort the ones who can do an assignment on time, do boring repetetive work without complaining. This is what most jobs are. Being smart gets you far, but you have to have the whole package to get the top grade. I think this sort of system will, as you progress in the school system, become closer to a job. School is not just learning, it is developing work habits etc.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;School is not always about who is the smartest. It tries to sort the ones who can do an assignment on time, do boring repetetive work without complaining. This is what most jobs are. Being smart gets you far, but you have to have the whole package to get the top grade. I think this sort of system will, as you progress in the school system, become closer to a job. School is not just learning, it is developing work habits etc.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2o6i2d", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o6i2d/", "num_reports": null, "stickied": false, "created": 1462112213.0, "author_flair_text": null, "created_utc": 1462083413.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 4, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2nve8t", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "RocketCity1234", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nuzv2", "score": 2, "approved_by": null, "downs": 0, "body": "&gt; What are they supposed to do with the percentage? Hire their kid or not? Let their kid into college or not?\n\nHow is that not the ACT or SAT?\n\n&gt; I think a solution that perhaps addresses the desire for percentages, grades, and student evaluation would be to each report card say that the typical student is able to show competency in these hundred skills. Your student still needs work in these specific ones.\n\nThe teacher is in a class with 15-40 kids, they are not going to see what they are proficient or lacking at beyond '\"math\" or \"English\". I do not know of a system that could teach that.\n\n&gt; In general, A letter grade is not specifically actionable, in that it doesn't tell you exactly how your student is sub-par: just that they are. It tells you there is a problem, but taunts you with the lack of information or path forward, with specific skills that need to be developed. It tells you your student is sub par, but it doesn't do it in a transparent audit-able process that builds faith in the institution. It does it in a way that demands faith, trust, and subservience to the institution. \n\nThe institution gives you a general direction for what their student need progress in. It cannot give you something more detailed then that because that is all it can test for.\n\n&gt; Do you think that that is a good way of having both high expectations, and keeping feedback actionable? \n\nNo, but it is the best system that we have at the moment", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;What are they supposed to do with the percentage? Hire their kid or not? Let their kid into college or not?&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How is that not the ACT or SAT?&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I think a solution that perhaps addresses the desire for percentages, grades, and student evaluation would be to each report card say that the typical student is able to show competency in these hundred skills. Your student still needs work in these specific ones.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The teacher is in a class with 15-40 kids, they are not going to see what they are proficient or lacking at beyond &amp;#39;&amp;quot;math&amp;quot; or &amp;quot;English&amp;quot;. I do not know of a system that could teach that.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;In general, A letter grade is not specifically actionable, in that it doesn&amp;#39;t tell you exactly how your student is sub-par: just that they are. It tells you there is a problem, but taunts you with the lack of information or path forward, with specific skills that need to be developed. It tells you your student is sub par, but it doesn&amp;#39;t do it in a transparent audit-able process that builds faith in the institution. It does it in a way that demands faith, trust, and subservience to the institution. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;The institution gives you a general direction for what their student need progress in. It cannot give you something more detailed then that because that is all it can test for.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Do you think that that is a good way of having both high expectations, and keeping feedback actionable? &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;No, but it is the best system that we have at the moment&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nve8t", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nve8t/", "num_reports": null, "stickied": false, "created": 1462089331.0, "author_flair_text": "9∆", "created_utc": 1462060531.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nuzv2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nuoli", "score": 2, "approved_by": null, "downs": 0, "body": "Thank you for your question. I think the cost benefit of telling students and parents the percentage does not come out in favor of telling them. What are they supposed to do with the percentage? Hire their kid or not? Let their kid into college or not? Kids are not auditioning to be children. They are not being ranked until college, or their jobs, and so I don't see the benefit of the data. \n\nHowever, I am not a wimp afraid of hurting my little angle's feelings. I think a solution that perhaps addresses the desire for percentages, grades, and student evaluation would be to each report card say that the typical student is able to show competency in these hundred skills. Your student still needs work in these specific ones. \n\nIn general, A letter grade is not specifically actionable, in that it doesn't tell you exactly how your student is sub-par: just that they are. It tells you there is a problem, but taunts you with the lack of information or path forward, with specific skills that need to be developed. It tells you your student is sub par, but it doesn't do it in a transparent audit-able process that builds faith in the institution. It does it in a way that demands faith, trust, and subservience to the institution. \n\nDo you think that that is a good way of having both high expectations, and keeping feedback actionable? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for your question. I think the cost benefit of telling students and parents the percentage does not come out in favor of telling them. What are they supposed to do with the percentage? Hire their kid or not? Let their kid into college or not? Kids are not auditioning to be children. They are not being ranked until college, or their jobs, and so I don&amp;#39;t see the benefit of the data. &lt;/p&gt;\n\n&lt;p&gt;However, I am not a wimp afraid of hurting my little angle&amp;#39;s feelings. I think a solution that perhaps addresses the desire for percentages, grades, and student evaluation would be to each report card say that the typical student is able to show competency in these hundred skills. Your student still needs work in these specific ones. &lt;/p&gt;\n\n&lt;p&gt;In general, A letter grade is not specifically actionable, in that it doesn&amp;#39;t tell you exactly how your student is sub-par: just that they are. It tells you there is a problem, but taunts you with the lack of information or path forward, with specific skills that need to be developed. It tells you your student is sub par, but it doesn&amp;#39;t do it in a transparent audit-able process that builds faith in the institution. It does it in a way that demands faith, trust, and subservience to the institution. &lt;/p&gt;\n\n&lt;p&gt;Do you think that that is a good way of having both high expectations, and keeping feedback actionable? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nuzv2", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nuzv2/", "num_reports": null, "stickied": false, "created": 1462088592.0, "author_flair_text": null, "created_utc": 1462059792.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nuoli", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "RocketCity1234", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 4, "approved_by": null, "downs": 0, "body": "Why not both?", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Why not both?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nuoli", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nuoli/", "num_reports": null, "stickied": false, "created": 1462088005.0, "author_flair_text": "9∆", "created_utc": 1462059205.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oqtcq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oihlj", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; For example, with a lot of busy writing assignments, undergoing heavy review processes, the assignment, which is ultimately busy work because it's literally writing some arbitrary paper for functionally no reason, ends up being a fantastic way to gauge your own writing skills as peers and teachers grade and nitpick things like spelling and punctuation.\n\nI would say, by definition, if it performs an educational function, than it is no longer busywork. \n\nBut I had a biology class that didn't have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of \"busy work\". Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.\n\nWhat I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was \"the ability to find biological terms in a crossword puzzle\". He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn't have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the \"life cycle of a frog\" or something specifically, it would have forced his class to not be a 100% waste of time.\n", "edited": 1462142896.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;For example, with a lot of busy writing assignments, undergoing heavy review processes, the assignment, which is ultimately busy work because it&amp;#39;s literally writing some arbitrary paper for functionally no reason, ends up being a fantastic way to gauge your own writing skills as peers and teachers grade and nitpick things like spelling and punctuation.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I would say, by definition, if it performs an educational function, than it is no longer busywork. &lt;/p&gt;\n\n&lt;p&gt;But I had a biology class that didn&amp;#39;t have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of &amp;quot;busy work&amp;quot;. Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.&lt;/p&gt;\n\n&lt;p&gt;What I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was &amp;quot;the ability to find biological terms in a crossword puzzle&amp;quot;. He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn&amp;#39;t have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the &amp;quot;life cycle of a frog&amp;quot; or something specifically, it would have forced his class to not be a 100% waste of time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oqtcq", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oqtcq/", "num_reports": null, "stickied": false, "created": 1462160670.0, "author_flair_text": null, "created_utc": 1462131870.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2os5dr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DeltaBot", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2os4ow", "score": 1, "approved_by": null, "downs": 0, "body": "Confirmed: 1 delta awarded to /u/RoarSchlarg. ^[[History](/r/changemyview/wiki/user/RoarSchlarg)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]", "edited": false, "author_flair_css_class": "points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/RoarSchlarg\"&gt;/u/RoarSchlarg&lt;/a&gt;. &lt;sup&gt;[&lt;a href=\"/r/changemyview/wiki/user/RoarSchlarg\"&gt;History&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;[&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/deltabot\"&gt;Wiki&lt;/a&gt;][&lt;a href=\"https://github.com/alexames/DeltaBot\"&gt;Code&lt;/a&gt;][&lt;a href=\"/r/DeltaBot\"&gt;/r/DeltaBot&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2os5dr", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2os5dr/", "num_reports": null, "stickied": false, "created": 1462162729.0, "author_flair_text": "∞∆", "created_utc": 1462133929.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": "moderator"}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2os4ow", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oihlj", "score": 1, "approved_by": null, "downs": 0, "body": "We should **focus less** ~~not~~ **on** rank**ing** kids vs. each other~~.~~ **, and focus more on exactly which** ~~We should just track~~ subjects that have been mastered, and those that still need work. \n\n&amp;#8710;", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;We should &lt;strong&gt;focus less&lt;/strong&gt; &lt;del&gt;not&lt;/del&gt; &lt;strong&gt;on&lt;/strong&gt; rank&lt;strong&gt;ing&lt;/strong&gt; kids vs. each other&lt;del&gt;.&lt;/del&gt; &lt;strong&gt;, and focus more on exactly which&lt;/strong&gt; &lt;del&gt;We should just track&lt;/del&gt; subjects that have been mastered, and those that still need work. &lt;/p&gt;\n\n&lt;p&gt;&amp;#8710;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2os4ow", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2os4ow/", "num_reports": null, "stickied": false, "created": 1462162700.0, "author_flair_text": null, "created_utc": 1462133900.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oihlj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "RoarSchlarg", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "This post relates VERY well to my experiences in college, but it doesn't resonate as strongly for my k-12 education. I, like a lot of people, have issues with the standardized testing done in k-12, but from my particular experiences, outside of the SAT itself, I never really felt like I was being graded against the crowd in Virginia public schools as OP seems to imply most of K-12 is. Scores on assignments were much more of correctness and upon review, it's fairly easy to see the kinds of things I had to work on. For example, with a lot of busy writing assignments, undergoing heavy review processes, the assignment, which is ultimately busy work because it's literally writing some arbitrary paper for functionally no reason, ends up being a fantastic way to gauge your own writing skills as peers and teachers grade and nitpick things like spelling and punctuation.\n\nWith that said however, I can wholeheartedly agree with you in relation to college. While OP seems to isolate this idea of competitive education to getting INTO college, I would definitely say that almost ALL of college itself is just competitive education and being graded against your peers. GPA's are used to determine class ranks semester by semester and a LOT of the classes that I have taken and I know several other people have taken induce massive curves. For a lot of classes, people have to live off curves to pass so you see things like midterm scores at an average of 40% with a high of 70%. That grade then gets curved either individually or everyone's scores get adjusted accordingly at the end of the term so that not everybody fails the class. However, under this system, there is no way to accurately know what people coming out of the class with X letter grade knows or is proficient at. People can pass the class on the average end of the curve without knowing half of the content a professor delivers and denotes as important via testing. Subsequent classes have no way of gauging what things students need to work on. This extends to companies as well when looking for jobs out of college. Recruiters see a single 3 digit number to represent all of your competencies in a given field? All of your work culminates into that one number which itself is fairly skewed due to grading mechanisms mentioned above. I think that this is really much more of a problem than mentioned by OP because hiring companies really have no way to identify these list of competencies well and they student are instead simply competing against one another in a non-constructive way which does not enforce particular standards of education but instead the complete opposite- this notion of \"as long as I'm doing better than X amount of people, then I've learned what I need to know from this class\".\n\nI hope this helps serve as an extension to your original view and can open up a better forum that doesn't include as much personal experience disagreement.", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This post relates VERY well to my experiences in college, but it doesn&amp;#39;t resonate as strongly for my k-12 education. I, like a lot of people, have issues with the standardized testing done in k-12, but from my particular experiences, outside of the SAT itself, I never really felt like I was being graded against the crowd in Virginia public schools as OP seems to imply most of K-12 is. Scores on assignments were much more of correctness and upon review, it&amp;#39;s fairly easy to see the kinds of things I had to work on. For example, with a lot of busy writing assignments, undergoing heavy review processes, the assignment, which is ultimately busy work because it&amp;#39;s literally writing some arbitrary paper for functionally no reason, ends up being a fantastic way to gauge your own writing skills as peers and teachers grade and nitpick things like spelling and punctuation.&lt;/p&gt;\n\n&lt;p&gt;With that said however, I can wholeheartedly agree with you in relation to college. While OP seems to isolate this idea of competitive education to getting INTO college, I would definitely say that almost ALL of college itself is just competitive education and being graded against your peers. GPA&amp;#39;s are used to determine class ranks semester by semester and a LOT of the classes that I have taken and I know several other people have taken induce massive curves. For a lot of classes, people have to live off curves to pass so you see things like midterm scores at an average of 40% with a high of 70%. That grade then gets curved either individually or everyone&amp;#39;s scores get adjusted accordingly at the end of the term so that not everybody fails the class. However, under this system, there is no way to accurately know what people coming out of the class with X letter grade knows or is proficient at. People can pass the class on the average end of the curve without knowing half of the content a professor delivers and denotes as important via testing. Subsequent classes have no way of gauging what things students need to work on. This extends to companies as well when looking for jobs out of college. Recruiters see a single 3 digit number to represent all of your competencies in a given field? All of your work culminates into that one number which itself is fairly skewed due to grading mechanisms mentioned above. I think that this is really much more of a problem than mentioned by OP because hiring companies really have no way to identify these list of competencies well and they student are instead simply competing against one another in a non-constructive way which does not enforce particular standards of education but instead the complete opposite- this notion of &amp;quot;as long as I&amp;#39;m doing better than X amount of people, then I&amp;#39;ve learned what I need to know from this class&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I hope this helps serve as an extension to your original view and can open up a better forum that doesn&amp;#39;t include as much personal experience disagreement.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oihlj", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oihlj/", "num_reports": null, "stickied": false, "created": 1462147425.0, "author_flair_text": "1∆", "created_utc": 1462118625.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2ox9vy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o2rnr", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; \"Busy work\"\n\nI just think you and I need to use the same definition of busy work. If you are practicing, and that practice helps you develop competency, then it is not busy work. Busy work, as I use it, is work that does not result in improved competency or knowledge acquisition. \n\nAnd so I think you are sort of using a straw man argument, saying that we need busy work. I would say that your examples of what you call busy work is fine. \n\nFor example, I had a biology class that didn't have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of \"busy work\". Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.\n\nWhat I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was \"the ability to find biological terms in a crossword puzzle\". He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn't have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the \"life cycle of a frog\" or something specifically, it would have forced his class to not be a 100% waste of time.\n\n\n&gt; It would be untenable for upper grade teachers to describe in detail where a student is doing well in history class or what novel they struggled with.\n\nI disagree 1 billion percent. It would be liberating to have a list of history subjects that you are good at, and that you need to study more. I might know everything about the civil war, but need to learn more about ancient Greece. You might give me a D in history, but I might go on to write a book about the civil war, and you gave me a D in history? How many books have you written about that subject? It would be much better to have a list of things studied that year, and to give them grades in each subject. Just giving someone a D is stupid, without (on the same piece of paper) telling them what they needed to study, to be more ready next time. ", "edited": 1462142934.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;&amp;quot;Busy work&amp;quot;&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I just think you and I need to use the same definition of busy work. If you are practicing, and that practice helps you develop competency, then it is not busy work. Busy work, as I use it, is work that does not result in improved competency or knowledge acquisition. &lt;/p&gt;\n\n&lt;p&gt;And so I think you are sort of using a straw man argument, saying that we need busy work. I would say that your examples of what you call busy work is fine. &lt;/p&gt;\n\n&lt;p&gt;For example, I had a biology class that didn&amp;#39;t have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of &amp;quot;busy work&amp;quot;. Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.&lt;/p&gt;\n\n&lt;p&gt;What I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was &amp;quot;the ability to find biological terms in a crossword puzzle&amp;quot;. He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn&amp;#39;t have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the &amp;quot;life cycle of a frog&amp;quot; or something specifically, it would have forced his class to not be a 100% waste of time.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;It would be untenable for upper grade teachers to describe in detail where a student is doing well in history class or what novel they struggled with.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I disagree 1 billion percent. It would be liberating to have a list of history subjects that you are good at, and that you need to study more. I might know everything about the civil war, but need to learn more about ancient Greece. You might give me a D in history, but I might go on to write a book about the civil war, and you gave me a D in history? How many books have you written about that subject? It would be much better to have a list of things studied that year, and to give them grades in each subject. Just giving someone a D is stupid, without (on the same piece of paper) telling them what they needed to study, to be more ready next time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ox9vy", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2ox9vy/", "num_reports": null, "stickied": false, "created": 1462170996.0, "author_flair_text": null, "created_utc": 1462142196.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o2rnr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Njdevils11", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 3, "approved_by": null, "downs": 0, "body": "Hi there, teacher here. I going to respond as best I can based on your post, which was difficult to follow. It might help to add a TL;DR.   \n  \nBusy work is not the greatest thing in the world and it can certainly be used inappropriately; however, there are some very important benefits to repeated work. First and foremost the only way to get better at something is to do it and do it a lot. It's called practice. Practicing works best when done under the eyes of an instructor. When you come to a problem that is a little different and confusing the instructor should be able to guide you. \"Busy work\" should b used in this fashion, it should be a time for you to get more proficient independently with concepts and for the teacher to evaluated your competency.   \n    \nWhen you say that grading should be about proficiency not comparison, I believe you start with a false premise. Most grading systems, k-12, are not competitive. Just because grades of one student can be compared to grades of another student doesn't make it competitive. Competitive grading is when one student gets and A+ no other student can get that high. It's essentially grading on a curve.   \n  \nLetter grades and percentages are meant to convey proficiency with a topic. Student scores are compared ao teachers can have a more realistic view of how competent the student is. A teacher might say if a student scores a 75% they meet my expectation level of proficiency. If the average score of the test was 60, then that says either my expectation was off, or my assessment was unfair, or I didn't teach it well. If you score a 60, well good for you, if you score a 30 we might need to talk.   \n  \nWhile I agree that letter grades are not specific, when you reach the level of getting a letter grade specificity is not the issue. proficiency specificity is really only important for foundational skills like elementary reading, writing and math.   \n  \nOnce you have those skills, the learning is shifted on the the student. Elementary years are essentially learning how to learn, once a student knows how to learn its up to them to apply those skills. It would be untenable for upper grade teachers to describe in detail where a student is doing well in history class or what novel they struggled with.   \n  \nThis is not to say that the teacher doesn't care about these things, just that they do not need to communicate it on a report card. The teacher should be actively engaging with the student and helping them through those issues. At the end of the quarter, the teacher makes an evaluation based on multiple factors as to whether the student is proficient with the subject matter. That's the letter grade.   \n  \nWhat the teacher uses as the components of proficiency can often vary based on professional judgement. Usually class participation is counted because the teacher needs to know what you are able to do on the fly. If you don't participate in class, they can't know that. Also there is often a direct relationship between students who participate and those that are more proficient. If you don't participate, it's also more likely that you don't understand. In other words Not participating is a risk factor for failing.   \n  \nBehavior is included in grades because, like it or not, humans are social creatures and we live with a social hierarchy. K-12 public schools do not simply exist to teach you academics, in fact it's written into every type of learning standards I've ever seen that students must learn social skills. Addressing your teacher and other students in a respectful way is preparation for a whole life of working with other people.   If anything, this might be the most important grade a teacher gives. How you work with others will dictate a lot of what you're able to achieve in this life. It's a \"21st century skill.\" \n  \n  \nEdit: in elementary school, report cards are broken down a lot more than in middle of high school. The reason for that being, that the next teacher (and parents) will need to know more specifics on where a child is so they can make appropriate classes and small groups. In the upper grades, When students move from class to class, there is less opportunity for individualization because the courses are more content driven. ", "edited": 1462074596.0, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Hi there, teacher here. I going to respond as best I can based on your post, which was difficult to follow. It might help to add a TL;DR.   &lt;/p&gt;\n\n&lt;p&gt;Busy work is not the greatest thing in the world and it can certainly be used inappropriately; however, there are some very important benefits to repeated work. First and foremost the only way to get better at something is to do it and do it a lot. It&amp;#39;s called practice. Practicing works best when done under the eyes of an instructor. When you come to a problem that is a little different and confusing the instructor should be able to guide you. &amp;quot;Busy work&amp;quot; should b used in this fashion, it should be a time for you to get more proficient independently with concepts and for the teacher to evaluated your competency.   &lt;/p&gt;\n\n&lt;p&gt;When you say that grading should be about proficiency not comparison, I believe you start with a false premise. Most grading systems, k-12, are not competitive. Just because grades of one student can be compared to grades of another student doesn&amp;#39;t make it competitive. Competitive grading is when one student gets and A+ no other student can get that high. It&amp;#39;s essentially grading on a curve.   &lt;/p&gt;\n\n&lt;p&gt;Letter grades and percentages are meant to convey proficiency with a topic. Student scores are compared ao teachers can have a more realistic view of how competent the student is. A teacher might say if a student scores a 75% they meet my expectation level of proficiency. If the average score of the test was 60, then that says either my expectation was off, or my assessment was unfair, or I didn&amp;#39;t teach it well. If you score a 60, well good for you, if you score a 30 we might need to talk.   &lt;/p&gt;\n\n&lt;p&gt;While I agree that letter grades are not specific, when you reach the level of getting a letter grade specificity is not the issue. proficiency specificity is really only important for foundational skills like elementary reading, writing and math.   &lt;/p&gt;\n\n&lt;p&gt;Once you have those skills, the learning is shifted on the the student. Elementary years are essentially learning how to learn, once a student knows how to learn its up to them to apply those skills. It would be untenable for upper grade teachers to describe in detail where a student is doing well in history class or what novel they struggled with.   &lt;/p&gt;\n\n&lt;p&gt;This is not to say that the teacher doesn&amp;#39;t care about these things, just that they do not need to communicate it on a report card. The teacher should be actively engaging with the student and helping them through those issues. At the end of the quarter, the teacher makes an evaluation based on multiple factors as to whether the student is proficient with the subject matter. That&amp;#39;s the letter grade.   &lt;/p&gt;\n\n&lt;p&gt;What the teacher uses as the components of proficiency can often vary based on professional judgement. Usually class participation is counted because the teacher needs to know what you are able to do on the fly. If you don&amp;#39;t participate in class, they can&amp;#39;t know that. Also there is often a direct relationship between students who participate and those that are more proficient. If you don&amp;#39;t participate, it&amp;#39;s also more likely that you don&amp;#39;t understand. In other words Not participating is a risk factor for failing.   &lt;/p&gt;\n\n&lt;p&gt;Behavior is included in grades because, like it or not, humans are social creatures and we live with a social hierarchy. K-12 public schools do not simply exist to teach you academics, in fact it&amp;#39;s written into every type of learning standards I&amp;#39;ve ever seen that students must learn social skills. Addressing your teacher and other students in a respectful way is preparation for a whole life of working with other people.   If anything, this might be the most important grade a teacher gives. How you work with others will dictate a lot of what you&amp;#39;re able to achieve in this life. It&amp;#39;s a &amp;quot;21st century skill.&amp;quot; &lt;/p&gt;\n\n&lt;p&gt;Edit: in elementary school, report cards are broken down a lot more than in middle of high school. The reason for that being, that the next teacher (and parents) will need to know more specifics on where a child is so they can make appropriate classes and small groups. In the upper grades, When students move from class to class, there is less opportunity for individualization because the courses are more content driven. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o2rnr", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o2rnr/", "num_reports": null, "stickied": false, "created": 1462102903.0, "author_flair_text": "1∆", "created_utc": 1462074103.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oyyay", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oxqwy", "score": 2, "approved_by": null, "downs": 0, "body": "I see. That'd pretty horrifying to hear. It also confirmed my suspicion that it's not the amount of money we're spending on teachers and education, but rather what they do with that money that's the problem.\n\nOut of curiosity though, do you have an example where they grade you in comparison to each other?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I see. That&amp;#39;d pretty horrifying to hear. It also confirmed my suspicion that it&amp;#39;s not the amount of money we&amp;#39;re spending on teachers and education, but rather what they do with that money that&amp;#39;s the problem.&lt;/p&gt;\n\n&lt;p&gt;Out of curiosity though, do you have an example where they grade you in comparison to each other?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2oyyay", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oyyay/", "num_reports": null, "stickied": false, "created": 1462173875.0, "author_flair_text": null, "created_utc": 1462145075.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oxqwy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2owxnw", "score": 1, "approved_by": null, "downs": 0, "body": "Perhaps an example would help. \n\nI had a biology class that didn't have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and goof off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of \"busy work\". Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.\n\nWhat I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was \"the ability to find biological terms in a crossword puzzle\". He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn't have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the \"life cycle of a frog\" or something specifically, it would have forced his class to not be a 100% waste of time.\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps an example would help. &lt;/p&gt;\n\n&lt;p&gt;I had a biology class that didn&amp;#39;t have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and goof off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of &amp;quot;busy work&amp;quot;. Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.&lt;/p&gt;\n\n&lt;p&gt;What I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was &amp;quot;the ability to find biological terms in a crossword puzzle&amp;quot;. He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn&amp;#39;t have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the &amp;quot;life cycle of a frog&amp;quot; or something specifically, it would have forced his class to not be a 100% waste of time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oxqwy", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oxqwy/", "num_reports": null, "stickied": false, "created": 1462171802.0, "author_flair_text": null, "created_utc": 1462143002.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2owxnw", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2owirt", "score": 1, "approved_by": null, "downs": 0, "body": "Maybe I've been out of school for too long because I don't know what you're talking about. Do you mean like one of those crappy electives where you get a pass fail grade or something? Or are you talking about a math class that does that?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Maybe I&amp;#39;ve been out of school for too long because I don&amp;#39;t know what you&amp;#39;re talking about. Do you mean like one of those crappy electives where you get a pass fail grade or something? Or are you talking about a math class that does that?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2owxnw", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2owxnw/", "num_reports": null, "stickied": false, "created": 1462170424.0, "author_flair_text": null, "created_utc": 1462141624.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2owirt", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2osru4", "score": 1, "approved_by": null, "downs": 0, "body": "No. My problem is averaging a performance, and just telling you what grade they got, instead of telling you specifically what things you need to work on. \n\nPerhaps you could visualize what I want, with a list of skills, and check marks or sub-grades for each sub skill. Sure, you can average, but you also need to give the details. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;No. My problem is averaging a performance, and just telling you what grade they got, instead of telling you specifically what things you need to work on. &lt;/p&gt;\n\n&lt;p&gt;Perhaps you could visualize what I want, with a list of skills, and check marks or sub-grades for each sub skill. Sure, you can average, but you also need to give the details. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2owirt", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2owirt/", "num_reports": null, "stickied": false, "created": 1462169739.0, "author_flair_text": null, "created_utc": 1462140939.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2osru4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "&gt;Change my view. Convince me that kids should be given percentages vs other students their same age on broad performance, \n\nWhere is it like this? You don't think students should be graded on a curve?", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;Change my view. Convince me that kids should be given percentages vs other students their same age on broad performance, &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Where is it like this? You don&amp;#39;t think students should be graded on a curve?&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2osru4", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2osru4/", "num_reports": null, "stickied": false, "created": 1462163693.0, "author_flair_text": null, "created_utc": 1462134893.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2o2i00", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Dead0fNight", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 3, "approved_by": null, "downs": 0, "body": "They're not being ranked against their peers, they're being ranked on expected ability. \n\n&gt;But the Nazi solder learned discipline. I don't want to my kids to be graded for their willingness to follow orders\n\nYour children's future employers would expect otherwise.\n\n&gt;I want a score per competency, that follows them through high school, and allows them to eventually show competency at their own speed.\n\nThis would require a customization on education that would require a massive overhaul and improvement (of the US at least) of the educational system. I don't completely disagree, but with the current climate it's not realistic.\n\n&gt;I can't just teach my kids \"English\" I have to have specific competencies that I can work with them to\n\nIf you want to assist your children it is up to you to figure out where they need help and how to assist them accordingly, just as it's the teacher's job to do that in the classroom.\n\n&gt;Sure colleges will need to have ways of determining if kids get into their school. However, a letter grade, or percentage is stupid, and a list of specific competencies would be much better for everyone.\n\nFor example, getting A's in algebra but C's in geometry? Or getting D's in chemistry but getting B's in biology? The only real place I can see something like this lacking under the current structure is the overarching \"English\" which you mentioned.\n\nDo note that I say this as a person suffering from both Bipolar Disorder and ADHD that does deplorably in traditional academic settings despite being told I'm very intelligent by just about every person I meet. Public education isn't intended to produce the best result for every individual, it is meant to get the bare minimum for all. It has to work with the lowest common denominator because they have to handle around 50 million students a year.", "edited": false, "author_flair_css_class": "points ", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;They&amp;#39;re not being ranked against their peers, they&amp;#39;re being ranked on expected ability. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;But the Nazi solder learned discipline. I don&amp;#39;t want to my kids to be graded for their willingness to follow orders&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your children&amp;#39;s future employers would expect otherwise.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I want a score per competency, that follows them through high school, and allows them to eventually show competency at their own speed.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;This would require a customization on education that would require a massive overhaul and improvement (of the US at least) of the educational system. I don&amp;#39;t completely disagree, but with the current climate it&amp;#39;s not realistic.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;I can&amp;#39;t just teach my kids &amp;quot;English&amp;quot; I have to have specific competencies that I can work with them to&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you want to assist your children it is up to you to figure out where they need help and how to assist them accordingly, just as it&amp;#39;s the teacher&amp;#39;s job to do that in the classroom.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Sure colleges will need to have ways of determining if kids get into their school. However, a letter grade, or percentage is stupid, and a list of specific competencies would be much better for everyone.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;For example, getting A&amp;#39;s in algebra but C&amp;#39;s in geometry? Or getting D&amp;#39;s in chemistry but getting B&amp;#39;s in biology? The only real place I can see something like this lacking under the current structure is the overarching &amp;quot;English&amp;quot; which you mentioned.&lt;/p&gt;\n\n&lt;p&gt;Do note that I say this as a person suffering from both Bipolar Disorder and ADHD that does deplorably in traditional academic settings despite being told I&amp;#39;m very intelligent by just about every person I meet. Public education isn&amp;#39;t intended to produce the best result for every individual, it is meant to get the bare minimum for all. It has to work with the lowest common denominator because they have to handle around 50 million students a year.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o2i00", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o2i00/", "num_reports": null, "stickied": false, "created": 1462102341.0, "author_flair_text": "2∆", "created_utc": 1462073541.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 3, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2o1mkl", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "povertybruh", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 3, "approved_by": null, "downs": 0, "body": "Not sure wtf you're saying. You clearly have problems with the grading system. And while your criticisms may be fair, at the end you still say colleges will need a way to determine the best students and a \"list of competencies\" would work - which is just another grading system and another way to compare students.\n\nSome students are just plain better than others. Smarter, harder working, more talented. We need those guys and gals in our top colleges and running our top companies, whether the less talented kids get their feelings hurt or not. Get over it.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Not sure wtf you&amp;#39;re saying. You clearly have problems with the grading system. And while your criticisms may be fair, at the end you still say colleges will need a way to determine the best students and a &amp;quot;list of competencies&amp;quot; would work - which is just another grading system and another way to compare students.&lt;/p&gt;\n\n&lt;p&gt;Some students are just plain better than others. Smarter, harder working, more talented. We need those guys and gals in our top colleges and running our top companies, whether the less talented kids get their feelings hurt or not. Get over it.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o1mkl", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o1mkl/", "num_reports": null, "stickied": false, "created": 1462100596.0, "author_flair_text": null, "created_utc": 1462071796.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2nxsqf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "dargh", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 2, "approved_by": null, "downs": 0, "body": "I don't think you have expressed your question terribly clearly, but I'll respond to what I think your underlying point is:\n\n    Competition as a learning tool doesn't work.\n    \nWe live in a capitalistic society (well, most of us do). Our work, careers and businesses are all very competitive and this has been shown to be a very effective way to get the best results for society most of the time. Success rises to the top, is emulated, and failed businesses and unsuccessful individuals mostly sink out of sight. This produces some poor outcomes for individuals sometimes, so is it a good model to emulate in education?\n\nI'd say that, handled properly, competition can get the best out of people. They work harder, learn more and are given a drive to perform to the best of their ability. Of course, it works better for those already nearer the top, than those struggling at the bottom, so it needs to be carefully balanced with support and encouragement.\n\nBut education needs to prepare us for the adult world, a world filled with competitive scoring. A job interview, pay rise or business success are all determined by comparing an individual or business against others. To imagine that a person can go through 13 years of school without a single grading or comparison and suddenly be thrust into a competitive working life is naive.\n\nAside from preparing us for adult life, competition is a necessary part of scoring abilities. Without comparing an individual to our peers how do we know what skills they are expected to master? We can't compare the skills of a child in 2016 with a child from 1816. And sadly, we can't compare the skills of a child in a poor third world country with those in a selective modern school. Each child needs to be measured with respect to what their potential is when considering their peers, parents and circumstances. What more could they achieve if they work harder, not what more can they achieve if they lived in another country.\n\n\"Gamification\" is a modern technique being brought into marketing, staff training and education as a whole. It really represents competition with some established norm, usually measured by the success of your peers.\n\nCompetition doesn't work for some children, some of the time. But that's not a good reason to throw it out as a teaching technique. Used by good teachers and within a good curriculum it can be very powerful and a strong motivation. Used poorly it can also cause harm, but that's not a reason to completely discard measuring people against their peers.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I don&amp;#39;t think you have expressed your question terribly clearly, but I&amp;#39;ll respond to what I think your underlying point is:&lt;/p&gt;\n\n&lt;pre&gt;&lt;code&gt;Competition as a learning tool doesn&amp;#39;t work.\n&lt;/code&gt;&lt;/pre&gt;\n\n&lt;p&gt;We live in a capitalistic society (well, most of us do). Our work, careers and businesses are all very competitive and this has been shown to be a very effective way to get the best results for society most of the time. Success rises to the top, is emulated, and failed businesses and unsuccessful individuals mostly sink out of sight. This produces some poor outcomes for individuals sometimes, so is it a good model to emulate in education?&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;d say that, handled properly, competition can get the best out of people. They work harder, learn more and are given a drive to perform to the best of their ability. Of course, it works better for those already nearer the top, than those struggling at the bottom, so it needs to be carefully balanced with support and encouragement.&lt;/p&gt;\n\n&lt;p&gt;But education needs to prepare us for the adult world, a world filled with competitive scoring. A job interview, pay rise or business success are all determined by comparing an individual or business against others. To imagine that a person can go through 13 years of school without a single grading or comparison and suddenly be thrust into a competitive working life is naive.&lt;/p&gt;\n\n&lt;p&gt;Aside from preparing us for adult life, competition is a necessary part of scoring abilities. Without comparing an individual to our peers how do we know what skills they are expected to master? We can&amp;#39;t compare the skills of a child in 2016 with a child from 1816. And sadly, we can&amp;#39;t compare the skills of a child in a poor third world country with those in a selective modern school. Each child needs to be measured with respect to what their potential is when considering their peers, parents and circumstances. What more could they achieve if they work harder, not what more can they achieve if they lived in another country.&lt;/p&gt;\n\n&lt;p&gt;&amp;quot;Gamification&amp;quot; is a modern technique being brought into marketing, staff training and education as a whole. It really represents competition with some established norm, usually measured by the success of your peers.&lt;/p&gt;\n\n&lt;p&gt;Competition doesn&amp;#39;t work for some children, some of the time. But that&amp;#39;s not a good reason to throw it out as a teaching technique. Used by good teachers and within a good curriculum it can be very powerful and a strong motivation. Used poorly it can also cause harm, but that&amp;#39;s not a reason to completely discard measuring people against their peers.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nxsqf", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nxsqf/", "num_reports": null, "stickied": false, "created": 1462093511.0, "author_flair_text": null, "created_utc": 1462064711.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oxz5w", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Spotless_Mind_", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2owgfk", "score": 2, "approved_by": null, "downs": 0, "body": "Oh wow. I'm in my junior year studying computer engineering. What are the odds. \n\nDo you mean a word find? Because a crossword puzzle has clues that describe things you should know. It's not just finding a word, it's knowing the meaning of it. Or at least knowing it by whatever the clue is.  \n\nThat's beside the point though. It sounds like you had a shitty teacher. That's too bad. But that doesn't mean grades themselves are inherently flawed. I think even if you didn't have grades and had this list of competencies a shitty teacher could just give you crossword puzzles and Mark you as 100 competent if you complete them.\n\nClasses teach subjects. You can't take a class on an individual skill. There's just not enough resources for that many separate sections. \n\nAt the end of a class there needs to at the least be an evaluation of if you did so poorly you need to retake it. (Get an F) \n\nOther grades show how well you did, and are used for advanced placement and college admission. They're not designed to be feedback. \n\nFeedback should come at every step of the way. And it does. Every time an assignment is returned you are able to look and see what you did wrong. I was eager to learn so I did. If I didn't understand I asked for help. \n\nA lot of students might not care what they did wrong, but that's their failure, if they don't want to learn it's pretty hard to teach them. \n\nThe existence of feedback on every assignment means it would be redundant to also replace grades with that same feedback all at once. Grades have a different purpose. \n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Oh wow. I&amp;#39;m in my junior year studying computer engineering. What are the odds. &lt;/p&gt;\n\n&lt;p&gt;Do you mean a word find? Because a crossword puzzle has clues that describe things you should know. It&amp;#39;s not just finding a word, it&amp;#39;s knowing the meaning of it. Or at least knowing it by whatever the clue is.  &lt;/p&gt;\n\n&lt;p&gt;That&amp;#39;s beside the point though. It sounds like you had a shitty teacher. That&amp;#39;s too bad. But that doesn&amp;#39;t mean grades themselves are inherently flawed. I think even if you didn&amp;#39;t have grades and had this list of competencies a shitty teacher could just give you crossword puzzles and Mark you as 100 competent if you complete them.&lt;/p&gt;\n\n&lt;p&gt;Classes teach subjects. You can&amp;#39;t take a class on an individual skill. There&amp;#39;s just not enough resources for that many separate sections. &lt;/p&gt;\n\n&lt;p&gt;At the end of a class there needs to at the least be an evaluation of if you did so poorly you need to retake it. (Get an F) &lt;/p&gt;\n\n&lt;p&gt;Other grades show how well you did, and are used for advanced placement and college admission. They&amp;#39;re not designed to be feedback. &lt;/p&gt;\n\n&lt;p&gt;Feedback should come at every step of the way. And it does. Every time an assignment is returned you are able to look and see what you did wrong. I was eager to learn so I did. If I didn&amp;#39;t understand I asked for help. &lt;/p&gt;\n\n&lt;p&gt;A lot of students might not care what they did wrong, but that&amp;#39;s their failure, if they don&amp;#39;t want to learn it&amp;#39;s pretty hard to teach them. &lt;/p&gt;\n\n&lt;p&gt;The existence of feedback on every assignment means it would be redundant to also replace grades with that same feedback all at once. Grades have a different purpose. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oxz5w", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oxz5w/", "num_reports": null, "stickied": false, "created": 1462172191.0, "author_flair_text": null, "created_utc": 1462143391.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2owgfk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oplxe", "score": 1, "approved_by": null, "downs": 0, "body": "&gt; You're completely ignoring the fact that all of that feedback is available\n\nReport cards are not detailed in the way that I have described. \n\n&gt; You're making up a problem that doesn't really exist.\n\n I had a biology class that didn't have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of \"busy work\". Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.\n\n&gt; If you tried to replace grades with that amount of feedback all at once it would be absolutely overwhelming. The teacher and the student could absolutely not keep the list of an entire semester's worth of incompetencies straight.\n\nHow can teachers give grades, if they don't know what a student can do well and not do well? Khan Academy is able to keep track of hundreds of skills that each student is able to master. I am an electrical engineer, and at my last company our boss had a list of skills that each of us could do. He wanted to know which of them we were good at. The list included power systems analysis, arc flash, load flow, SKM, Etap. \n\n&gt; You're also missing the point about learning. A lot of things you learn you forget. That's not necessarily a problem.\nI disagree. School is a waste of time if you don't learn. \n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re completely ignoring the fact that all of that feedback is available&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Report cards are not detailed in the way that I have described. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re making up a problem that doesn&amp;#39;t really exist.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I had a biology class that didn&amp;#39;t have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of &amp;quot;busy work&amp;quot;. Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you tried to replace grades with that amount of feedback all at once it would be absolutely overwhelming. The teacher and the student could absolutely not keep the list of an entire semester&amp;#39;s worth of incompetencies straight.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;How can teachers give grades, if they don&amp;#39;t know what a student can do well and not do well? Khan Academy is able to keep track of hundreds of skills that each student is able to master. I am an electrical engineer, and at my last company our boss had a list of skills that each of us could do. He wanted to know which of them we were good at. The list included power systems analysis, arc flash, load flow, SKM, Etap. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;You&amp;#39;re also missing the point about learning. A lot of things you learn you forget. That&amp;#39;s not necessarily a problem.\nI disagree. School is a waste of time if you don&amp;#39;t learn. &lt;/p&gt;\n&lt;/blockquote&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2owgfk", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2owgfk/", "num_reports": null, "stickied": false, "created": 1462169630.0, "author_flair_text": null, "created_utc": 1462140830.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oplxe", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Spotless_Mind_", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oi2tm", "score": 1, "approved_by": null, "downs": 0, "body": "You're completely ignoring the fact that all of that feedback is available. If you get a grade that you don't like, you can go to the teacher and talk to them.  Tests were always given back, with what was wrong marked. I could have gone to the teacher with any one of them and asked, hey what did I do wrong and how do I do better? And they would have been happy to help. \n\nYou're making up a problem that doesn't really exist. Everything you want is available if you ask a teacher and actually look at handed back assignments. \n\nIf you tried to replace grades with that amount of feedback all at once it would be absolutely overwhelming. The teacher and the student could absolutely not keep the list of an entire semester's worth of incompetencies straight. \n\nYou're also missing the point about learning. A lot of things you learn you forget. That's not necessarily a problem. A test is going to test how well you can pay attention and learn what in front of you recently. If in a few months you got feedback that said you weren't good at it a lot of the time that's just far too late. Unless you're going to just re-do that entire topic. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You&amp;#39;re completely ignoring the fact that all of that feedback is available. If you get a grade that you don&amp;#39;t like, you can go to the teacher and talk to them.  Tests were always given back, with what was wrong marked. I could have gone to the teacher with any one of them and asked, hey what did I do wrong and how do I do better? And they would have been happy to help. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re making up a problem that doesn&amp;#39;t really exist. Everything you want is available if you ask a teacher and actually look at handed back assignments. &lt;/p&gt;\n\n&lt;p&gt;If you tried to replace grades with that amount of feedback all at once it would be absolutely overwhelming. The teacher and the student could absolutely not keep the list of an entire semester&amp;#39;s worth of incompetencies straight. &lt;/p&gt;\n\n&lt;p&gt;You&amp;#39;re also missing the point about learning. A lot of things you learn you forget. That&amp;#39;s not necessarily a problem. A test is going to test how well you can pay attention and learn what in front of you recently. If in a few months you got feedback that said you weren&amp;#39;t good at it a lot of the time that&amp;#39;s just far too late. Unless you&amp;#39;re going to just re-do that entire topic. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oplxe", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oplxe/", "num_reports": null, "stickied": false, "created": 1462158797.0, "author_flair_text": null, "created_utc": 1462129997.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oi2tm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o62yb", "score": 1, "approved_by": null, "downs": 0, "body": "You can't solve problems without fully understanding them. Einstein said: \"We cannot solve our problems with the same thinking that created them\". He also said: \"if i had an hour to solve a problem I'd spend 55 minutes thinking about the problem and 5 minutes thinking about the solution.\" That is all I want: greater resolution in report cards. I want the process to be more detailed, and more transparent so that everyone can have actionable plans, not moronic evaluation that doesn't convey any information. We should also remember a saying attributed to Einstein—that everything must be made as simple as possible, but not one bit simpler. Giving a letter grade is over simplifying the problem of students getting Cs, Ds, and Fs. It tells them they suck, but it doesn't tell them, their pareents, or next years teachers what they need to do, precisely, to stop sucking. It may sound like a lot of work to clearly define the exact problem. However, it is less work than sweeping it under the rug, and forcing next years teacher to try and guess why they got a D or F, instead of checking a large list of compitencies, and knowing exactly what they need to do to fix the problem. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You can&amp;#39;t solve problems without fully understanding them. Einstein said: &amp;quot;We cannot solve our problems with the same thinking that created them&amp;quot;. He also said: &amp;quot;if i had an hour to solve a problem I&amp;#39;d spend 55 minutes thinking about the problem and 5 minutes thinking about the solution.&amp;quot; That is all I want: greater resolution in report cards. I want the process to be more detailed, and more transparent so that everyone can have actionable plans, not moronic evaluation that doesn&amp;#39;t convey any information. We should also remember a saying attributed to Einstein—that everything must be made as simple as possible, but not one bit simpler. Giving a letter grade is over simplifying the problem of students getting Cs, Ds, and Fs. It tells them they suck, but it doesn&amp;#39;t tell them, their pareents, or next years teachers what they need to do, precisely, to stop sucking. It may sound like a lot of work to clearly define the exact problem. However, it is less work than sweeping it under the rug, and forcing next years teacher to try and guess why they got a D or F, instead of checking a large list of compitencies, and knowing exactly what they need to do to fix the problem. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oi2tm", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oi2tm/", "num_reports": null, "stickied": false, "created": 1462146711.0, "author_flair_text": null, "created_utc": 1462117911.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o62yb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Spotless_Mind_", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "I'm really confused as to what your arguing. Maybe we had different grade school experience, but I can outline mine. \n\nAlmost no teacher graded on a curve. I think this happened once to me in high school, and it was graded such that the highest scoring student was the 100% score, and everything else was graded such that your score was what percent of things you got right. This is a direct measure of competency. 100% compentency is 100% of the questions right. \n\nGrades were not curved, just &lt;60% f, 6x% d, 7x% c... multiples of 10% up. The only comparison I received was asking other people what they got.\n\nTest's were on topics, not whole fields. Meaning that if I got a low score on a test, I had low competency on that specific topic. There was no \"English\" test, that tested all of english, and then I had no idea what I did wrong and just received a percent. That never happened. If I cared I could see what I did wrong. \n\nCompetition drives some people. Especially people who are in the upper spectrum. I was very good at school. If I got graded on the same competency as everyone, and had nobody to compete with. I would've learned less due to lack of incentive. Some people are competitive. Granted I never knew class averages, I still asked around and figured out who got the highest score, and compared myself to them. I had drive to be better than others. If all I received was competent or not competent. I would have never tried. There wouldn't have been reason to. \n\nIn essence, if you spare hurting feelings and not compare students you're removing incentive for some of the more academically minded and talented students. Is possibly engaging some of the lesser performing students worth disengaging the high performance students?\n\nIdeally every student could have specific competency levels tailored to them, so that they could be challenged and incentivized. I think that's highly unrealistic though. \n\nI'm realizing now that you only brought up relative performance in the last parts of your post. So I should address the beginning parts. \n\n\nHow do you know if a student is competent in something without them proving it. Call it \"busy work\" and \"submitting to a teacher's will\", but without homework how does a teacher know what a student knows. Homework and tests are a way for a student to show what they know. it's literally writing down this is the answer to that problem, certifying the student knows the answer to the problem and is there for competent in whatever you need to be competent in to solve the problem.\n\nWhether you like it or not. Most places a person ends up working they have to... you know.. work. You can love your job and have a great job, but still have to do some tedious busy work. You will have bosses who will give you orders. Do you want your kids to be ready for this world, or a dream world where nothing is hard and they are always their own boss?\n\nI am bad at some things. Identifying them and choosing whether or not to work on them is part of becoming a human being. You can't just let kids live in a dream world of you're just as good or better a everyone else. I think a person who is never made aware of their own flaws is worse than somebody who had to overcome the reality that they are bad at english, math, etc.\n\nTL;DR \nStudents are already graded on competency that is not relative to anyone else.\n\nFeedback is given on every test and homework about the specific things they don't know. Instead of all at once at the end in place of grades. \n\nCompetition in anything drives the skilled to higher levels, sometimes disheartening the less skilled. It's a trade off.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m really confused as to what your arguing. Maybe we had different grade school experience, but I can outline mine. &lt;/p&gt;\n\n&lt;p&gt;Almost no teacher graded on a curve. I think this happened once to me in high school, and it was graded such that the highest scoring student was the 100% score, and everything else was graded such that your score was what percent of things you got right. This is a direct measure of competency. 100% compentency is 100% of the questions right. &lt;/p&gt;\n\n&lt;p&gt;Grades were not curved, just &amp;lt;60% f, 6x% d, 7x% c... multiples of 10% up. The only comparison I received was asking other people what they got.&lt;/p&gt;\n\n&lt;p&gt;Test&amp;#39;s were on topics, not whole fields. Meaning that if I got a low score on a test, I had low competency on that specific topic. There was no &amp;quot;English&amp;quot; test, that tested all of english, and then I had no idea what I did wrong and just received a percent. That never happened. If I cared I could see what I did wrong. &lt;/p&gt;\n\n&lt;p&gt;Competition drives some people. Especially people who are in the upper spectrum. I was very good at school. If I got graded on the same competency as everyone, and had nobody to compete with. I would&amp;#39;ve learned less due to lack of incentive. Some people are competitive. Granted I never knew class averages, I still asked around and figured out who got the highest score, and compared myself to them. I had drive to be better than others. If all I received was competent or not competent. I would have never tried. There wouldn&amp;#39;t have been reason to. &lt;/p&gt;\n\n&lt;p&gt;In essence, if you spare hurting feelings and not compare students you&amp;#39;re removing incentive for some of the more academically minded and talented students. Is possibly engaging some of the lesser performing students worth disengaging the high performance students?&lt;/p&gt;\n\n&lt;p&gt;Ideally every student could have specific competency levels tailored to them, so that they could be challenged and incentivized. I think that&amp;#39;s highly unrealistic though. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m realizing now that you only brought up relative performance in the last parts of your post. So I should address the beginning parts. &lt;/p&gt;\n\n&lt;p&gt;How do you know if a student is competent in something without them proving it. Call it &amp;quot;busy work&amp;quot; and &amp;quot;submitting to a teacher&amp;#39;s will&amp;quot;, but without homework how does a teacher know what a student knows. Homework and tests are a way for a student to show what they know. it&amp;#39;s literally writing down this is the answer to that problem, certifying the student knows the answer to the problem and is there for competent in whatever you need to be competent in to solve the problem.&lt;/p&gt;\n\n&lt;p&gt;Whether you like it or not. Most places a person ends up working they have to... you know.. work. You can love your job and have a great job, but still have to do some tedious busy work. You will have bosses who will give you orders. Do you want your kids to be ready for this world, or a dream world where nothing is hard and they are always their own boss?&lt;/p&gt;\n\n&lt;p&gt;I am bad at some things. Identifying them and choosing whether or not to work on them is part of becoming a human being. You can&amp;#39;t just let kids live in a dream world of you&amp;#39;re just as good or better a everyone else. I think a person who is never made aware of their own flaws is worse than somebody who had to overcome the reality that they are bad at english, math, etc.&lt;/p&gt;\n\n&lt;p&gt;TL;DR \nStudents are already graded on competency that is not relative to anyone else.&lt;/p&gt;\n\n&lt;p&gt;Feedback is given on every test and homework about the specific things they don&amp;#39;t know. Instead of all at once at the end in place of grades. &lt;/p&gt;\n\n&lt;p&gt;Competition in anything drives the skilled to higher levels, sometimes disheartening the less skilled. It&amp;#39;s a trade off.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o62yb", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o62yb/", "num_reports": null, "stickied": false, "created": 1462110963.0, "author_flair_text": null, "created_utc": 1462082163.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2osx2i", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "DeltaBot", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oswf0", "score": 1, "approved_by": null, "downs": 0, "body": "Confirmed: 1 delta awarded to /u/ArsCombinatoria. ^[[History](/r/changemyview/wiki/user/ArsCombinatoria)]\n\n^[[Wiki](http://www.reddit.com/r/changemyview/wiki/deltabot)][[Code](https://github.com/alexames/DeltaBot)][/r/DeltaBot]", "edited": false, "author_flair_css_class": "points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Confirmed: 1 delta awarded to &lt;a href=\"/u/ArsCombinatoria\"&gt;/u/ArsCombinatoria&lt;/a&gt;. &lt;sup&gt;[&lt;a href=\"/r/changemyview/wiki/user/ArsCombinatoria\"&gt;History&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;sup&gt;[&lt;a href=\"http://www.reddit.com/r/changemyview/wiki/deltabot\"&gt;Wiki&lt;/a&gt;][&lt;a href=\"https://github.com/alexames/DeltaBot\"&gt;Code&lt;/a&gt;][&lt;a href=\"/r/DeltaBot\"&gt;/r/DeltaBot&lt;/a&gt;]&lt;/sup&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2osx2i", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2osx2i/", "num_reports": null, "stickied": false, "created": 1462163912.0, "author_flair_text": "∞∆", "created_utc": 1462135112.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": "moderator"}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oswf0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2og9df", "score": 1, "approved_by": null, "downs": 0, "body": "&amp;#8710;\n\nCan I give a \"Delta\" to more than one person? \n\nA lot of you are making the point that my argument goes too far. I have to agree with you.\n\nFor example, I agree that getting into college requires comparing students to each other. However, in Colorado, they are already giving my kid a percentage vs the State, and Vs. other kids in the class. And so the standardized test get sort of specific, but the class work has no sub-score within topics. \n\n&gt; Ranking kids is essential because it allows for a demonstrable model of success within the system everyone is in.\n\nI have to agree with that, but think it should be less emphasized. I would modify it this way:\nWe should **focus less** ~~not~~ **on** rank**ing** kids vs. each other~~.~~ **, and focus more on exactly which** ~~We should just track~~ subjects that have been mastered, and those that still need work. \n\n&gt; An intelligent student, with the desire to be successful, will look at those best ranked, learn their background and study habits, emulate their work ethic, and improve themselves. Without knowing who is succeeding, without knowing what another's abilities are, and without knowing the full potential someone can reach, a limitation is placed upon a student who may be intelligent, but lacks the conception of how to improve themselves to a higher level. \n\nI don't think I am disagreeing with any of that. I just think for young kids we could skip the step of averaging a student’s performance across a broad range of skills and areas of knowledge, to come up with an aggregate letter grade. Unfortunately report cards would get longer, but it would greatly reduce the amount of duplicative efforts each year, because instead of just telling the next teacher that a student got a D or F last year in English, next year’s teacher would have a complete list of subtopics that need work. Even in older grades, we should de-emphasize it. We should greatly increase the amount of specific feedback or the exact sub-skills that still need work. George T. Doran said that goals should be “S.M.A.R.T” or “Specific, Measurable, Attainable, Realistic, and Timely”. I just want the feedback that we give kids to be SMART. \n\n&gt; If you get an 88% on a vocabulary test, you have mastered 88% of those words.\n\nI have no problem with individual grades. I have a problem with averaging those grades, throwing in \"points\" for attendance, participation, and busy work performance (to the degree that bad teachers may sometimes have busy work). I actually don't even have problems with averaged grades, as long as the details of what sub-skills still need work. \n\n&gt; Especially now, with scan-trons in standardized testing, teachers can graph and visualize what problems students are missing, how many students missed it, and who missed it, faster than ever.\n\nI agree 1 billion percent. With technology, and sophisticated curriculum the state can help identify exactly what subcategory each question came from. I just want the data. Khan Academy is very good with this. I have listened to Freakanomics podcasts about hacking the school room, and developing data rich education initiatives that  say exactly where a student is suffering. I want that. I don't want a report card, like I have received many times for my son that says he is behind, but no examples of exactly how he is behind or what we can do to help. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&amp;#8710;&lt;/p&gt;\n\n&lt;p&gt;Can I give a &amp;quot;Delta&amp;quot; to more than one person? &lt;/p&gt;\n\n&lt;p&gt;A lot of you are making the point that my argument goes too far. I have to agree with you.&lt;/p&gt;\n\n&lt;p&gt;For example, I agree that getting into college requires comparing students to each other. However, in Colorado, they are already giving my kid a percentage vs the State, and Vs. other kids in the class. And so the standardized test get sort of specific, but the class work has no sub-score within topics. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Ranking kids is essential because it allows for a demonstrable model of success within the system everyone is in.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have to agree with that, but think it should be less emphasized. I would modify it this way:\nWe should &lt;strong&gt;focus less&lt;/strong&gt; &lt;del&gt;not&lt;/del&gt; &lt;strong&gt;on&lt;/strong&gt; rank&lt;strong&gt;ing&lt;/strong&gt; kids vs. each other&lt;del&gt;.&lt;/del&gt; &lt;strong&gt;, and focus more on exactly which&lt;/strong&gt; &lt;del&gt;We should just track&lt;/del&gt; subjects that have been mastered, and those that still need work. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;An intelligent student, with the desire to be successful, will look at those best ranked, learn their background and study habits, emulate their work ethic, and improve themselves. Without knowing who is succeeding, without knowing what another&amp;#39;s abilities are, and without knowing the full potential someone can reach, a limitation is placed upon a student who may be intelligent, but lacks the conception of how to improve themselves to a higher level. &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I don&amp;#39;t think I am disagreeing with any of that. I just think for young kids we could skip the step of averaging a student’s performance across a broad range of skills and areas of knowledge, to come up with an aggregate letter grade. Unfortunately report cards would get longer, but it would greatly reduce the amount of duplicative efforts each year, because instead of just telling the next teacher that a student got a D or F last year in English, next year’s teacher would have a complete list of subtopics that need work. Even in older grades, we should de-emphasize it. We should greatly increase the amount of specific feedback or the exact sub-skills that still need work. George T. Doran said that goals should be “S.M.A.R.T” or “Specific, Measurable, Attainable, Realistic, and Timely”. I just want the feedback that we give kids to be SMART. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;If you get an 88% on a vocabulary test, you have mastered 88% of those words.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I have no problem with individual grades. I have a problem with averaging those grades, throwing in &amp;quot;points&amp;quot; for attendance, participation, and busy work performance (to the degree that bad teachers may sometimes have busy work). I actually don&amp;#39;t even have problems with averaged grades, as long as the details of what sub-skills still need work. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Especially now, with scan-trons in standardized testing, teachers can graph and visualize what problems students are missing, how many students missed it, and who missed it, faster than ever.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I agree 1 billion percent. With technology, and sophisticated curriculum the state can help identify exactly what subcategory each question came from. I just want the data. Khan Academy is very good with this. I have listened to Freakanomics podcasts about hacking the school room, and developing data rich education initiatives that  say exactly where a student is suffering. I want that. I don&amp;#39;t want a report card, like I have received many times for my son that says he is behind, but no examples of exactly how he is behind or what we can do to help. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oswf0", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oswf0/", "num_reports": null, "stickied": false, "created": 1462163886.0, "author_flair_text": null, "created_utc": 1462135086.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2og9df", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "ArsCombinatoria", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "Ranking kids is essential because it allows for a demonstrable model of success within the system everyone is in. An intelligent student, with the desire to be successful, will look at those best ranked, learn their background and study habits, emulate their work ethic, and improve themselves. Without knowing who is succeeding, without knowing what another's abilities are, and without knowing the full potential someone can reach, a limitation is placed upon a student who may be intelligent, but lacks the conception of how to improve themselves to a higher level. The conception is created by observing other student's success and cannot fully be explained by a teacher without a model to point to. Yes, this creates competition, but life is a competition in many aspects, so I do not think it is bad to have this emulated, to a degree, in high-school. \n\nAn example of this can be clearly seen in the fine arts. Students are usually ranked, in chair order, based on audition, by ability. The principal players will be the most proficient players and the leaders. This serves as a model for other players to aspire to. The same parallel could be said about sports for the \"best\" player on the team. By observing their work ethic and habits, players can emulate better players and thus improve themselves. This seems like a natural extension of human nature. He can do it, why can't I? \n\nIt is the teacher's job to direct students in a healthy and intelligent fashion, to where a student will understand what is being taught and what is expected to be \"mastered.\" If you get an 88% on a vocabulary test, you have mastered 88% of those words. The idea that a percentage is ineffective in showing what is mastered does not resonate with me because of examples like this. Especially now, with scan-trons in standardized testing, teachers can graph and visualize what problems students are missing, how many students missed it, and who missed it, faster than ever. If you want a way to see, at a micro-level, what you haven't mastered yet, just look back at every piece of homework, every quiz, and every test at the problems you missed. That is all one needs. You already have a system that tracks competency on a small-scale. That this should somehow be tailored to work at the students own speed is not realistic in a classroom setting under the linearity of time, and thus, a student falling behind must seek after/before hours tutoring, which many teachers offer. \n\nI understand the concept that grade-ranking can cause an inferiority complex to arise in a student, place unnecessary pressure on a student, etc. This is not necessarily harmful in high-school because life is not getting any easier for those students, and they need preparation for the competitiveness of the real world in order to not be naive about reality. ", "edited": false, "author_flair_css_class": " points", "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Ranking kids is essential because it allows for a demonstrable model of success within the system everyone is in. An intelligent student, with the desire to be successful, will look at those best ranked, learn their background and study habits, emulate their work ethic, and improve themselves. Without knowing who is succeeding, without knowing what another&amp;#39;s abilities are, and without knowing the full potential someone can reach, a limitation is placed upon a student who may be intelligent, but lacks the conception of how to improve themselves to a higher level. The conception is created by observing other student&amp;#39;s success and cannot fully be explained by a teacher without a model to point to. Yes, this creates competition, but life is a competition in many aspects, so I do not think it is bad to have this emulated, to a degree, in high-school. &lt;/p&gt;\n\n&lt;p&gt;An example of this can be clearly seen in the fine arts. Students are usually ranked, in chair order, based on audition, by ability. The principal players will be the most proficient players and the leaders. This serves as a model for other players to aspire to. The same parallel could be said about sports for the &amp;quot;best&amp;quot; player on the team. By observing their work ethic and habits, players can emulate better players and thus improve themselves. This seems like a natural extension of human nature. He can do it, why can&amp;#39;t I? &lt;/p&gt;\n\n&lt;p&gt;It is the teacher&amp;#39;s job to direct students in a healthy and intelligent fashion, to where a student will understand what is being taught and what is expected to be &amp;quot;mastered.&amp;quot; If you get an 88% on a vocabulary test, you have mastered 88% of those words. The idea that a percentage is ineffective in showing what is mastered does not resonate with me because of examples like this. Especially now, with scan-trons in standardized testing, teachers can graph and visualize what problems students are missing, how many students missed it, and who missed it, faster than ever. If you want a way to see, at a micro-level, what you haven&amp;#39;t mastered yet, just look back at every piece of homework, every quiz, and every test at the problems you missed. That is all one needs. You already have a system that tracks competency on a small-scale. That this should somehow be tailored to work at the students own speed is not realistic in a classroom setting under the linearity of time, and thus, a student falling behind must seek after/before hours tutoring, which many teachers offer. &lt;/p&gt;\n\n&lt;p&gt;I understand the concept that grade-ranking can cause an inferiority complex to arise in a student, place unnecessary pressure on a student, etc. This is not necessarily harmful in high-school because life is not getting any easier for those students, and they need preparation for the competitiveness of the real world in order to not be naive about reality. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2og9df", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2og9df/", "num_reports": null, "stickied": false, "created": 1462143422.0, "author_flair_text": "1∆", "created_utc": 1462114622.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2p06de", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "non-rhetorical", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oxn2w", "score": 2, "approved_by": null, "downs": 0, "body": "Haha. The worst I can remember was German class in senior year. \n\nWe had lived in Ohio previously. Grades 8-11 I took German with the same teacher (and usually the same classmates -- not many people take German). We had a great teacher. One of the 5 \"true educators\" I referred to earlier. Everyone who took the AP German test got at least a 3/5, which is considered passing.\n\nGrade 12, I'm in Virginia. We play German Monopoly and watch Finding Nemo in German with English subtitles. That's just what we do. Everyone in class is worse at German than everyone in my Ohio class, and it's not even close. They couldn't pass German 3 in Ohio. German 2 would be a maybe. This, despite the fact that the teacher had a master's degree in education and made $80k a year.\n\nYou might be thinking, \"Virginia? Bunch of country bumpkins.\" Nope, this was Fairfax Co., the county adjacent to DC. Literally the #1 ranked public school system in the country. US News &amp; World Report also publishes high school rankings, not just college. USNWR ranked my VA school ~75th in the country the year I went there. My Ohio school was on the list, but around 150-250. FCPS had 3 schools in the top 100. I remember reading that at 17, thinking, \"What is this? Is this all just a big joke?\"\n\nThen I looked at USNWR's methodology. Now, I don't remember every metric included in the overall formula, but one thing stands out clearly: They awarded points for the number of 5's on AP tests-- *not* the average score. If you had 10 kids take it, and 9 scored 1s but 1 scored a 5, this was the same as 1 kid taking it and scoring a 5. Coincidentally, FCPS paid out of pocket for every student to take any AP test they wanted. And everyone did. I initially declined to take one, and my teacher bribed me with extra credit, because she wanted the 5. Her words. Looking back 10 years later, I wouldn't be surprised if there was bonus money involved.\n\n---------\n\nWhen I say, in the last paragraph of my first post, that the tests matter, I'm referring to standardized tests, whether it's AP/IB or state-level education tests. Teachers hate this idea, which should tell us something.\n\nI will grant 100% that the implementation of standardized testing leaves much to be desired. In my schools, in both states, we spent entirely too much time learning how to respond on the tests in the way the graders wanted us to respond. \n\nHowever! Standardized testing offers us one thing. It forces teachers to compete with each other, whether they like it or not. To rank students is, implicitly, to rank teachers. Naturally, they will stand around and complain about their particular school's lack of resources next to the rich kid private schools, but oh well. (It's a bullshit excuse anyway. Abe Lincoln's schoolhouse was one room, one teacher, 1st grade through 12th.) Their co-workers have that same problem, though, and you can rank them against each other. Every principal knows how his teaching staff stacks up. I'm told the results are pretty consistent year to year, which tells you it is measuring *something*. The question is how you use the information. If the principal is banging the bio teacher, well, maybe it doesn't matter what her tests scores are either way. But it does tell you who's a total do-nothing and who's not, which gives you a basis moving forward.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Haha. The worst I can remember was German class in senior year. &lt;/p&gt;\n\n&lt;p&gt;We had lived in Ohio previously. Grades 8-11 I took German with the same teacher (and usually the same classmates -- not many people take German). We had a great teacher. One of the 5 &amp;quot;true educators&amp;quot; I referred to earlier. Everyone who took the AP German test got at least a 3/5, which is considered passing.&lt;/p&gt;\n\n&lt;p&gt;Grade 12, I&amp;#39;m in Virginia. We play German Monopoly and watch Finding Nemo in German with English subtitles. That&amp;#39;s just what we do. Everyone in class is worse at German than everyone in my Ohio class, and it&amp;#39;s not even close. They couldn&amp;#39;t pass German 3 in Ohio. German 2 would be a maybe. This, despite the fact that the teacher had a master&amp;#39;s degree in education and made $80k a year.&lt;/p&gt;\n\n&lt;p&gt;You might be thinking, &amp;quot;Virginia? Bunch of country bumpkins.&amp;quot; Nope, this was Fairfax Co., the county adjacent to DC. Literally the #1 ranked public school system in the country. US News &amp;amp; World Report also publishes high school rankings, not just college. USNWR ranked my VA school ~75th in the country the year I went there. My Ohio school was on the list, but around 150-250. FCPS had 3 schools in the top 100. I remember reading that at 17, thinking, &amp;quot;What is this? Is this all just a big joke?&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Then I looked at USNWR&amp;#39;s methodology. Now, I don&amp;#39;t remember every metric included in the overall formula, but one thing stands out clearly: They awarded points for the number of 5&amp;#39;s on AP tests-- &lt;em&gt;not&lt;/em&gt; the average score. If you had 10 kids take it, and 9 scored 1s but 1 scored a 5, this was the same as 1 kid taking it and scoring a 5. Coincidentally, FCPS paid out of pocket for every student to take any AP test they wanted. And everyone did. I initially declined to take one, and my teacher bribed me with extra credit, because she wanted the 5. Her words. Looking back 10 years later, I wouldn&amp;#39;t be surprised if there was bonus money involved.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;When I say, in the last paragraph of my first post, that the tests matter, I&amp;#39;m referring to standardized tests, whether it&amp;#39;s AP/IB or state-level education tests. Teachers hate this idea, which should tell us something.&lt;/p&gt;\n\n&lt;p&gt;I will grant 100% that the implementation of standardized testing leaves much to be desired. In my schools, in both states, we spent entirely too much time learning how to respond on the tests in the way the graders wanted us to respond. &lt;/p&gt;\n\n&lt;p&gt;However! Standardized testing offers us one thing. It forces teachers to compete with each other, whether they like it or not. To rank students is, implicitly, to rank teachers. Naturally, they will stand around and complain about their particular school&amp;#39;s lack of resources next to the rich kid private schools, but oh well. (It&amp;#39;s a bullshit excuse anyway. Abe Lincoln&amp;#39;s schoolhouse was one room, one teacher, 1st grade through 12th.) Their co-workers have that same problem, though, and you can rank them against each other. Every principal knows how his teaching staff stacks up. I&amp;#39;m told the results are pretty consistent year to year, which tells you it is measuring &lt;em&gt;something&lt;/em&gt;. The question is how you use the information. If the principal is banging the bio teacher, well, maybe it doesn&amp;#39;t matter what her tests scores are either way. But it does tell you who&amp;#39;s a total do-nothing and who&amp;#39;s not, which gives you a basis moving forward.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2p06de", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2p06de/", "num_reports": null, "stickied": false, "created": 1462175947.0, "author_flair_text": null, "created_utc": 1462147147.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oxn2w", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nxmbv", "score": 1, "approved_by": null, "downs": 0, "body": "Thank you for the reply. I told a couple of other people, but I doubt anyone reads any of the post that don't involve them. But  I had a biology class that didn't have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of \"busy work\". Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.\n\nIt sounds like you had similar experiences in School? \n\nWhat I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was \"the ability to find biological terms in a crossword puzzle\". He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn't have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the \"life cycle of a frog\" or something specifically, it would have forced his class to not be a 100% waste of time. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Thank you for the reply. I told a couple of other people, but I doubt anyone reads any of the post that don&amp;#39;t involve them. But  I had a biology class that didn&amp;#39;t have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and good off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of &amp;quot;busy work&amp;quot;. Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.&lt;/p&gt;\n\n&lt;p&gt;It sounds like you had similar experiences in School? &lt;/p&gt;\n\n&lt;p&gt;What I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was &amp;quot;the ability to find biological terms in a crossword puzzle&amp;quot;. He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn&amp;#39;t have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the &amp;quot;life cycle of a frog&amp;quot; or something specifically, it would have forced his class to not be a 100% waste of time. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oxn2w", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oxn2w/", "num_reports": null, "stickied": false, "created": 1462171619.0, "author_flair_text": null, "created_utc": 1462142819.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "more", "data": {"count": 1, "name": "t1_d2nz4g7", "id": "d2nz4g7", "parent_id": "t1_d2nxmbv", "depth": 1, "children": ["d2nz4g7"]}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nxmbv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "non-rhetorical", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 2, "approved_by": null, "downs": 0, "body": "I agree with like 95% of what you're saying. However, as it is a time-honored /r/changemyview tradition, I will take issue with the precise wording and not the thrust of the argument.\n\n&gt;We should not rank kids\n\nYes we should. Let me tell you why. \n\nSchools, as you say, are terrible places that fall well short of achieving their stated goals. I, for one, wince whenever I'm inside one. You inevitably walk past the good, old \"core values\" pillars. Excellence. Honesty. Hard-Workedness And Good Spelling.\n\nI probably had, say, 40 high school teachers. Perhaps 5 would I label true educators. The other 35 followed a pattern. PowerPoints, busywork, what have you. It's all the same thing, in my mind. \"I don't feel like trying at my job, and no one can make me. Other professions have managers/supervisors/customers who grade quality of work, but not mine. The principal watches me teach once a year, and I know what day it's going to be. The other 179 days, no one is watching.\"\n\nExcept the test results. Ranking kids is the only thing forcing these do-nothing individuals to do something resembling teaching, as opposed to playing a National Geographic video every day for every class. We would all prefer our history teachers got up there and told engaging stories of human conflict, but if they won't (and we can't make them), then worksheets will at least drill names and dates. You have to admit, you'd prefer your kid know what happened in 1776 as opposed to not know, if those are the only options.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree with like 95% of what you&amp;#39;re saying. However, as it is a time-honored &lt;a href=\"/r/changemyview\"&gt;/r/changemyview&lt;/a&gt; tradition, I will take issue with the precise wording and not the thrust of the argument.&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We should not rank kids&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Yes we should. Let me tell you why. &lt;/p&gt;\n\n&lt;p&gt;Schools, as you say, are terrible places that fall well short of achieving their stated goals. I, for one, wince whenever I&amp;#39;m inside one. You inevitably walk past the good, old &amp;quot;core values&amp;quot; pillars. Excellence. Honesty. Hard-Workedness And Good Spelling.&lt;/p&gt;\n\n&lt;p&gt;I probably had, say, 40 high school teachers. Perhaps 5 would I label true educators. The other 35 followed a pattern. PowerPoints, busywork, what have you. It&amp;#39;s all the same thing, in my mind. &amp;quot;I don&amp;#39;t feel like trying at my job, and no one can make me. Other professions have managers/supervisors/customers who grade quality of work, but not mine. The principal watches me teach once a year, and I know what day it&amp;#39;s going to be. The other 179 days, no one is watching.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;Except the test results. Ranking kids is the only thing forcing these do-nothing individuals to do something resembling teaching, as opposed to playing a National Geographic video every day for every class. We would all prefer our history teachers got up there and told engaging stories of human conflict, but if they won&amp;#39;t (and we can&amp;#39;t make them), then worksheets will at least drill names and dates. You have to admit, you&amp;#39;d prefer your kid know what happened in 1776 as opposed to not know, if those are the only options.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nxmbv", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nxmbv/", "num_reports": null, "stickied": false, "created": 1462093209.0, "author_flair_text": null, "created_utc": 1462064409.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oxr3n", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2owk6e", "score": 1, "approved_by": null, "downs": 0, "body": "Perhaps an example would help. \n\nI had a biology class that didn't have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and goof off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of \"busy work\". Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.\n\nWhat I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was \"the ability to find biological terms in a crossword puzzle\". He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn't have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the \"life cycle of a frog\" or something specifically, it would have forced his class to not be a 100% waste of time.\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps an example would help. &lt;/p&gt;\n\n&lt;p&gt;I had a biology class that didn&amp;#39;t have a lecture. On Monday we were given a crossword puzzle with Biology terms, and on Friday they would collect it. We would separate into groups, finish the crossword on Wednesday, and goof off the remaining portion of the week. The act of looking for words in a cross word puzzle took brain power, but the brain power (I believe) was not used in an efficient way towards me learning the material. It was on the spectrum towards a classic definition of &amp;quot;busy work&amp;quot;. Because it kept us busy, but finding a word in a crossword puzzle did not really teach you what that word meant. It might teach you how to find a word, but that skill would not show up on a good lists of Biology Class Objectives.&lt;/p&gt;\n\n&lt;p&gt;What I am trying to do is fix the crossword puzzles. The only competency that teacher could verify that we had was &amp;quot;the ability to find biological terms in a crossword puzzle&amp;quot;. He was able to give us grades. Some kids (probably the smarter kids) refused to participate. Perhaps they didn&amp;#39;t have friends, who would show them where the crosswords were. Each week they would have to muster the will power to complete mindless, brain killing, soul crushing, repetitive tasks. Can you find a better way than mine to force the teacher to consider what skills he is passing on to his students? I think the best way to get my teacher to perform better would be to force him to evaluate us on specific skills that are needed in Biology. That might sound like a lot to ask him, but his class probably removed any chance of anyone who attended his class of having a future in the medical industry. I learned nothing about biology in High School from him, and he was my only high school biology teacher. That was my one chance, and he failed me. However, if he was forced to evaluate our understanding of the &amp;quot;life cycle of a frog&amp;quot; or something specifically, it would have forced his class to not be a 100% waste of time.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oxr3n", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oxr3n/", "num_reports": null, "stickied": false, "created": 1462171811.0, "author_flair_text": null, "created_utc": 1462143011.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2owk6e", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "GoldenWizard", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ow6zj", "score": 1, "approved_by": null, "downs": 0, "body": "I did, but I disagree with the initial statement that students are ranked.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I did, but I disagree with the initial statement that students are ranked.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2owk6e", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2owk6e/", "num_reports": null, "stickied": false, "created": 1462169804.0, "author_flair_text": null, "created_utc": 1462141004.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ow6zj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2ovb63", "score": 1, "approved_by": null, "downs": 0, "body": "Did you read anything but the subject? I didn't disagree with any of that. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you read anything but the subject? I didn&amp;#39;t disagree with any of that. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ow6zj", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2ow6zj/", "num_reports": null, "stickied": false, "created": 1462169190.0, "author_flair_text": null, "created_utc": 1462140390.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2ovb63", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "GoldenWizard", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "I have a problem with the core concept of your post. We do not rank kids versus each other. Grades are privately sent to the child and their families; whether or not they share them with others is their own dilemma. Grades are a reflection of the child's knowledge, not a ranking system. Otherwise we'd see a perfect distribution of A through F grades. The fact that an unequal number of students graduate vs. dropping out proves that the system doesn't rank you but is a result of your work and knowledge from the classes you took. \nTo put my point another way: to rank something, you'd have to create a scale that allows one or two places for each item being ranked. For example, a list of top movies couldn't contain 39 movies at Number 1, and only a few more listed at Number 2, and none listed at Number 3 or below. To be ranked they must hold only a single place on the scale; there must be a \"best\" movie. In contrast, if you want to describe how well a movie is made, you could give them 8/10, 10/10, etc. where the best movies receive 10s and there can be many of them. Likewise, students can all earn As while it's possible nobody earns an F, meaning they are not ranked based on the former scale but by the latter. There doesn't need to be a \"best\" or \"worst\" student, but each student must receive a grade. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have a problem with the core concept of your post. We do not rank kids versus each other. Grades are privately sent to the child and their families; whether or not they share them with others is their own dilemma. Grades are a reflection of the child&amp;#39;s knowledge, not a ranking system. Otherwise we&amp;#39;d see a perfect distribution of A through F grades. The fact that an unequal number of students graduate vs. dropping out proves that the system doesn&amp;#39;t rank you but is a result of your work and knowledge from the classes you took. \nTo put my point another way: to rank something, you&amp;#39;d have to create a scale that allows one or two places for each item being ranked. For example, a list of top movies couldn&amp;#39;t contain 39 movies at Number 1, and only a few more listed at Number 2, and none listed at Number 3 or below. To be ranked they must hold only a single place on the scale; there must be a &amp;quot;best&amp;quot; movie. In contrast, if you want to describe how well a movie is made, you could give them 8/10, 10/10, etc. where the best movies receive 10s and there can be many of them. Likewise, students can all earn As while it&amp;#39;s possible nobody earns an F, meaning they are not ranked based on the former scale but by the latter. There doesn&amp;#39;t need to be a &amp;quot;best&amp;quot; or &amp;quot;worst&amp;quot; student, but each student must receive a grade. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2ovb63", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2ovb63/", "num_reports": null, "stickied": false, "created": 1462167737.0, "author_flair_text": null, "created_utc": 1462138937.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2orguf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "anonoman925", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2oq9v3", "score": 1, "approved_by": null, "downs": 0, "body": "You have to find benchmarks.  How would you know how a single student is to perform?  From the benchmark you are able to do targeted interventions.\n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You have to find benchmarks.  How would you know how a single student is to perform?  From the benchmark you are able to do targeted interventions.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2orguf", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2orguf/", "num_reports": null, "stickied": false, "created": 1462161677.0, "author_flair_text": "23∆", "created_utc": 1462132877.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2oq9v3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2omn71", "score": 1, "approved_by": null, "downs": 0, "body": "I agree that we shouldn't advertise it or make a big deal about their performance, vs other kids. I also don't mind hurting their feelings, if their is a point to it. I just don't think their is a good point to telling them their average score on a broad range of topics. If we are going to give them feedback it should be as specific as possible. \n\n&gt; We then need to compare kids against the aggregate to drill down to see if interventions need to be done.\n\nI can see this as being good or bad, depending on how it is done, exactly, and what you mean by \"comparing kids against the aggregate\" and \"drilling down\". I would prefer not comparing kids over all to other kids. I would prefer only giving specific feedback. However, I can see the other side a bit. I just think that if you are going to give them feedback that they are not doing very well over all on a specific subject, it should come with very detailed examples of specific skills that need work, and areas of knowledge that still need improvement. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I agree that we shouldn&amp;#39;t advertise it or make a big deal about their performance, vs other kids. I also don&amp;#39;t mind hurting their feelings, if their is a point to it. I just don&amp;#39;t think their is a good point to telling them their average score on a broad range of topics. If we are going to give them feedback it should be as specific as possible. &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;We then need to compare kids against the aggregate to drill down to see if interventions need to be done.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;I can see this as being good or bad, depending on how it is done, exactly, and what you mean by &amp;quot;comparing kids against the aggregate&amp;quot; and &amp;quot;drilling down&amp;quot;. I would prefer not comparing kids over all to other kids. I would prefer only giving specific feedback. However, I can see the other side a bit. I just think that if you are going to give them feedback that they are not doing very well over all on a specific subject, it should come with very detailed examples of specific skills that need work, and areas of knowledge that still need improvement. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oq9v3", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oq9v3/", "num_reports": null, "stickied": false, "created": 1462159827.0, "author_flair_text": null, "created_utc": 1462131027.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2omn71", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "anonoman925", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "Perhaps we shouldn't advertise it, but we do need to benchmark students. This is valuable to see if curriculum is working. We then need to compare kids against the aggregate to drill down to see if interventions need to be done. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Perhaps we shouldn&amp;#39;t advertise it, but we do need to benchmark students. This is valuable to see if curriculum is working. We then need to compare kids against the aggregate to drill down to see if interventions need to be done. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2omn71", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2omn71/", "num_reports": null, "stickied": false, "created": 1462154170.0, "author_flair_text": "23∆", "created_utc": 1462125370.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2owyyv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o41ri", "score": 1, "approved_by": null, "downs": 0, "body": "Discipline for the sake of discipline destroys kids faith in \"the system\", makes them hate school (because it has no purpose), destroys their faith in society, in adults, and their faith that teachers have their best interest at heart\nDiscipline for the sake of discipline is a device by teacher who have given up teaching. \nAn individual could spend their whole life learning and not come close to knowing everything. Life is too short to waste kids time doing stuff that doesn't help them master a skill or learn a subject. \nNazis had discipline. Discipline is not a virtue, unless it is discipline in the service of virtuous causes. \nDiscipline for the sake of discipline is a weird mind control thing, where the person in authority gets off on bossing people around for stupid reasons, and only those people who are never going to amount to anything (the sheeple) will do what they are told. The future has very little need for people who are so stupid that they will complete assignments just because an authority figure told them to. Businesses don't want people like that. Businesses want people that will improve the bottom line, and think out side the box. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Discipline for the sake of discipline destroys kids faith in &amp;quot;the system&amp;quot;, makes them hate school (because it has no purpose), destroys their faith in society, in adults, and their faith that teachers have their best interest at heart\nDiscipline for the sake of discipline is a device by teacher who have given up teaching. \nAn individual could spend their whole life learning and not come close to knowing everything. Life is too short to waste kids time doing stuff that doesn&amp;#39;t help them master a skill or learn a subject. \nNazis had discipline. Discipline is not a virtue, unless it is discipline in the service of virtuous causes. \nDiscipline for the sake of discipline is a weird mind control thing, where the person in authority gets off on bossing people around for stupid reasons, and only those people who are never going to amount to anything (the sheeple) will do what they are told. The future has very little need for people who are so stupid that they will complete assignments just because an authority figure told them to. Businesses don&amp;#39;t want people like that. Businesses want people that will improve the bottom line, and think out side the box. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2owyyv", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2owyyv/", "num_reports": null, "stickied": false, "created": 1462170485.0, "author_flair_text": null, "created_utc": 1462141685.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o41ri", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "Physics_Prop", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "Did you just watch The Wall or something and now your mad at common core?\n\nYes, busy work is boring, but it does help. And it teaches that most of the work you will be doing in \"real life\" is also pointless, busy work.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Did you just watch The Wall or something and now your mad at common core?&lt;/p&gt;\n\n&lt;p&gt;Yes, busy work is boring, but it does help. And it teaches that most of the work you will be doing in &amp;quot;real life&amp;quot; is also pointless, busy work.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o41ri", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o41ri/", "num_reports": null, "stickied": false, "created": 1462105760.0, "author_flair_text": null, "created_utc": 1462076960.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2oh3bi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "myklob", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2o8mev", "score": 1, "approved_by": null, "downs": 0, "body": "I'm very sorry I have not explained my idea better. I will try to fix it, but now I hate organizing the content when arguments appear chronologically. \n\nI would not try to change the content. I don't think you should have to learn about \"specialist sport classes\". \n\n", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;m very sorry I have not explained my idea better. I will try to fix it, but now I hate organizing the content when arguments appear chronologically. &lt;/p&gt;\n\n&lt;p&gt;I would not try to change the content. I don&amp;#39;t think you should have to learn about &amp;quot;specialist sport classes&amp;quot;. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2oh3bi", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2oh3bi/", "num_reports": null, "stickied": false, "created": 1462144962.0, "author_flair_text": null, "created_utc": 1462116162.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2o8mev", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "while i agree that we shouldnt rank kids against each other, your alternative would have me doing specialist sports classes where i hate sport, am not good at it, and never plan to use it in my life.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;while i agree that we shouldnt rank kids against each other, your alternative would have me doing specialist sports classes where i hate sport, am not good at it, and never plan to use it in my life.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "changemyview", "name": "t1_d2o8mev", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o8mev/", "num_reports": null, "stickied": false, "created": 1462119539.0, "author_flair_text": null, "created_utc": 1462090739.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2o0em2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "jakefromstatefarm10", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "How 'good' a person is is relative to the rest of the population. When applying a job you're against people so we may as well rank against each other.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;How &amp;#39;good&amp;#39; a person is is relative to the rest of the population. When applying a job you&amp;#39;re against people so we may as well rank against each other.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2o0em2", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2o0em2/", "num_reports": null, "stickied": false, "created": 1462098240.0, "author_flair_text": null, "created_utc": 1462069440.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2w2s8", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_4h6jtz", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d2nu9mo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "RustyRook", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d2nu75t", "score": 1, "approved_by": null, "downs": 0, "body": "Sorry plexigras, your comment has been removed: \n\n&gt; Comment Rule 1\\. \"Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.\" [See the wiki page for more information.](http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1)  \n\nIf you would like to appeal, please [message the moderators by clicking this link.](http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;subject=Removed+Comment+Rule+1+Post+Appeal&amp;message=plexigras+would+like+to+appeal+the+removal+of+[his/her+post](https://www.reddit.com/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nu75t\\))", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Sorry plexigras, your comment has been removed: &lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;Comment Rule 1. &amp;quot;Direct responses to a CMV post must challenge at least one aspect of OP’s current view (however minor), unless they are asking a clarifying question. Arguments in favor of the view OP is willing to change must be restricted to replies to comments.&amp;quot; &lt;a href=\"http://www.reddit.com/r/changemyview/wiki/rules#wiki_rule_1\"&gt;See the wiki page for more information.&lt;/a&gt;  &lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;If you would like to appeal, please &lt;a href=\"http://www.reddit.com/message/compose?to=%2Fr%2Fchangemyview&amp;amp;subject=Removed+Comment+Rule+1+Post+Appeal&amp;amp;message=plexigras+would+like+to+appeal+the+removal+of+%5Bhis/her+post%5D(https://www.reddit.com/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nu75t)\"&gt;message the moderators by clicking this link.&lt;/a&gt;&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nu9mo", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nu9mo/", "num_reports": null, "stickied": false, "created": 1462087235.0, "author_flair_text": null, "created_utc": 1462058435.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": "moderator"}}], "before": null}}, "user_reports": [], "saved": false, "id": "d2nu75t", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_4h6jtz", "score": 1, "approved_by": null, "downs": 0, "body": "[removed]", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;[removed]&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "changemyview", "name": "t1_d2nu75t", "score_hidden": false, "permalink": "/r/changemyview/comments/4h6jtz/cmv_we_should_not_rank_kids_vs_each_other_we/d2nu75t/", "num_reports": null, "stickied": false, "created": 1462087103.0, "author_flair_text": null, "created_utc": 1462058303.0, "subreddit_name_prefixed": "r/changemyview", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]