[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qpzs", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "SuicideWatch", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hi guys,&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been here before, and you helped me with a very difficult time. Thank you for that.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know what to say, so I&amp;#39;ll just vent a bit.&lt;/p&gt;\n\n&lt;p&gt;I was in a psych unit for a months, and I left feeling a lot better, but now that I&amp;#39;m out I feel like I can&amp;#39;t guarentee my own safety.&lt;/p&gt;\n\n&lt;p&gt;I thought last night about dying, what it would be like, and I got very upset about it. And today, in a complete turnaround, I feel that nothingness would be a lot better than living with this horrible fucking life.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve been unwell for a long time. I&amp;#39;ve attempted suicide 4 times, and I remember the other night that I even took an overdose of paracetomol when I was 12.&lt;/p&gt;\n\n&lt;p&gt;Its impossible for me to think of a future. I could say I&amp;#39;m stuck in a rut, but that would be underestimating the volume of the intense feelings I have.&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t think I&amp;#39;ll ever get better. Because mental illness is such an insular disease, I feel that its my fault that I can&amp;#39;t get better. It adds to the hatred I feel about myself.&lt;/p&gt;\n\n&lt;p&gt;When I was younger, I was slagged by my so called friends a lot. It was hell, but I always had to pretend to take it in my stride, while secretly hating every day. I always prayed for rain, so I wouldn&amp;#39;t have to go out .I had to pretend I was dumb, to just fit in with them, and now that I can be myself, I feel like a fraud. But now I feel I have a good support group that I can talk things through with. I thought it would help, but it hasn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;And yet, the feelings are more intense.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m taking 6 different types of meds, and noticed only a marginal improvement.&lt;/p&gt;\n\n&lt;p&gt;I feel like I need a really good cry, but I can&amp;#39;t cry. No matter how bad I feel, the tears won&amp;#39;t come. I&amp;#39;m a 27 year old man, and I still live at home. My mother and brother are fantastic, but I feel like such a burden.&lt;/p&gt;\n\n&lt;p&gt;I take on other people&amp;#39;s feelings more than my own, and help them through their own suicidal feelings. Deep down inside, I feel that my issues are beyond healing.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m terrified of dying, but at the same time, I&amp;#39;m terrified of living. I can&amp;#39;t deal with these awful thoughts.&lt;/p&gt;\n\n&lt;p&gt;My psychiatrist keeps suggesting to do mindfulness or relaxation and even a positivity diary. I had to write three a day, and after a month, I&amp;#39;ve managed 5 things. Meeting a couple of friends I&amp;#39;d like to keep in touch with etc, but I even feel awful about that - like they don&amp;#39;t want to be my friends.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m so tired of feeling miserable. I&amp;#39;m so tired of feeling disconnected. Essentially, I&amp;#39;m so tired of being alive.&lt;/p&gt;\n\n&lt;p&gt;If I died, it would kill my family, I know that. I know making plans to die is such a selfish thing to do. But that&amp;#39;s what I want to do. I never want to feel like this again, and with suicide I&amp;#39;ll never have to. Being nothingness is so much more preferable to continuing on with this meaningless life. I do need help, but I don&amp;#39;t think any help will actually help me.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "Hi guys,\n\nI've been here before, and you helped me with a very difficult time. Thank you for that.\n\nI don't know what to say, so I'll just vent a bit.\n\nI was in a psych unit for a months, and I left feeling a lot better, but now that I'm out I feel like I can't guarentee my own safety.\n\nI thought last night about dying, what it would be like, and I got very upset about it. And today, in a complete turnaround, I feel that nothingness would be a lot better than living with this horrible fucking life.\n\nI've been unwell for a long time. I've attempted suicide 4 times, and I remember the other night that I even took an overdose of paracetomol when I was 12.\n\nIts impossible for me to think of a future. I could say I'm stuck in a rut, but that would be underestimating the volume of the intense feelings I have.\n\nI don't think I'll ever get better. Because mental illness is such an insular disease, I feel that its my fault that I can't get better. It adds to the hatred I feel about myself.\n\nWhen I was younger, I was slagged by my so called friends a lot. It was hell, but I always had to pretend to take it in my stride, while secretly hating every day. I always prayed for rain, so I wouldn't have to go out .I had to pretend I was dumb, to just fit in with them, and now that I can be myself, I feel like a fraud. But now I feel I have a good support group that I can talk things through with. I thought it would help, but it hasn't.\n\nAnd yet, the feelings are more intense.\n\nI'm taking 6 different types of meds, and noticed only a marginal improvement.\n\nI feel like I need a really good cry, but I can't cry. No matter how bad I feel, the tears won't come. I'm a 27 year old man, and I still live at home. My mother and brother are fantastic, but I feel like such a burden.\n\nI take on other people's feelings more than my own, and help them through their own suicidal feelings. Deep down inside, I feel that my issues are beyond healing.\n\nI'm terrified of dying, but at the same time, I'm terrified of living. I can't deal with these awful thoughts.\n\nMy psychiatrist keeps suggesting to do mindfulness or relaxation and even a positivity diary. I had to write three a day, and after a month, I've managed 5 things. Meeting a couple of friends I'd like to keep in touch with etc, but I even feel awful about that - like they don't want to be my friends.\n\nI'm so tired of feeling miserable. I'm so tired of feeling disconnected. Essentially, I'm so tired of being alive.\n\nIf I died, it would kill my family, I know that. I know making plans to die is such a selfish thing to do. But that's what I want to do. I never want to feel like this again, and with suicide I'll never have to. Being nothingness is so much more preferable to continuing on with this meaningless life. I do need help, but I don't think any help will actually help me.", "likes": null, "suggested_sort": null, "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "2ucp4b", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": true, "author": "throwaway1238981", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.SuicideWatch", "hidden": false, "num_comments": 2, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 83419, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "no_ads", "name": "t3_2ucp4b", "spoiler": false, "permalink": "/r/SuicideWatch/comments/2ucp4b/so_here_i_am_again/", "subreddit_type": "public", "whitelist_status": "no_ads", "report_reasons": null, "created": 1422775079.0, "url": "https://www.reddit.com/r/SuicideWatch/comments/2ucp4b/so_here_i_am_again/", "author_flair_text": null, "quarantine": false, "title": "So here I am again", "created_utc": 1422746279.0, "subreddit_name_prefixed": "r/SuicideWatch", "distinguished": null, "media": null, "upvote_ratio": 0.75, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qpzs", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2ucp4b", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "co7c20r", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "EllietheWalrus", "can_mod_post": false, "send_replies": true, "parent_id": "t3_2ucp4b", "score": 1, "approved_by": null, "downs": 0, "body": "I want you to know that it's not your fault. We still don't understand mental illness as much as we'd like to, but I can assure you no person is at fault for theirs. It's not a part of you. It's not something you should be ashamed or feel guilty about.\n\nI do think that you made an excellent choice by seeing your doctor.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I want you to know that it&amp;#39;s not your fault. We still don&amp;#39;t understand mental illness as much as we&amp;#39;d like to, but I can assure you no person is at fault for theirs. It&amp;#39;s not a part of you. It&amp;#39;s not something you should be ashamed or feel guilty about.&lt;/p&gt;\n\n&lt;p&gt;I do think that you made an excellent choice by seeing your doctor.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "SuicideWatch", "name": "t1_co7c20r", "score_hidden": false, "permalink": "/r/SuicideWatch/comments/2ucp4b/so_here_i_am_again/co7c20r/", "num_reports": null, "stickied": false, "created": 1422786738.0, "author_flair_text": null, "created_utc": 1422757938.0, "subreddit_name_prefixed": "r/SuicideWatch", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]