[{"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qqqf", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "depression", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My first depression came at age 22, after breaking up with my first girlfriend. I think we were together for a year or so, and my depression lasted several years. I find myself in depression now, after another relationship&amp;#39;s end. I am seeing a therapist and a doctor for medication. I&amp;#39;m now 56, and have cycled through many depressions, some of them definitely qualify as clinical depression. Yesterday I felt completely indifferent toward living, and at times as if dying would be a relief.I have felt this way before. I want to trust it will pass, my experience tells me it will, and I go through periods of time where I feel exhausted by suffering. I ask, &amp;quot;how much longer can I endure this?&amp;quot; I don&amp;#39;t feel suicidal, but I completely understand those feelings. Sometimes I wonder if at some point I will choose to end my own life. Painfully, I have to say it is possible. &lt;/p&gt;\n\n&lt;p&gt;I wonder if I&amp;#39;m simply happier out of romantic/ sexually intimate relationships? I&amp;#39;m lonely at times when I&amp;#39;m single, but never as depressed as I am when a relationship ends.&lt;/p&gt;\n\n&lt;p&gt;Another painful acknowledgement is that I typically don&amp;#39;t find myself in positive nurturing relationships with women, which mirrors my childhood. I choose emotionally removed women, like both my parents, despite the fact that I have a rich  emotional life. I have pondered why this continues, as I&amp;#39;m not choosing these women consciously, but . . . The point is, I want to get better, and I don&amp;#39;t know if it&amp;#39;s helpful to attempt to figure this out. I don&amp;#39;t believe there is a universal law that &amp;quot;people get what they need, or what the can handle, or what they deserve.&amp;quot; I see random stuff happening, with good and bad results, to people all over with no order that I can see. &lt;/p&gt;\n\n&lt;p&gt;My depression now is the result of breaking up with a woman after 3 months who just told me she had gotten out of jail for violating a restraining order after assaulting her ex boyfriend! In spite of my clear communication about the necessity for honesty early on, and my inquiry into her occasional emotional distance, she always said there was nothing wrong. I feel deceived and taken advantage of, after spending a great deal of time and money with her, that she somehow &amp;quot;forgot&amp;quot; to tell me about this. I have no desire for this woman at all, but I&amp;#39;m still outraged by her behavior. Selfish, entitled, greedy, and completely oblivious to considering others (empathy). To hear her describe her perpetration of the assault, you would think her ex made her assault him and made her violate her restraining order. She has some symptoms of both borderline and narcissistic personality disorders. I&amp;#39;m sick and nauseous inside, emotionally. I take medication to sleep every night.&lt;/p&gt;\n\n&lt;p&gt;In my previous relationship, I lived with a woman briefly who I ended up reporting for abusing her children and assaulting me. Fortunately the police encouraged her to move out of my house under the condition that I not press charges. Still, it took me years to get over that train wreck. She clearly had borderline personality disorder. &lt;/p&gt;\n\n&lt;p&gt;When I can humor myself, I tell myself that these are in some ways entertaining and even funny stories, if they weren&amp;#39;t happening to me! Hollywood couldn&amp;#39;t write &amp;#39;em. But I guess in truth I feel more sadness and anger. In spite of me being the best person I can be, I continue to suffer from depression. I feel like many people simply take advantage of good natured and kind people. That by being honest, I&amp;#39;m just being a freak, because deception, at least in the dating world, is rampant.  Obviously, I&amp;#39;m having trouble extracting anything positive in the moment. That is one of my symptoms of depression; struggling to find hope. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "My first depression came at age 22, after breaking up with my first girlfriend. I think we were together for a year or so, and my depression lasted several years. I find myself in depression now, after another relationship's end. I am seeing a therapist and a doctor for medication. I'm now 56, and have cycled through many depressions, some of them definitely qualify as clinical depression. Yesterday I felt completely indifferent toward living, and at times as if dying would be a relief.I have felt this way before. I want to trust it will pass, my experience tells me it will, and I go through periods of time where I feel exhausted by suffering. I ask, \"how much longer can I endure this?\" I don't feel suicidal, but I completely understand those feelings. Sometimes I wonder if at some point I will choose to end my own life. Painfully, I have to say it is possible. \n\nI wonder if I'm simply happier out of romantic/ sexually intimate relationships? I'm lonely at times when I'm single, but never as depressed as I am when a relationship ends.\n\nAnother painful acknowledgement is that I typically don't find myself in positive nurturing relationships with women, which mirrors my childhood. I choose emotionally removed women, like both my parents, despite the fact that I have a rich  emotional life. I have pondered why this continues, as I'm not choosing these women consciously, but . . . The point is, I want to get better, and I don't know if it's helpful to attempt to figure this out. I don't believe there is a universal law that \"people get what they need, or what the can handle, or what they deserve.\" I see random stuff happening, with good and bad results, to people all over with no order that I can see. \n\nMy depression now is the result of breaking up with a woman after 3 months who just told me she had gotten out of jail for violating a restraining order after assaulting her ex boyfriend! In spite of my clear communication about the necessity for honesty early on, and my inquiry into her occasional emotional distance, she always said there was nothing wrong. I feel deceived and taken advantage of, after spending a great deal of time and money with her, that she somehow \"forgot\" to tell me about this. I have no desire for this woman at all, but I'm still outraged by her behavior. Selfish, entitled, greedy, and completely oblivious to considering others (empathy). To hear her describe her perpetration of the assault, you would think her ex made her assault him and made her violate her restraining order. She has some symptoms of both borderline and narcissistic personality disorders. I'm sick and nauseous inside, emotionally. I take medication to sleep every night.\n\nIn my previous relationship, I lived with a woman briefly who I ended up reporting for abusing her children and assaulting me. Fortunately the police encouraged her to move out of my house under the condition that I not press charges. Still, it took me years to get over that train wreck. She clearly had borderline personality disorder. \n\nWhen I can humor myself, I tell myself that these are in some ways entertaining and even funny stories, if they weren't happening to me! Hollywood couldn't write 'em. But I guess in truth I feel more sadness and anger. In spite of me being the best person I can be, I continue to suffer from depression. I feel like many people simply take advantage of good natured and kind people. That by being honest, I'm just being a freak, because deception, at least in the dating world, is rampant.  Obviously, I'm having trouble extracting anything positive in the moment. That is one of my symptoms of depression; struggling to find hope. ", "likes": null, "suggested_sort": "confidence", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "55ag22", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "CraigERJ", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 2, "approved_by": null, "over_18": false, "domain": "self.depression", "hidden": false, "num_comments": 2, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": true, "subreddit_subscribers": 338992, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": "all_ads", "name": "t3_55ag22", "spoiler": false, "permalink": "/r/depression/comments/55ag22/relationships_trigger_my_depression/", "subreddit_type": "public", "whitelist_status": "all_ads", "report_reasons": null, "created": 1475303267.0, "url": "https://www.reddit.com/r/depression/comments/55ag22/relationships_trigger_my_depression/", "author_flair_text": null, "quarantine": false, "title": "Relationships trigger my depression", "created_utc": 1475274467.0, "subreddit_name_prefixed": "r/depression", "distinguished": null, "media": null, "upvote_ratio": 1.0, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 2}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55ag22", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": "all_ads", "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qqqf", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_55ag22", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "d8aqcx3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CraigERJ", "can_mod_post": false, "send_replies": true, "parent_id": "t1_d88zwkl", "score": 1, "approved_by": null, "downs": 0, "body": "I realize I had a lengthy post, but within it I say, \"The point is, I want to get better, and I don't know if it's helpful to attempt to figure this out. I don't believe there is a universal law that \"people get what they need, or what the can handle, or what they deserve.\" I see random stuff happening, with good and bad results, to people all over with no order that I can see.\"\n\n I think pop psychology / spirituality has embraced this idea that we get what we deserve/ need. That's a theory, it's not a law. In this  moment, such an idea that I attract these type of people makes me feel ashamed, like I did something wrong. I've had some healthy loving relationships too, just not these last few. \n\nIf I did any thing \"wrong'\" it was to be trusting, honest and caring about another and to place hope in the idea that that would be reciprocated. And you know what? Sometimes it is, sometimes it isn't. People have their on stuff going on too.\n\nSimply look at history: bright, thoughtful, loving,  people are not exempt from bad things happening, nor are they responsible for  those things. Heck, some of histories brightest have gone down the hardest! What did they do to deserve it? They thought and acted  outside of the box, that's all.\n\nI'm not embracing victimhood, I'm simply saying \"*hit happens\"  and everything that happens in the world is not causal. \n\nI am open to understanding my responsibility. But if you've ever been in a relationship with a borderline, you'll understand the normal rules of life do not apply. They can be very convincing until their \"switch\" flips, and then you have a whole different person in front of you. It's very creepy and disturbing. They can act without a conscience or sense of empathy. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I realize I had a lengthy post, but within it I say, &amp;quot;The point is, I want to get better, and I don&amp;#39;t know if it&amp;#39;s helpful to attempt to figure this out. I don&amp;#39;t believe there is a universal law that &amp;quot;people get what they need, or what the can handle, or what they deserve.&amp;quot; I see random stuff happening, with good and bad results, to people all over with no order that I can see.&amp;quot;&lt;/p&gt;\n\n&lt;p&gt;I think pop psychology / spirituality has embraced this idea that we get what we deserve/ need. That&amp;#39;s a theory, it&amp;#39;s not a law. In this  moment, such an idea that I attract these type of people makes me feel ashamed, like I did something wrong. I&amp;#39;ve had some healthy loving relationships too, just not these last few. &lt;/p&gt;\n\n&lt;p&gt;If I did any thing &amp;quot;wrong&amp;#39;&amp;quot; it was to be trusting, honest and caring about another and to place hope in the idea that that would be reciprocated. And you know what? Sometimes it is, sometimes it isn&amp;#39;t. People have their on stuff going on too.&lt;/p&gt;\n\n&lt;p&gt;Simply look at history: bright, thoughtful, loving,  people are not exempt from bad things happening, nor are they responsible for  those things. Heck, some of histories brightest have gone down the hardest! What did they do to deserve it? They thought and acted  outside of the box, that&amp;#39;s all.&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not embracing victimhood, I&amp;#39;m simply saying &amp;quot;*hit happens&amp;quot;  and everything that happens in the world is not causal. &lt;/p&gt;\n\n&lt;p&gt;I am open to understanding my responsibility. But if you&amp;#39;ve ever been in a relationship with a borderline, you&amp;#39;ll understand the normal rules of life do not apply. They can be very convincing until their &amp;quot;switch&amp;quot; flips, and then you have a whole different person in front of you. It&amp;#39;s very creepy and disturbing. They can act without a conscience or sense of empathy. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "depression", "name": "t1_d8aqcx3", "score_hidden": false, "permalink": "/r/depression/comments/55ag22/relationships_trigger_my_depression/d8aqcx3/", "num_reports": null, "stickied": false, "created": 1475443926.0, "author_flair_text": null, "created_utc": 1475415126.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "d88zwkl", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t3_55ag22", "score": 1, "approved_by": null, "downs": 0, "body": "Relationship endings are always difficult. They have been a big trigger for me as well with depression. I assume you're talking to your therapist about why you are attracting these types of people in your life? ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Relationship endings are always difficult. They have been a big trigger for me as well with depression. I assume you&amp;#39;re talking to your therapist about why you are attracting these types of people in your life? &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "depression", "name": "t1_d88zwkl", "score_hidden": false, "permalink": "/r/depression/comments/55ag22/relationships_trigger_my_depression/d88zwkl/", "num_reports": null, "stickied": false, "created": 1475309072.0, "author_flair_text": null, "created_utc": 1475280272.0, "subreddit_name_prefixed": "r/depression", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]