[{"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": 1, "children": [{"kind": "t3", "data": {"is_crosspostable": false, "subreddit_id": "t5_2qm0x", "approved_at_utc": null, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "subreddit": "ptsd", "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I guess I should start off by saying I was in therapy for most of my life. However I had to stop for a few reasons. (Couldn&amp;#39;t afford it, no way to get there, etc.) I know I should go back and I think now I&amp;#39;m in a better situation to go back. So please don&amp;#39;t lecture me about that part. Please. :/ &lt;/p&gt;\n\n&lt;p&gt;When I was in therapy we talked about having to deal with doing things that made me upset and uncomfortable. But they were all things I HAD to do. Like go to school or leave the house, for example. I know how to deal with those situations. Expose myself little by little, use the techniques they taught me to stay calm, maybe have a support person, etc. I had to push myself. I had no choice. My mom would have gotten in trouble if I didn&amp;#39;t go to school. It didn&amp;#39;t matter how hard it was or how sick I felt, I had to. &lt;/p&gt;\n\n&lt;p&gt;But what about situations where it isn&amp;#39;t necessary? What do I do for things like that? &lt;/p&gt;\n\n&lt;p&gt;For example, my boyfriend has this friend is is basically just a walking trigger for me. I don&amp;#39;t want to get into detail but he makes fun of me a lot and says mean things about me. The worse part is he was 23 and made/let  my 14 year old sister suck his dick. (My PTSD comes from child abuse, which including sexual abuse...) Every time I&amp;#39;m near him I either throw up or almost throw up because I&amp;#39;m stressed and completely terrified. I shake. My head starts to hurt. It becomes hard to breathe. You guys now how it is, I&amp;#39;m sure. It sucks. My boyfriend has never forced me to be around him but I&amp;#39;m often put in a hard place when it comes to choosing whether or not to be near him. Today is New Years day and I&amp;#39;m not with my boyfriend because his friend is there. I wanted to spend the day with him so bad but my fear kept me from that. This guy did some terrible things to innocent people. I hate him. I don&amp;#39;t wish anything good on him. I can&amp;#39;t wait for the day he&amp;#39;s rotting in hell. But I&amp;#39;d still like to get to a place in life where I can be in the same room as him and keep things civil. I mostly want to get there because I know it will mean a lot to my boyfriend and it would mean I don&amp;#39;t have to miss time with my boyfriend. (He&amp;#39;s a family friend of my boyfriend&amp;#39;s so it&amp;#39;s near to impossible for my boyfriend to cut him out of his life.) (I think it&amp;#39;s important to note that I have my sisters blessings to be civil. She loves my boyfriend and wants us to be together forever. She knows this puts a strain on our relationship. And she&amp;#39;s really not all that effected. She just doesn&amp;#39;t want to be near my boyfriend&amp;#39;s friend anymore.) &lt;/p&gt;\n\n&lt;p&gt;But I don&amp;#39;t &lt;em&gt;have&lt;/em&gt; to. I have no obligation to make be nice to this &lt;em&gt;&amp;quot;person&amp;quot;&lt;/em&gt;. It isn&amp;#39;t like going to school or leaving the house. &lt;/p&gt;\n\n&lt;p&gt;Do I handle situations like that the same way I&amp;#39;d handle things I &lt;em&gt;have&lt;/em&gt; to do? I guess my number one question is, is it worth all the stress? For the example I gave, do I tell myself it&amp;#39;s something I &lt;em&gt;have&lt;/em&gt; to do for the sake of my relationship?&lt;/p&gt;\n\n&lt;p&gt;I don&amp;#39;t know. I guess writing it out it&amp;#39;s like &amp;quot;Duh, it&amp;#39;s obviously the same thing....&amp;quot; But for some reason it just feels different to me. I can&amp;#39;t really put my finger on why. &lt;/p&gt;\n\n&lt;p&gt;This is one of my New Years resolutions. Maybe I just need confirmation I&amp;#39;m doing the right things. And some support from people who understand first hand would be nice. My boyfriend tries to help but he really has a hard time grasping all this. &lt;/p&gt;\n\n&lt;p&gt;:/ &lt;/p&gt;\n\n&lt;p&gt;Thanks for reading. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;", "selftext": "I guess I should start off by saying I was in therapy for most of my life. However I had to stop for a few reasons. (Couldn't afford it, no way to get there, etc.) I know I should go back and I think now I'm in a better situation to go back. So please don't lecture me about that part. Please. :/ \n\nWhen I was in therapy we talked about having to deal with doing things that made me upset and uncomfortable. But they were all things I HAD to do. Like go to school or leave the house, for example. I know how to deal with those situations. Expose myself little by little, use the techniques they taught me to stay calm, maybe have a support person, etc. I had to push myself. I had no choice. My mom would have gotten in trouble if I didn't go to school. It didn't matter how hard it was or how sick I felt, I had to. \n\nBut what about situations where it isn't necessary? What do I do for things like that? \n\nFor example, my boyfriend has this friend is is basically just a walking trigger for me. I don't want to get into detail but he makes fun of me a lot and says mean things about me. The worse part is he was 23 and made/let  my 14 year old sister suck his dick. (My PTSD comes from child abuse, which including sexual abuse...) Every time I'm near him I either throw up or almost throw up because I'm stressed and completely terrified. I shake. My head starts to hurt. It becomes hard to breathe. You guys now how it is, I'm sure. It sucks. My boyfriend has never forced me to be around him but I'm often put in a hard place when it comes to choosing whether or not to be near him. Today is New Years day and I'm not with my boyfriend because his friend is there. I wanted to spend the day with him so bad but my fear kept me from that. This guy did some terrible things to innocent people. I hate him. I don't wish anything good on him. I can't wait for the day he's rotting in hell. But I'd still like to get to a place in life where I can be in the same room as him and keep things civil. I mostly want to get there because I know it will mean a lot to my boyfriend and it would mean I don't have to miss time with my boyfriend. (He's a family friend of my boyfriend's so it's near to impossible for my boyfriend to cut him out of his life.) (I think it's important to note that I have my sisters blessings to be civil. She loves my boyfriend and wants us to be together forever. She knows this puts a strain on our relationship. And she's really not all that effected. She just doesn't want to be near my boyfriend's friend anymore.) \n\nBut I don't *have* to. I have no obligation to make be nice to this *\"person\"*. It isn't like going to school or leaving the house. \n\nDo I handle situations like that the same way I'd handle things I *have* to do? I guess my number one question is, is it worth all the stress? For the example I gave, do I tell myself it's something I *have* to do for the sake of my relationship?\n\nI don't know. I guess writing it out it's like \"Duh, it's obviously the same thing....\" But for some reason it just feels different to me. I can't really put my finger on why. \n\nThis is one of my New Years resolutions. Maybe I just need confirmation I'm doing the right things. And some support from people who understand first hand would be nice. My boyfriend tries to help but he really has a hard time grasping all this. \n\n:/ \n\nThanks for reading. ", "likes": null, "suggested_sort": "new", "mod_note": null, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "saved": false, "id": "2r2cyt", "banned_at_utc": null, "mod_reason_title": null, "view_count": null, "archived": true, "clicked": false, "no_follow": false, "author": "caviabella", "num_crossposts": 0, "link_flair_text": null, "can_mod_post": false, "send_replies": true, "pinned": false, "score": 3, "approved_by": null, "over_18": false, "domain": "self.ptsd", "hidden": false, "num_comments": 11, "thumbnail": "", "hide_score": false, "edited": false, "link_flair_css_class": null, "author_flair_css_class": null, "contest_mode": false, "gilded": 0, "locked": false, "downs": 0, "brand_safe": false, "subreddit_subscribers": 13131, "secure_media_embed": {}, "media_embed": {}, "stickied": false, "can_gild": false, "is_self": true, "parent_whitelist_status": null, "name": "t3_2r2cyt", "spoiler": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/", "subreddit_type": "public", "whitelist_status": null, "report_reasons": null, "created": 1420197694.0, "url": "https://www.reddit.com/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/", "author_flair_text": null, "quarantine": false, "title": "How should someone with PTSD handle situations they don't want to be in?", "created_utc": 1420168894.0, "subreddit_name_prefixed": "r/ptsd", "distinguished": null, "media": null, "upvote_ratio": 0.67, "mod_reports": [], "visited": false, "num_reports": null, "is_video": false, "ups": 3}}], "before": null}}, {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cndb4tj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnd9c2h", "score": 1, "approved_by": null, "downs": 0, "body": "I do think he needs therapy. I've sort of hinted that I want him to go. I think he would. But I know his parents wouldn't pay for it and there's no way he could afford it. They think there needs to be \"something wrong with you\" to need therapy. When I go back to therapy I could ask about him maybe being part of some of my sessions. Than maybe he could say it makes him feel a lot better about things and ask to go as well. I'm pretty sure at some point any therapist would want to talk with him anyway since he's my main support person. \n\nWe've been together for a while now and our relationship is very serious. We plan to get married in a few years (basically when I'm done with college). So I see his family as pretty typical annoying inlaws. So most of his family events aren't exactly the most fun days of my life regardless of who's there. They aren't *bad* people. They're just a lot different than my own family and I think some of the things they say and do are a bit weird.  I'm not worried about having fun at events. I just want to be a good wife, I guess. I know I have to do it for the sake of this relationship. And this relationship means the world to me. \n\nI think sometimes I'm *too* patient with myself. I think I should push myself a little harder than I do right now. I definitely want to take it slow but I need to do something to make progress. Like, I don't want the first step to be sitting in a room with the guy all day and night with no breaks. Maybe the first step could be going to the movies in a group. This way we're near each other but there won't be much talking. Only conversation before and after the movie. The only problem is this guy's family has no manners and they wouldn't think twice about inviting themselves over after. I suppose I could just go home or I could ask my boyfriend to come home with me regardless of what they do after. Does that sound like a good first step? \n\nI wish there was like a worksheet I could just fill out and give to my boyfriend so we could have a plan on how to help me be able to become comfortable at his family parties. Trying to think of every little detail of a plan can be so overwhelming! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I do think he needs therapy. I&amp;#39;ve sort of hinted that I want him to go. I think he would. But I know his parents wouldn&amp;#39;t pay for it and there&amp;#39;s no way he could afford it. They think there needs to be &amp;quot;something wrong with you&amp;quot; to need therapy. When I go back to therapy I could ask about him maybe being part of some of my sessions. Than maybe he could say it makes him feel a lot better about things and ask to go as well. I&amp;#39;m pretty sure at some point any therapist would want to talk with him anyway since he&amp;#39;s my main support person. &lt;/p&gt;\n\n&lt;p&gt;We&amp;#39;ve been together for a while now and our relationship is very serious. We plan to get married in a few years (basically when I&amp;#39;m done with college). So I see his family as pretty typical annoying inlaws. So most of his family events aren&amp;#39;t exactly the most fun days of my life regardless of who&amp;#39;s there. They aren&amp;#39;t &lt;em&gt;bad&lt;/em&gt; people. They&amp;#39;re just a lot different than my own family and I think some of the things they say and do are a bit weird.  I&amp;#39;m not worried about having fun at events. I just want to be a good wife, I guess. I know I have to do it for the sake of this relationship. And this relationship means the world to me. &lt;/p&gt;\n\n&lt;p&gt;I think sometimes I&amp;#39;m &lt;em&gt;too&lt;/em&gt; patient with myself. I think I should push myself a little harder than I do right now. I definitely want to take it slow but I need to do something to make progress. Like, I don&amp;#39;t want the first step to be sitting in a room with the guy all day and night with no breaks. Maybe the first step could be going to the movies in a group. This way we&amp;#39;re near each other but there won&amp;#39;t be much talking. Only conversation before and after the movie. The only problem is this guy&amp;#39;s family has no manners and they wouldn&amp;#39;t think twice about inviting themselves over after. I suppose I could just go home or I could ask my boyfriend to come home with me regardless of what they do after. Does that sound like a good first step? &lt;/p&gt;\n\n&lt;p&gt;I wish there was like a worksheet I could just fill out and give to my boyfriend so we could have a plan on how to help me be able to become comfortable at his family parties. Trying to think of every little detail of a plan can be so overwhelming! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cndb4tj", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cndb4tj/", "num_reports": null, "stickied": false, "created": 1420340355.0, "author_flair_text": null, "created_utc": 1420311555.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 5, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnd9c2h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CareflulWithThatAxe", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnd6h4k", "score": 1, "approved_by": null, "downs": 0, "body": "I have found that often the first step towards changing something about me (like you becoming less protective) a very valuable first step is understanding what is happening and why. Then understanding and forgiveness and patience all toward myself are called for. If I manage for it to not be this big and uncompromisable thing anymore, I am well on my way to change. Not that none of my behavior has changed yet. Patience about not being as patient with me as Id like is also good. :)\n\nIn that case this is not that trivial. Maybe he could look into therapy too? You probably already know, that he will need to maybe try a few therapists until he finds one he likes. Those are the most effective. Possibly avoiding such situations is the best for you for now. It will be a good experience if you take care of yourself too. IE you walked out and went home and missed the event, just because it was the thing you needed most at the moment. Being triggered is no state to enjoy any event.\n\nHealing takes time. Try to work on being patient with yourself.\n\nOh and let him read this thread if you think it does a decent job of explaining some things and you are comfortable with him reading this. Best of luck!", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;I have found that often the first step towards changing something about me (like you becoming less protective) a very valuable first step is understanding what is happening and why. Then understanding and forgiveness and patience all toward myself are called for. If I manage for it to not be this big and uncompromisable thing anymore, I am well on my way to change. Not that none of my behavior has changed yet. Patience about not being as patient with me as Id like is also good. :)&lt;/p&gt;\n\n&lt;p&gt;In that case this is not that trivial. Maybe he could look into therapy too? You probably already know, that he will need to maybe try a few therapists until he finds one he likes. Those are the most effective. Possibly avoiding such situations is the best for you for now. It will be a good experience if you take care of yourself too. IE you walked out and went home and missed the event, just because it was the thing you needed most at the moment. Being triggered is no state to enjoy any event.&lt;/p&gt;\n\n&lt;p&gt;Healing takes time. Try to work on being patient with yourself.&lt;/p&gt;\n\n&lt;p&gt;Oh and let him read this thread if you think it does a decent job of explaining some things and you are comfortable with him reading this. Best of luck!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnd9c2h", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnd9c2h/", "num_reports": null, "stickied": false, "created": 1420336723.0, "author_flair_text": null, "created_utc": 1420307923.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 4, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnd6h4k", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnd4v5o", "score": 2, "approved_by": null, "downs": 0, "body": "You explained the part about protecting my sister perfectly! I've been trying to not protect her so much. She has a boyfriend now and not too long into their relationship he asked why I didn't want him alone with my sister. I wasn't okay giving him details but I just said that I was very protective. He's such a sweet guy. He's perfect for her, honestly! So he's helping me to back off a little. He calls me out when I go too far. He also reassures me that he'd never hurt her. Even though they're young I do believe it. Even if they broke up I think it'll be very civil on not too hard on either of them. \n\nI'm not sure if he'd be okay completely leaving. His family is a bit....off?...I don't want to use the word crazy...and they would yell at him for leaving. They treat their adult children like little kids and it definitely left my boyfriend and his siblings a little messed up in the head. I do think he'd be okay stepping outside with me for a few minutes to take a breather and talk it out. I really like the codeword idea too! I just need to reassure my boyfriend that I'll make it as quick as possible and not keep him away from anyone for long enough that he'll get in trouble with his parents. \n\nThank you for reassuring me it's okay to follow my sister's wishes. \n\nI'll check out those links! Thank you!! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;You explained the part about protecting my sister perfectly! I&amp;#39;ve been trying to not protect her so much. She has a boyfriend now and not too long into their relationship he asked why I didn&amp;#39;t want him alone with my sister. I wasn&amp;#39;t okay giving him details but I just said that I was very protective. He&amp;#39;s such a sweet guy. He&amp;#39;s perfect for her, honestly! So he&amp;#39;s helping me to back off a little. He calls me out when I go too far. He also reassures me that he&amp;#39;d never hurt her. Even though they&amp;#39;re young I do believe it. Even if they broke up I think it&amp;#39;ll be very civil on not too hard on either of them. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m not sure if he&amp;#39;d be okay completely leaving. His family is a bit....off?...I don&amp;#39;t want to use the word crazy...and they would yell at him for leaving. They treat their adult children like little kids and it definitely left my boyfriend and his siblings a little messed up in the head. I do think he&amp;#39;d be okay stepping outside with me for a few minutes to take a breather and talk it out. I really like the codeword idea too! I just need to reassure my boyfriend that I&amp;#39;ll make it as quick as possible and not keep him away from anyone for long enough that he&amp;#39;ll get in trouble with his parents. &lt;/p&gt;\n\n&lt;p&gt;Thank you for reassuring me it&amp;#39;s okay to follow my sister&amp;#39;s wishes. &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ll check out those links! Thank you!! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnd6h4k", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnd6h4k/", "num_reports": null, "stickied": false, "created": 1420330312.0, "author_flair_text": null, "created_utc": 1420301512.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnd4v5o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CareflulWithThatAxe", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnc934q", "score": 1, "approved_by": null, "downs": 0, "body": "Multiple things. First off\n\n&gt;When me and my sister were abused as kids I had to protect her, I think maybe I reacted so bad because I let someone do something to her that I spent my whole childhood saving her from. She doesn't know it but I took as many beatings and other stuff as I possibly could she she wouldn't have to. I only failed once. She doesn't know.\n\nYour childhood, so you were a child. You got thrown into this terrible home with a great sister. No child can possibly know how to even begin to handle such shit. Yet you saw it was bad and it was about to come your sisters way. So you did the only thing you could think of that would protect her. You became her shield. You put yourself in *that* kind of harms way, on purpose, for her. That's the most selfless thing I can think of. An impossible situation and instead of seeking to flee it by running away or just retreating into the depths of your own psyche, you - as a child - stood and even went for seconds, giving her as much of the protection you lacked as you could. Take a breath, reflect on that. Apart from heroic, this is also some intense shit to go through. One can't just walk that off. That's bound to stick around in some way. So if a guy hurts her, of course your protective side gets activated! And that stuff goes deep. Logic is powerless. Stopping to protect her is bound to be hard, but I would advise to ever so gently try to reduce it. The situation is not the same anymore. However, have patience with yourself! It will take time.\n\nSo your boyfriend doesn't want to fight or he just can't. Provided he is ok with missing a family function or two, he could walk out with you and go home with you whenever that guy gets mean.  You'd need to talk to your bf and have a codeword or something to tell him, that this is unacceptable and to walk out with you. His family is bound to choose a son over a friend. That guy may change his behavior in response to this. If he did, I am sure you could learn to deal with him.\n\nHe is an ass, but it is not your job to go after every ass, therefore I think you should comply with your sister regarding reporting him. This, today, is only about you and your feelings. Your feelings matter! You are a full person as much worth as anyone else. If you decide being disrespecting of you for comic effect is not ok (very understandable), you have a right to do something about it.\n\nAs for the understanding part, you could ask your bf to read a few texts on the topic. /r/rapecounseling has great resources in its sidebar. Maybe look through them and point him to the relevant ones? He may never understand what is going on inside of you, but he can learn how to react to you and how to support you. With some basic knowledge a loved one can do a lot. Have your boyfriend read all the things!", "edited": 1420296955.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Multiple things. First off&lt;/p&gt;\n\n&lt;blockquote&gt;\n&lt;p&gt;When me and my sister were abused as kids I had to protect her, I think maybe I reacted so bad because I let someone do something to her that I spent my whole childhood saving her from. She doesn&amp;#39;t know it but I took as many beatings and other stuff as I possibly could she she wouldn&amp;#39;t have to. I only failed once. She doesn&amp;#39;t know.&lt;/p&gt;\n&lt;/blockquote&gt;\n\n&lt;p&gt;Your childhood, so you were a child. You got thrown into this terrible home with a great sister. No child can possibly know how to even begin to handle such shit. Yet you saw it was bad and it was about to come your sisters way. So you did the only thing you could think of that would protect her. You became her shield. You put yourself in &lt;em&gt;that&lt;/em&gt; kind of harms way, on purpose, for her. That&amp;#39;s the most selfless thing I can think of. An impossible situation and instead of seeking to flee it by running away or just retreating into the depths of your own psyche, you - as a child - stood and even went for seconds, giving her as much of the protection you lacked as you could. Take a breath, reflect on that. Apart from heroic, this is also some intense shit to go through. One can&amp;#39;t just walk that off. That&amp;#39;s bound to stick around in some way. So if a guy hurts her, of course your protective side gets activated! And that stuff goes deep. Logic is powerless. Stopping to protect her is bound to be hard, but I would advise to ever so gently try to reduce it. The situation is not the same anymore. However, have patience with yourself! It will take time.&lt;/p&gt;\n\n&lt;p&gt;So your boyfriend doesn&amp;#39;t want to fight or he just can&amp;#39;t. Provided he is ok with missing a family function or two, he could walk out with you and go home with you whenever that guy gets mean.  You&amp;#39;d need to talk to your bf and have a codeword or something to tell him, that this is unacceptable and to walk out with you. His family is bound to choose a son over a friend. That guy may change his behavior in response to this. If he did, I am sure you could learn to deal with him.&lt;/p&gt;\n\n&lt;p&gt;He is an ass, but it is not your job to go after every ass, therefore I think you should comply with your sister regarding reporting him. This, today, is only about you and your feelings. Your feelings matter! You are a full person as much worth as anyone else. If you decide being disrespecting of you for comic effect is not ok (very understandable), you have a right to do something about it.&lt;/p&gt;\n\n&lt;p&gt;As for the understanding part, you could ask your bf to read a few texts on the topic. &lt;a href=\"/r/rapecounseling\"&gt;/r/rapecounseling&lt;/a&gt; has great resources in its sidebar. Maybe look through them and point him to the relevant ones? He may never understand what is going on inside of you, but he can learn how to react to you and how to support you. With some basic knowledge a loved one can do a lot. Have your boyfriend read all the things!&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnd4v5o", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnd4v5o/", "num_reports": null, "stickied": false, "created": 1420325567.0, "author_flair_text": null, "created_utc": 1420296767.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cnch18o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnc93wo", "score": 1, "approved_by": null, "downs": 0, "body": "Cocoa fixes everything! So do guinea pig snuggles! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Cocoa fixes everything! So do guinea pig snuggles! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnch18o", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnch18o/", "num_reports": null, "stickied": false, "created": 1420261074.0, "author_flair_text": null, "created_utc": 1420232274.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 3, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnc93wo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "smilesbot", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnc934q", "score": 1, "approved_by": null, "downs": 0, "body": "Shh, it's okay. Drink some cocoa! :)", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Shh, it&amp;#39;s okay. Drink some cocoa! :)&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnc93wo", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnc93wo/", "num_reports": null, "stickied": false, "created": 1420246886.0, "author_flair_text": null, "created_utc": 1420218086.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnc934q", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnc56ju", "score": 2, "approved_by": null, "downs": 0, "body": "Wow! First of all, thank you for taking the time to write all this out! It means a lot. Thank you again for understanding so well! Thank you again again for the congratulations. It's still a struggle some days. I won't walk around campus for fun yet, just from the car to the classroom and back again, but I'm proud of myself for just going! \n\nYou described how I feel perfectly. \n\nWhen me and my sister were abused as kids I had to protect her, I think maybe I reacted so bad because I let someone do something to her that I spent my whole childhood saving her from. She doesn't know it but I took as many beatings and *other stuff* as I possibly could she she wouldn't have to. I only failed once. She doesn't know.\n\nHe knows everything. I can't think of anything I haven't told him. I've tried to explain what the terror that is PTSD is like. I personally think I did okay at explaining it but he's having a hard time grasping it. I can get really angry when I'm triggered. And I also am human with emotions and sometimes I get angry for *\"real\"* reasons. I think he has a hard time telling the difference. So sometimes I'm yelling at him and being flat out mean to him and he fights back and hurts me worse because he doesn't realize I'm scared and can't express it. I know therapy will help me to learn to express how I feel but I'm scared to call people up and make appointments and getting my mom to sit still for 5 minutes is almost impossible. In the mean time I told him that when I get angry to say something like \"Babe, you're scared. What are you scared of? I love you and I'm here for you. You can tell me. I'll help you. I won't judge you.\" because 99% of the time knowing he loves me and wants to help me through this makes me feel better. He needs to realize this is hard on me and have a little more patients than he does. Before he fights back or tries to get me to talk he needs to calm me down. He's really good at calming me down. It's just when I get angry at him he fights back. I guess that's a reasonable reacting. Am I asking too much from him? \n\nI felt really good when I realized I was really going to school and I mostly overcame my fear. I'd definitely like to feel that feeling again. Not having this straining our relationship would be a nice feeling too. I definitely want to try. But I really need my boyfriend to understand PTSD better. I think what I need to tell him that PTSD isn't something that comes and goes, it's always there. We need to work on things when I'm calm. He can't wait until I blow up and have a huge fight with him to be like \"Okay. What's really bothering you?\".  \n\nI can recall one time he handle things perfectly. I got into a car accident and the man yelled at me (even though it was his fault). I was alone with two angry adults and was threatened with police action. I was very triggered and very terrified. When I got home I completely fell apart. I couldn't stop shaking and crying. My boyfriend said I was crying so hard I was turning colors. He sat with me for a while just holding me and saying \"Shhhh. It's okay. You're safe.\" and when I wasn't crying and shaking as bad he got me some cold water to sip on. I just wish he could keep his cool like that *all* the time. He handled that flawlessly. \n\nAm I being a terrible person for this? Another person commented that I should report my boyfriend's friend. The completely goes against everything my sister wants. (It's the only other comment if you want to read that and my reply.) But after that person's comment I wonder if I'm being absolute scum for even considering trying to overcome this fear and be able to tolerate him. \n\nThe most my boyfriend will do when it comes to sticking up for me is just shake his head and say no. I love my boyfriend, I really do. He's absolutely amazing. I have to be honest though, he's a major pussy. He had a \"friend\" during high school that beat him to a bloody mess every day. The friend would do illegal things (like make bombs) and make it look like my boyfriend did it. He'd write horrible racist things and write my boyfriend's name on it. It was *bad*. My boyfriend could have ended up dead (the kid killed animals, anyway) or in jail. You know what my boyfriend did? Nothing. He was nice to him and was a great friend to him. Yeah, it's bad. I know a few people called the police a few times, but his dad is a cop or something so he never gets in trouble. So if my boyfriend can't stick up to someone that like I know he isn't going to get into a screaming match with someone he's known so long. The most I know he'll do (and does) is leave the room if it gets bad. The worst they've said in front of me is something along the lines of \"When are you going to get laid, Mike? You need a girl with big juicy titties so you can finally get fucked.\"  I'm barely a B so I know he wasn't implying he should have sex with me. \"You need a girl...\" implies he doesn't have one already. And they assume I can't have sex because I'm \"fat\" and I won't because according to them I'm a total prude. He just was like \"*-awkward laugh-* Stop. I do.\" And than smiled at me. \n\nIt was definitely coherent and helped SO much! If you don't mind, I'm actually going to have my boyfriend read your reply! ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Wow! First of all, thank you for taking the time to write all this out! It means a lot. Thank you again for understanding so well! Thank you again again for the congratulations. It&amp;#39;s still a struggle some days. I won&amp;#39;t walk around campus for fun yet, just from the car to the classroom and back again, but I&amp;#39;m proud of myself for just going! &lt;/p&gt;\n\n&lt;p&gt;You described how I feel perfectly. &lt;/p&gt;\n\n&lt;p&gt;When me and my sister were abused as kids I had to protect her, I think maybe I reacted so bad because I let someone do something to her that I spent my whole childhood saving her from. She doesn&amp;#39;t know it but I took as many beatings and &lt;em&gt;other stuff&lt;/em&gt; as I possibly could she she wouldn&amp;#39;t have to. I only failed once. She doesn&amp;#39;t know.&lt;/p&gt;\n\n&lt;p&gt;He knows everything. I can&amp;#39;t think of anything I haven&amp;#39;t told him. I&amp;#39;ve tried to explain what the terror that is PTSD is like. I personally think I did okay at explaining it but he&amp;#39;s having a hard time grasping it. I can get really angry when I&amp;#39;m triggered. And I also am human with emotions and sometimes I get angry for &lt;em&gt;&amp;quot;real&amp;quot;&lt;/em&gt; reasons. I think he has a hard time telling the difference. So sometimes I&amp;#39;m yelling at him and being flat out mean to him and he fights back and hurts me worse because he doesn&amp;#39;t realize I&amp;#39;m scared and can&amp;#39;t express it. I know therapy will help me to learn to express how I feel but I&amp;#39;m scared to call people up and make appointments and getting my mom to sit still for 5 minutes is almost impossible. In the mean time I told him that when I get angry to say something like &amp;quot;Babe, you&amp;#39;re scared. What are you scared of? I love you and I&amp;#39;m here for you. You can tell me. I&amp;#39;ll help you. I won&amp;#39;t judge you.&amp;quot; because 99% of the time knowing he loves me and wants to help me through this makes me feel better. He needs to realize this is hard on me and have a little more patients than he does. Before he fights back or tries to get me to talk he needs to calm me down. He&amp;#39;s really good at calming me down. It&amp;#39;s just when I get angry at him he fights back. I guess that&amp;#39;s a reasonable reacting. Am I asking too much from him? &lt;/p&gt;\n\n&lt;p&gt;I felt really good when I realized I was really going to school and I mostly overcame my fear. I&amp;#39;d definitely like to feel that feeling again. Not having this straining our relationship would be a nice feeling too. I definitely want to try. But I really need my boyfriend to understand PTSD better. I think what I need to tell him that PTSD isn&amp;#39;t something that comes and goes, it&amp;#39;s always there. We need to work on things when I&amp;#39;m calm. He can&amp;#39;t wait until I blow up and have a huge fight with him to be like &amp;quot;Okay. What&amp;#39;s really bothering you?&amp;quot;.  &lt;/p&gt;\n\n&lt;p&gt;I can recall one time he handle things perfectly. I got into a car accident and the man yelled at me (even though it was his fault). I was alone with two angry adults and was threatened with police action. I was very triggered and very terrified. When I got home I completely fell apart. I couldn&amp;#39;t stop shaking and crying. My boyfriend said I was crying so hard I was turning colors. He sat with me for a while just holding me and saying &amp;quot;Shhhh. It&amp;#39;s okay. You&amp;#39;re safe.&amp;quot; and when I wasn&amp;#39;t crying and shaking as bad he got me some cold water to sip on. I just wish he could keep his cool like that &lt;em&gt;all&lt;/em&gt; the time. He handled that flawlessly. &lt;/p&gt;\n\n&lt;p&gt;Am I being a terrible person for this? Another person commented that I should report my boyfriend&amp;#39;s friend. The completely goes against everything my sister wants. (It&amp;#39;s the only other comment if you want to read that and my reply.) But after that person&amp;#39;s comment I wonder if I&amp;#39;m being absolute scum for even considering trying to overcome this fear and be able to tolerate him. &lt;/p&gt;\n\n&lt;p&gt;The most my boyfriend will do when it comes to sticking up for me is just shake his head and say no. I love my boyfriend, I really do. He&amp;#39;s absolutely amazing. I have to be honest though, he&amp;#39;s a major pussy. He had a &amp;quot;friend&amp;quot; during high school that beat him to a bloody mess every day. The friend would do illegal things (like make bombs) and make it look like my boyfriend did it. He&amp;#39;d write horrible racist things and write my boyfriend&amp;#39;s name on it. It was &lt;em&gt;bad&lt;/em&gt;. My boyfriend could have ended up dead (the kid killed animals, anyway) or in jail. You know what my boyfriend did? Nothing. He was nice to him and was a great friend to him. Yeah, it&amp;#39;s bad. I know a few people called the police a few times, but his dad is a cop or something so he never gets in trouble. So if my boyfriend can&amp;#39;t stick up to someone that like I know he isn&amp;#39;t going to get into a screaming match with someone he&amp;#39;s known so long. The most I know he&amp;#39;ll do (and does) is leave the room if it gets bad. The worst they&amp;#39;ve said in front of me is something along the lines of &amp;quot;When are you going to get laid, Mike? You need a girl with big juicy titties so you can finally get fucked.&amp;quot;  I&amp;#39;m barely a B so I know he wasn&amp;#39;t implying he should have sex with me. &amp;quot;You need a girl...&amp;quot; implies he doesn&amp;#39;t have one already. And they assume I can&amp;#39;t have sex because I&amp;#39;m &amp;quot;fat&amp;quot; and I won&amp;#39;t because according to them I&amp;#39;m a total prude. He just was like &amp;quot;&lt;em&gt;-awkward laugh-&lt;/em&gt; Stop. I do.&amp;quot; And than smiled at me. &lt;/p&gt;\n\n&lt;p&gt;It was definitely coherent and helped SO much! If you don&amp;#39;t mind, I&amp;#39;m actually going to have my boyfriend read your reply! &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnc934q", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnc934q/", "num_reports": null, "stickied": false, "created": 1420246843.0, "author_flair_text": null, "created_utc": 1420218043.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnc56ju", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "CareflulWithThatAxe", "can_mod_post": false, "send_replies": true, "parent_id": "t3_2r2cyt", "score": 1, "approved_by": null, "downs": 0, "body": "All this is just from what I read here. Please DO correct me wherever I am wrong. \n\nFirst off, congratulations on all these successes! We all know that things that are trivial to others can be completely impossible for us. Getting to a place where you can do some of these things is an impressive feat!\n\nIt seems to me, that there are two parts to that situation. One part is your sister, whom you love and whom he hurt. Thankfully not all that bad, so she can just see him as an ass and be done with it. The other side is your feelings. He showed behavior that reminds you of your trauma too much for comfort. What is worse he did that to your little sister! You want to move past it (another feat!), but he continuously is mean to you. A person that reminds you of that AND shows you no respect. Damn. Most people with PTSD have little self esteem just because of the nature of PTSD and we are positively terrified of helplessness, of another trauma. If someone shows they do not respect us as a person, it tells us they might become the source of our next trauma. The survival part (read: basic and powerful) of our brains will make us avoid anyone like that.\n\nNow to your boyfriend. How much does he know? Does he know the feelings and sheer terror this person causes you? Does he understand? If you answer any of these questions with anything but a clear yes, I strongly suggest talking to him. If you don't know how, ask here, maybe we can help. Even if not, typing it out may help organize your thoughts.\n\nOn a very practical level you could tell your boyfriend that you want to spend more time with him and be part of his life and family, but that this guy just causes your brain to mistake the presence with the time you were abused as a kid. Being triggered is exactly that. To us the trauma is happening. This can happen to different extents. However getting raped again while in a childes mind is terrible in any extent.\n\nTo your questions: This is up to you. It boils down to: Would you rather go through that again and do what you did with going to school, or would you rather avoid that guy. Now I don't think being with your boyfriend is tied to that guy. Your boyfriend SEES him making fun of you. So even if he gets none of the PTSD things, he really should be on your side against him. Maybe you can ask your boyfriend to stand up for you when that guy makes fun of you next time. (provided you see that guy again.)\n\nMy focus is crumbling, so I have to leave it at that for now. I hope it is coherent and all that.", "edited": 1420209552.0, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;All this is just from what I read here. Please DO correct me wherever I am wrong. &lt;/p&gt;\n\n&lt;p&gt;First off, congratulations on all these successes! We all know that things that are trivial to others can be completely impossible for us. Getting to a place where you can do some of these things is an impressive feat!&lt;/p&gt;\n\n&lt;p&gt;It seems to me, that there are two parts to that situation. One part is your sister, whom you love and whom he hurt. Thankfully not all that bad, so she can just see him as an ass and be done with it. The other side is your feelings. He showed behavior that reminds you of your trauma too much for comfort. What is worse he did that to your little sister! You want to move past it (another feat!), but he continuously is mean to you. A person that reminds you of that AND shows you no respect. Damn. Most people with PTSD have little self esteem just because of the nature of PTSD and we are positively terrified of helplessness, of another trauma. If someone shows they do not respect us as a person, it tells us they might become the source of our next trauma. The survival part (read: basic and powerful) of our brains will make us avoid anyone like that.&lt;/p&gt;\n\n&lt;p&gt;Now to your boyfriend. How much does he know? Does he know the feelings and sheer terror this person causes you? Does he understand? If you answer any of these questions with anything but a clear yes, I strongly suggest talking to him. If you don&amp;#39;t know how, ask here, maybe we can help. Even if not, typing it out may help organize your thoughts.&lt;/p&gt;\n\n&lt;p&gt;On a very practical level you could tell your boyfriend that you want to spend more time with him and be part of his life and family, but that this guy just causes your brain to mistake the presence with the time you were abused as a kid. Being triggered is exactly that. To us the trauma is happening. This can happen to different extents. However getting raped again while in a childes mind is terrible in any extent.&lt;/p&gt;\n\n&lt;p&gt;To your questions: This is up to you. It boils down to: Would you rather go through that again and do what you did with going to school, or would you rather avoid that guy. Now I don&amp;#39;t think being with your boyfriend is tied to that guy. Your boyfriend SEES him making fun of you. So even if he gets none of the PTSD things, he really should be on your side against him. Maybe you can ask your boyfriend to stand up for you when that guy makes fun of you next time. (provided you see that guy again.)&lt;/p&gt;\n\n&lt;p&gt;My focus is crumbling, so I have to leave it at that for now. I hope it is coherent and all that.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnc56ju", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnc56ju/", "num_reports": null, "stickied": false, "created": 1420238056.0, "author_flair_text": null, "created_utc": 1420209256.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}, {"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 2, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": {"kind": "Listing", "data": {"after": null, "whitelist_status": null, "modhash": "", "dist": null, "children": [{"kind": "t1", "data": {"subreddit_id": "t5_2qm0x", "approved_at_utc": null, "ups": 1, "mod_reason_by": null, "banned_by": null, "removal_reason": null, "link_id": "t3_2r2cyt", "likes": null, "no_follow": true, "replies": "", "user_reports": [], "saved": false, "id": "cncydvp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "[deleted]", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnc87b9", "score": 1, "approved_by": null, "downs": 0, "body": "http://victimsofcrime.org/docs/DNA%20Resource%20Center/sol-for-sexual-assault-check-chart---final---copy.pdf?sfvrsn=2\n\nfind your state, but mostly there is no limit. i doubt she will testify which will make it hard though, but it would inconvenience him and he might be dumb enough to do a plea deal", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;&lt;a href=\"http://victimsofcrime.org/docs/DNA%20Resource%20Center/sol-for-sexual-assault-check-chart---final---copy.pdf?sfvrsn=2\"&gt;http://victimsofcrime.org/docs/DNA%20Resource%20Center/sol-for-sexual-assault-check-chart---final---copy.pdf?sfvrsn=2&lt;/a&gt;&lt;/p&gt;\n\n&lt;p&gt;find your state, but mostly there is no limit. i doubt she will testify which will make it hard though, but it would inconvenience him and he might be dumb enough to do a plea deal&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": false, "subreddit": "ptsd", "name": "t1_cncydvp", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cncydvp/", "num_reports": null, "stickied": false, "created": 1420297146.0, "author_flair_text": null, "created_utc": 1420268346.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 2, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnc87b9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "caviabella", "can_mod_post": false, "send_replies": true, "parent_id": "t1_cnbz896", "score": 1, "approved_by": null, "downs": 0, "body": "This happened years ago and my sister hasn't been anywhere near him and no one even says his name around her. \n\nMy boyfriend understands, it's just that this friend and his family have been friends with my boyfriend's family for over 20 years. He might try to avoid him (he does) but he can't control what his parents or siblings do. There are times he's specifically told his sister (in front of me) please don't invite those people over and she looked him right in the eyes and called them to come over. *His sister is another rant itself though. She's out of control. Even her parents can't stop her.*\n\nI've begging my sister to. I've literally got on my knees and begged at one point. I assumed she was completely traumatized by the experience. But she doesn't want to. She's dead set against it. She said that I have no proof and if I reported him she'd say she was lying. At first I thought maybe she was scared to go through court stuff. We had to go through that stuff when our parents got divorced and maybe she remembers how tough it can be. But than she kind of hinted that it was because she liked him at the time it happened. I knew she had a crush on him but she knew that he was too old for her. I know she flirted with him a lot. I know physically she fit my boyfriend's friend's taste perfectly.  Personally, I don't think that's an excuse. He should have known better. I feel like my sister's logic is victim blaming, even though she's the victim herself. \n\nLike I said in the post, she's okay with it. It doesn't really bother her. She has the same attitude I have when it comes to guys I was with and probably shouldn't have been. It's like \"Haha. Oh, that's embarrassing.Glad that's over.\" kind of attitude. *I* *thought* would be traumatized, but she really is just like \"Whatever. He's weird. Keep him away.\" Like a creepy ex or something. She literally said to me \"I'm not even upset over this, get over it too, CaviaBella.\" She wants me to overcome how I feel and be able to be in the same room as him. She knows I'll never like him or be his friend. But she wants me to be able to tolerate being in the same room as him. \n\nI know my sister like the back of my hand. We grew up close in age and my mom treated us like twins. I swear we can communicate without talking. We're super close. I know she's telling me the truth about how she feels and what she wants. I'm positive that reporting this and going through court stuff will be what's traumatizing to her, not even the event that took place. I know what he did was wrong and I'd like to see him punished. But my sister is epileptic and she's gotten seizures due to stress more than once and I'm not risking her health to go against her wishes even if I think it's the right thing to do. ", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": true, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;This happened years ago and my sister hasn&amp;#39;t been anywhere near him and no one even says his name around her. &lt;/p&gt;\n\n&lt;p&gt;My boyfriend understands, it&amp;#39;s just that this friend and his family have been friends with my boyfriend&amp;#39;s family for over 20 years. He might try to avoid him (he does) but he can&amp;#39;t control what his parents or siblings do. There are times he&amp;#39;s specifically told his sister (in front of me) please don&amp;#39;t invite those people over and she looked him right in the eyes and called them to come over. &lt;em&gt;His sister is another rant itself though. She&amp;#39;s out of control. Even her parents can&amp;#39;t stop her.&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;ve begging my sister to. I&amp;#39;ve literally got on my knees and begged at one point. I assumed she was completely traumatized by the experience. But she doesn&amp;#39;t want to. She&amp;#39;s dead set against it. She said that I have no proof and if I reported him she&amp;#39;d say she was lying. At first I thought maybe she was scared to go through court stuff. We had to go through that stuff when our parents got divorced and maybe she remembers how tough it can be. But than she kind of hinted that it was because she liked him at the time it happened. I knew she had a crush on him but she knew that he was too old for her. I know she flirted with him a lot. I know physically she fit my boyfriend&amp;#39;s friend&amp;#39;s taste perfectly.  Personally, I don&amp;#39;t think that&amp;#39;s an excuse. He should have known better. I feel like my sister&amp;#39;s logic is victim blaming, even though she&amp;#39;s the victim herself. &lt;/p&gt;\n\n&lt;p&gt;Like I said in the post, she&amp;#39;s okay with it. It doesn&amp;#39;t really bother her. She has the same attitude I have when it comes to guys I was with and probably shouldn&amp;#39;t have been. It&amp;#39;s like &amp;quot;Haha. Oh, that&amp;#39;s embarrassing.Glad that&amp;#39;s over.&amp;quot; kind of attitude. &lt;em&gt;I&lt;/em&gt; &lt;em&gt;thought&lt;/em&gt; would be traumatized, but she really is just like &amp;quot;Whatever. He&amp;#39;s weird. Keep him away.&amp;quot; Like a creepy ex or something. She literally said to me &amp;quot;I&amp;#39;m not even upset over this, get over it too, CaviaBella.&amp;quot; She wants me to overcome how I feel and be able to be in the same room as him. She knows I&amp;#39;ll never like him or be his friend. But she wants me to be able to tolerate being in the same room as him. &lt;/p&gt;\n\n&lt;p&gt;I know my sister like the back of my hand. We grew up close in age and my mom treated us like twins. I swear we can communicate without talking. We&amp;#39;re super close. I know she&amp;#39;s telling me the truth about how she feels and what she wants. I&amp;#39;m positive that reporting this and going through court stuff will be what&amp;#39;s traumatizing to her, not even the event that took place. I know what he did was wrong and I&amp;#39;d like to see him punished. But my sister is epileptic and she&amp;#39;s gotten seizures due to stress more than once and I&amp;#39;m not risking her health to go against her wishes even if I think it&amp;#39;s the right thing to do. &lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnc87b9", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnc87b9/", "num_reports": null, "stickied": false, "created": 1420245111.0, "author_flair_text": null, "created_utc": 1420216311.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 1, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}, "user_reports": [], "saved": false, "id": "cnbz896", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": true, "report_reasons": null, "author": "hulahulagirl", "can_mod_post": false, "send_replies": true, "parent_id": "t3_2r2cyt", "score": 2, "approved_by": null, "downs": 0, "body": "Report him for statuatory rape, don't be near him, don't let your sister be near him and if your boyfriend doesn't understand your reaction, explain it to him. If he doesn't support you, evaluate your relationship. Good luck.", "edited": false, "author_flair_css_class": null, "collapsed": false, "is_submitter": false, "collapsed_reason": null, "body_html": "&lt;div class=\"md\"&gt;&lt;p&gt;Report him for statuatory rape, don&amp;#39;t be near him, don&amp;#39;t let your sister be near him and if your boyfriend doesn&amp;#39;t understand your reaction, explain it to him. If he doesn&amp;#39;t support you, evaluate your relationship. Good luck.&lt;/p&gt;\n&lt;/div&gt;", "subreddit_type": "public", "can_gild": true, "subreddit": "ptsd", "name": "t1_cnbz896", "score_hidden": false, "permalink": "/r/ptsd/comments/2r2cyt/how_should_someone_with_ptsd_handle_situations/cnbz896/", "num_reports": null, "stickied": false, "created": 1420213060.0, "author_flair_text": null, "created_utc": 1420184260.0, "subreddit_name_prefixed": "r/ptsd", "controversiality": 0, "depth": 0, "mod_reports": [], "mod_note": null, "distinguished": null}}], "before": null}}]